{
  "Hey! Let's get acquainted with Scratch": "Hey! Machen wir uns mit Scratch vertraut",
  "Here are the tasks that need to be completed. To hide this window, click on the purple line to the left of the text. To reopen the tasks, click on the purple line in the upper right corner. You can find information about useful buttons in Scratch in the task list below. Let's open the first one!": "Hier sind die Aufgaben, die erledigt werden müssen. Um dieses Fenster auszublenden, klicken Sie auf die violette Linie links neben dem Text.\nUm die Aufgaben erneut zu öffnen, klicken Sie auf die violette Linie in der oberen rechten Ecke.\n\nInformationen zu nützlichen Schaltflächen in Scratch finden Sie in der Aufgabenliste unten.\nÖffnen wir die erste!",
  "Add a background": "Hintergrund hinzufügen",
  "Add a background to your project. Click on the animation above to see how. When the background is ready, mark the task completed by checking the box and move on to the next task!": "Fügen Sie Ihrem Projekt einen Hintergrund hinzu. Klicken Sie auf die Animation oben, um zu sehen, wie das geht.\nWenn der Hintergrund fertig ist, markieren Sie die Aufgabe als erledigt, indem Sie das Kontrollkästchen aktivieren, und fahren Sie mit der nächsten Aufgabe fort!",
  "Add sprites": "Sprites hinzufügen",
  "A sprite is a character that we program in Scratch. Add a sprite, size it, and move it to the desired location.": "Ein Sprite ist eine Figur, die wir in Scratch programmieren. Fügen Sie ein Sprite hinzu, passen Sie seine Größe an und verschieben Sie es an die gewünschte Stelle.",
  "Delete the extra sprite": "Löschen Sie das zusätzliche Sprite",
  "Click on the x to delete the sprite. If you delete a sprite by accident, click \"Edit\" -> \"Restore Sprite.\"": "Klicken Sie auf das x, um das Sprite zu löschen. Wenn Sie ein Sprite versehentlich löschen, klicken Sie auf \"Bearbeiten\" -> \"Sprite wiederherstellen.\"",
  "Save the project": "Speichern Sie das Projekt",
  "Click the \"Save\" button to save all the latest changes to the project!": "Klicken Sie auf die \"Speichern\"-Schaltfläche, um alle letzten Änderungen am Projekt zu speichern!",
  "Choose and add a suitable background for these characters! Click on the animation and see how to add a background.": "Wählen Sie einen passenden Hintergrund für diese Figuren aus und fügen Sie ihn hinzu! Klicken Sie auf die Animation und sehen Sie, wie Sie einen Hintergrund hinzufügen.",
  "Add a suitable background": "Fügen Sie einen passenden Hintergrund hinzu",
  "Save the project and go to the next level": "Speichern Sie das Projekt und gehen Sie zum nächsten Level",
  "Add suitable sprites": "Fügen Sie passende Sprites hinzu",
  "What sprites would look good against this background?": "Welche Sprites würden vor diesem Hintergrund gut aussehen?",
  "Move the sprites to suitable places using the mouse": "Verschieben Sie die Sprites mit der Maus an die passenden Stellen",
  "To delete a sprite, click on the x next to it.": "Um ein Sprite zu löschen, klicken Sie auf das x daneben.",
  "Choose a suitable background": "Wählen Sie einen passenden Hintergrund",
  "Please note: there are already a few ready-made backgrounds in the project. You just need to choose the right one.": "Bitte beachten Sie: Es gibt bereits einige vorgefertigte Hintergründe im Projekt. Sie müssen nur den richtigen auswählen.",
  "Choose a background from those that are available in the project": "Wählen Sie einen Hintergrund aus denen aus, die im Projekt verfügbar sind",
  "Choose the costume you want": "Wählen Sie das gewünschte Kostüm aus",
  "Let the dog look at you. Can you find the right costume?": "Lassen Sie sich vom Hund ansehen. Können Sie das richtige Kostüm finden?",
  "Ask a question": "Stellen Sie eine Frage",
  "If you can't solve a task, write to the teacher in the special chat — Marsgram!": "Wenn Sie eine Aufgabe nicht lösen können, schreiben Sie dem Lehrer im speziellen Chat – Marsgram!",
  "Add a phrase": "Fügen Sie einen Satz hinzu",
  "What will your snowman say?": "Was wird Ihr Schneemann sagen?",
  "The start of the script": "Der Beginn des Skripts",
  "The script starts with the command \"When the green flag is clicked.\"": "Das Skript beginnt mit dem Befehl \"Wenn auf die grüne Flagge geklickt wird.\"",
  "Finish the Mars project": "Das Mars-Projekt beenden",
  "Look, the programmer hasn't completed this project! Finish it.": "Schauen Sie, der Programmierer hat dieses Projekt nicht abgeschlossen! Beenden Sie es.",
  "Change the background from Earth to Mars": "Ändern Sie den Hintergrund von der Erde zum Mars",
  "Use the command \"speak...\"": "Verwenden Sie den Befehl \"sprechen...\"",
  "Choose and add a suitable background for these characters!": "Wählen und fügen Sie einen passenden Hintergrund für diese Charaktere hinzu!",
  "Finish the project at your own discretion": "Beenden Sie das Projekt nach eigenem Ermessen",
  "See how the project should work": "Sehen Sie, wie das Projekt funktionieren soll",
  "Add a command to start the project": "Fügen Sie einen Befehl hinzu, um das Projekt zu starten",
  "The project should be run by clicking on the green flag.": "Das Projekt sollte durch Klicken auf die grüne Flagge gestartet werden.",
  "Add a command for the bear to speak.": "Fügen Sie einen Befehl hinzu, damit der Bär spricht.",
  "The bear should say \"Hello!\" within 3 seconds.": "Der Bär sollte innerhalb von 3 Sekunden \"Hallo!\" sagen.",
  
  "Dinosaur and snake": "Dinosaurier und Schlange",
  "The snake first wriggles, then sees the dinosaur, is surprised, and then straightens its body. How do we program this?": "Die Schlange windet sich zunächst, sieht dann den Dinosaurier, ist überrascht und richtet dann ihren Körper auf. Wie programmieren wir das?",
  "Start of the script": "Start des Skripts",
  "The \"When the green flag is pressed\" command starts the script.": "Der Befehl \"Wenn die grüne Flagge angeklickt wird\" startet das Skript.",
  "Setting the costume": "Einstellen des Kostüms",
  "This command will help you to set a specific costume. We have two different costumes set.": "Dieser Befehl hilft Ihnen, ein bestimmtes Kostüm festzulegen. Wir haben zwei verschiedene Kostüme eingestellt.",
  "Expectation": "Erwartung",
  "The snake sees the dinosaur in a second instead of immediately. To prevent it from changing its costume ahead of time, we use the \"wait __ sec\" command": "Die Schlange sieht den Dinosaurier erst nach einer Sekunde statt sofort. Um zu verhindern, dass sie ihr Kostüm zu früh wechselt, verwenden wir den Befehl \"warte __ Sek\".",

  "The \"Heart\" project": "Das \"Herz\"-Projekt",
  "Take a look at the example. The heart changes costume 4 times. Each costume is visible for 1 second. Can you do the same?": "Schauen Sie sich das Beispiel an. Das Herz wechselt viermal das Kostüm. Jedes Kostüm ist für 1 Sekunde sichtbar. Können Sie das auch?",
  "Costume change": "Kostümwechsel",
  "The \"Next Costume\" command changes the costume that is set next in the list of costumes.": "Der Befehl \"Nächstes Kostüm\" ändert das nächste Kostüm in der Liste.",
  "Repeating actions": "Wiederholende Aktionen",
  "For the sprite to perform an action multiple times, you need to use the \"Repeat __ times\" command. In the window, you can set the number of repetitions.": "Damit die Figur eine Aktion mehrmals ausführt, müssen Sie den Befehl \"Wiederhole __ mal\" verwenden. Im Fenster können Sie die Anzahl der Wiederholungen festlegen.",
  "Oops! If we use the \"Next costume\" command multiple times in a row, the costumes will change too quickly and we will not see how they change: it will be like nothing is happening. To prevent commands from being executed almost simultaneously, we insert a \"pause.\" To do this, we need the \"Wait __ sec\" command.": "Ups! Wenn wir den Befehl \"Nächstes Kostüm\" mehrmals hintereinander verwenden, wechseln die Kostüme zu schnell, und wir sehen nicht, wie sie sich ändern – es sieht aus, als würde nichts passieren. Damit die Befehle nicht gleichzeitig ausgeführt werden, fügen wir eine \"Pause\" ein. Dafür brauchen wir den Befehl \"Warte __ Sek\".",

  "The bear walks": "Der Bär läuft",
  "Program a costume change so that it seems like the bear is constantly walking! See the example.": "Programmieren Sie einen Kostümwechsel, sodass es so aussieht, als würde der Bär ständig laufen! Sehen Sie sich das Beispiel an.",
  "Constant repetition": "Ständige Wiederholung",
  "To make an action repeat itself constantly, use the \"Repeat Always\" command.": "Damit eine Aktion ständig wiederholt wird, verwenden Sie den Befehl \"Wiederhole immer\".",
  "Smooth movements": "Sanfte Bewegungen",
  "You can make the movements smoother by setting a wait before each costume change. We can set the wait time. Try setting it for 0.1 seconds! This command is already ready — just put it in the right place.": "Sie können die Bewegungen sanfter gestalten, indem Sie eine Wartezeit vor jedem Kostümwechsel einfügen. Sie können die Wartezeit festlegen. Versuchen Sie, sie auf 0,1 Sekunden zu setzen! Dieser Befehl ist bereits fertig – setzen Sie ihn einfach an die richtige Stelle.",
  "Remember where the script starts?": "Erinnern Sie sich, wo das Skript beginnt?",
  
  "Create a clock!": "Erstellen Sie eine Uhr!",
  "Look, all the backgrounds you need are already there, you just need to change them every second.": "Schauen Sie, alle benötigten Hintergründe sind bereits da, Sie müssen sie nur jede Sekunde ändern.",
  "Set the first background": "Setzen Sie den ersten Hintergrund",
  "Let the clock hands start moving from 12.": "Lassen Sie die Zeiger der Uhr bei 12 starten.",
  "Change the background": "Hintergrund ändern",
  "Change the background using the \"Next Background\" command. Program the background to change every second.": "Ändern Sie den Hintergrund mit dem Befehl \"Nächster Hintergrund\". Programmieren Sie den Hintergrund so, dass er sich jede Sekunde ändert.",
  "Program the background change to repeat": "Programmieren Sie die Wiederholung des Hintergrundwechsels",
  "If you accidentally delete the script": "Wenn Sie das Skript versehentlich löschen",
  "Simultaneously press the \"CTRL\" and \"Z\" keys in the lower-left corner of the keyboard.": "Drücken Sie gleichzeitig die Tasten \"STRG\" und \"Z\" in der unteren linken Ecke der Tastatur.",

  "Super cat": "Super-Katze",
  "The super cat grows in size. Program the same!": "Die Super-Katze wächst. Programmieren Sie dasselbe!",
  "Smoothly resize the sprite using a loop": "Ändern Sie die Größe der Figur sanft mit einer Schleife.",
  "Use a loop to resize smoothly.": "Verwenden Sie eine Schleife, um die Größe sanft zu ändern.",
  "Set the size": "Größe festlegen",
  "Set the size you want at the beginning of the script.": "Legen Sie die gewünschte Größe zu Beginn des Skripts fest.",
  "Cat talks": "Die Katze spricht",
  "The cat should say \"I am super cat!\" before growing.": "Die Katze sollte \"Ich bin Super-Katze!\" sagen, bevor sie wächst.",
  "Sprite size": "Figurengröße",
  "Here you can find out what size the sprite is now and also manually change it.": "Hier können Sie sehen, welche Größe die Figur derzeit hat, und sie manuell ändern.",

  "Flashing star": "Blinkender Stern",
  "The star decreases slowly and increases slowly. And it does so constantly. Shall we program it?": "Der Stern verkleinert sich langsam und vergrößert sich langsam. Und das ständig. Wollen wir es programmieren?",
  "Starting size": "Startgröße",
  "Set the desired size at the beginning of the script.": "Legen Sie die gewünschte Größe zu Beginn des Skripts fest.",
  "Resize - increase": "Größe ändern - vergrößern",
  "Use this command to increase the size.": "Verwenden Sie diesen Befehl, um die Größe zu vergrößern.",
  "Resize - decrease": "Größe ändern - verkleinern",
  "You already know the command for how to resize a sprite. To reduce the size, just enter a number with a minus sign. For example, -5.": "Sie kennen bereits den Befehl zum Ändern der Größe einer Figur. Um die Größe zu reduzieren, geben Sie einfach eine Zahl mit einem Minuszeichen ein, z. B. -5.",
  "The star is steadily increasing and decreasing": "Der Stern vergrößert und verkleinert sich gleichmäßig",
  "Use two loops in a row.": "Verwenden Sie zwei Schleifen hintereinander.",
  "Before takeoff": "Vor dem Abheben",
  "Program the project from your workbook. You can use the ready-made plan, or you can use the one that you wrote yourself.": "Programmieren Sie das Projekt aus Ihrem Arbeitsbuch. Sie können den vorgefertigten Plan verwenden oder den, den Sie selbst geschrieben haben.",
  "Study the project plan in your workbook": "Studieren Sie den Projektplan in Ihrem Arbeitsbuch",
  "The sprites speak in turn. When they are silent and listening, the command \"Wait __ sec\" is used.": "Die Kobolde sprechen abwechselnd. Wenn sie schweigen und zuhören, wird der Befehl „Warte __ Sek.“ verwendet.",
  "Program Captain Kepler": "Programmieren Sie Captain Kepler",
  "Program the MarsBot": "Programmieren Sie den MarsBot",
  "Program the astro cadet": "Programmieren Sie den Astro-Kadetten",
  "Dinosaurs": "Dinosaurier",
  "The dinosaurs speak in turn, not at the same time! Put together a similar dialog in which one dinosaur responds to the other!": "Die Dinosaurier sprechen abwechselnd, nicht gleichzeitig! Stellen Sie einen ähnlichen Dialog zusammen, in dem ein Dinosaurier dem anderen antwortet!",
  "The dinosaurs take turns talking": "Die Dinosaurier sprechen abwechselnd",
  "The dinosaurs' lines do not appear at the same time — when one speaks, the other listens!": "Die Zeilen der Dinosaurier erscheinen nicht gleichzeitig – wenn einer spricht, hört der andere zu!",
  "Project plan": "Projektplan",
  "Near the castle": "In der Nähe des Schlosses",
  "Create a dialog from three phrases!": "Erstellen Sie einen Dialog aus drei Sätzen!",
  "The girls take turns talking": "Die Mädchen sprechen abwechselnd",
  "The girls don't interrupt each other!": "Die Mädchen unterbrechen sich nicht gegenseitig!",
  "About the planet": "Über den Planeten",
  "In this dialog, each astronaut replies twice!": "In diesem Dialog antwortet jeder Astronaut zweimal!",
  "The astronauts take turns talking": "Die Astronauten sprechen abwechselnd",
  "When one sprite speaks, the other listens and is silent.": "Wenn ein Kobold spricht, hört der andere zu und schweigt.",
  "Trying on a dress": "Ein Kleid anprobieren",
  "Look, the outfits change every two seconds and the Harper girl comments on each outfit!": "Schau, die Outfits wechseln alle zwei Sekunden und das Harper-Mädchen kommentiert jedes Outfit!",
  "The costumes change every two seconds": "Die Kostüme wechseln alle zwei Sekunden",
  "The girl comments on each outfit": "Das Mädchen kommentiert jedes Outfit",
  "Sorceress and broom": "Zauberin und Besen",
  "Another dialog, but now three characters are talking! Even the broom is talking!": "Noch ein Dialog, aber jetzt reden drei Charaktere! Sogar der Besen redet!",
  "The characters don't interrupt each other": "Die Charaktere unterbrechen sich nicht gegenseitig",
  "Each character talks for 2 seconds.": "Jeder Charakter redet 2 Sekunden.",
  "The rocket approaches and recedes": "Die Rakete nähert sich und entfernt sich",
  "Up arrow: the rocket is approaching. Down arrow: the rocket is receding.": "Pfeil nach oben: Die Rakete nähert sich. Pfeil nach unten: Die Rakete entfernt sich.",
  "Approaching": "Annäherung",
  "Pressing the up arrow changes the costume and increases the size.": "Durch Drücken des Pfeils nach oben wird das Kostüm geändert und die Größe vergrößert.",
  "Receding": "Entfernung",
  "Pressing the down arrow changes the costume and decreases the size. Think about how to do it.": "Durch Drücken des Pfeils nach unten wird das Kostüm geändert und die Größe verkleinert. Überlegen Sie, wie Sie das machen.",
  "Initial placement": "Anfangsplatzierung",
  "When you click on the green flag, the rocket is always the same size.": "Wenn Sie auf die grüne Flagge klicken, hat die Rakete immer die gleiche Größe.",
  "Stopping other scripts": "Andere Skripte stoppen",
  "If you first press the up arrow and move the rocket closer, and then click the down arrow, you must first stop the approaching, and then start the receding.": "Wenn Sie zuerst den Pfeil nach oben drücken und die Rakete näher heranbewegen und dann auf den Pfeil nach unten klicken, müssen Sie zuerst die Annäherung stoppen und dann die Entfernung starten.",
  "*Bonus task: the Earth approaching and receding": "*Bonusaufgabe: Die Erde nähert sich und entfernt sich",
  "When you press the up arrow, the Earth recedes, when you press the down arrow, it approaches.": "Wenn Sie den Pfeil nach oben drücken, entfernt sich die Erde, wenn Sie den Pfeil nach unten drücken, nähert sie sich.",
  "Hen": "Henne",
  "The hen walks, eats, or turns its head when the keys \"1\", \"2\", and \"3\" are pressed. These actions do not happen at the same time.": "Die Henne geht, isst oder dreht den Kopf, wenn die Tasten „1“, „2“ und „3“ gedrückt werden. Diese Aktionen finden nicht gleichzeitig statt.",
  "The hen walks when the \"1\" key is pressed": "Die Henne geht, wenn die Taste „1“ gedrückt wird.",
  "We need costumes to change for the hen to take steps. How many seconds do we need to use in the \"wait\" command for the actions to run smoothly? Use the \"forever\" command to keep the chicken going.": "Wir müssen uns umziehen, damit die Henne Schritte machen kann. Wie viele Sekunden müssen wir im „Warten“-Befehl verwenden, damit die Aktionen reibungslos ablaufen? Verwenden Sie den Befehl „für immer“, damit das Huhn weitermacht.",
  "The hen pecks the grains when the \"2\" key is pressed": "Die Henne pickt die Körner, wenn die Taste „2“ gedrückt wird.",
  "We need costumes to change for the hen to eat. Use the same number of seconds in the \"wait\" command for the actions to run smoothly. Use the \"forever\" command to keep the chicken pecking.": "Wir müssen uns umziehen, damit die Henne frisst. Verwenden Sie die gleiche Anzahl von Sekunden im „Warten“-Befehl, damit die Aktionen reibungslos ablaufen. Verwenden Sie den Befehl „für immer“, damit das Huhn weiterpickt.",
  "The hen looks when the \"3\" key is pressed": "Die Henne schaut, wenn die Taste „3“ gedrückt wird.",
  "We need costumes to change for the hen to turn its head. Here the “forever” command is also needed.": "Wir müssen uns umziehen, damit die Henne den Kopf dreht. Auch hier wird der Befehl „forever“ benötigt.",
  "At the start, the hen always returns to its original position.": "Zu Beginn kehrt das Huhn immer in seine Ausgangsposition zurück.",
  "When we start an action, we stop the others.": "Wenn wir eine Aktion starten, stoppen wir die anderen.",
  "Skeleton and ghost": "Skelett und Geist",
  "Fantasy characters are walking without our consent — let's stop them by pressing the space bar!": "Fantasy-Figuren laufen ohne unser Einverständnis – stoppen wir sie mit der Leertaste!",
  "The skeleton walks": "Das Skelett läuft",
  "When you click on the green flag, the skeleton is constantly walking. Please note that only three costumes are used for walking. Use the \"wait_sec\" command, so that the animation is visible.": "Wenn du auf die grüne Flagge klickst, läuft das Skelett ständig. Beachte, dass nur drei Kostüme zum Laufen verwendet werden. Verwende den Befehl „wait_sec“, damit die Animation sichtbar wird.",
  "The ghost": "Der Geist",
  "When you click on the green flag, the ghost changes costumes. Use the \"wait_sec\" command, so that the animation is visible.": "Wenn du auf die grüne Flagge klickst, wechselt der Geist das Kostüm. Verwende den Befehl „wait_sec“, damit die Animation sichtbar wird.",
  "Stop the whole project": "Das ganze Projekt stoppen",
  "All the scripts stop when you press the space bar. The Stop All command immediately stops all scripts for both the skeleton and the ghost.": "Alle Skripte werden gestoppt, wenn du die Leertaste drückst. Der Befehl „Alle stoppen“ stoppt sofort alle Skripte sowohl für das Skelett als auch für den Geist.",
  "Stars": "Sterne",
  "Wow! So many stars — and each one can twinkle and change costumes and size! Press the keys 1,2,3.": "Wow! So viele Sterne – und jeder einzelne kann funkeln und Kostüm und Größe ändern! Drücken Sie die Tasten 1,2,3.",
  "Press the keys 1,2,3.": "Drücke die Tasten 1,2,3.",
  "The star gradually gets bigger and smaller when the \"1\" key is pressed": "Der Stern wird allmählich größer und kleiner, wenn die Taste „1“ gedrückt wird",
  "Verwenden Sie zwei Schleifen hintereinander.": "Verwenden Sie zwei Schleifen hintereinander.",
  "The star twinkles when the \"2\" key is pressed": "Der Stern funkelt, wenn die Taste „2“ gedrückt wird",
  "The star appears, lingers for a while, disappears, and then it waits a little more before reappearing.": "Der Stern erscheint, verweilt eine Weile, verschwindet und wartet dann noch ein wenig, bevor er wieder erscheint.",
  "Remember to use the repeat forever command.": "Denken Sie daran, den Befehl „Endlos wiederholen“ zu verwenden.",
  "The star changes color when the \"3\" key is pressed": "Der Stern ändert seine Farbe, wenn die Taste „3“ gedrückt wird",
  "Constantly switching multicolored costumes.": "Ständig wechselnde mehrfarbige Kostüme.",
  "Three parameters change here. Think about which ones and set them for the initial placement.": "Hier ändern sich drei Parameter. Überlegen Sie, welche, und legen Sie diese für die anfängliche Platzierung fest.",
  "Duplicate the sprite": "Duplizieren Sie das Sprite",
  "Create 2 more stars. Right-click on it to duplicate it.": "Erstellen Sie 2 weitere Sterne. Klicken Sie mit der rechten Maustaste darauf, um es zu duplizieren.",
  "Personal website": "Persönliche Website",
  "Tell about your hobbies.": "Erzählen Sie von Ihren Hobbys.",
  "Add 2-3 sprites and a background": "Fügen Sie 2-3 Sprites und einen Hintergrund hinzu",
  "Add or draw 2-3 sprites that show your hobbies! Think about who will talk about them. Perhaps you will have a \"presenter\" or the items will tell about themselves.": "Fügen Sie 2-3 Sprites hinzu oder zeichnen Sie sie, die Ihre Hobbys zeigen! Überlegen Sie, wer darüber sprechen wird. Vielleicht haben Sie einen „Moderator“ oder die Elemente werden von sich selbst erzählen.",
  "Planning": "Planung",
  "What will your personal website be like? Did you come up with anything? Use the pages in your notebook to draw your plan!": "Wie wird Ihre persönliche Website aussehen? Haben Sie sich etwas ausgedacht? Verwenden Sie die Seiten in Ihrem Notizbuch, um Ihren Plan zu zeichnen!",
  "Use all the events": "Verwenden Sie alle Ereignisse:",
  "\"When the green flag is clicked,\" \"when the key is pressed,\" and \"when the sprite is clicked.\"": "„Wenn auf die grüne Flagge geklickt wird“, „Wenn die Taste gedrückt wird“ und „Wenn auf die Figur geklickt wird“.",
  "Create!": "Erstellen!",
  "The most important part is left — programming!": "Der wichtigste Teil bleibt noch – das Programmieren!",
  "Teleport": "Teleportieren",
  "Program the rocket to move between two points when you press the up arrow and down arrow keys!": "Programmieren Sie die Rakete so, dass sie sich zwischen zwei Punkten bewegt, wenn Sie die Pfeiltasten nach oben und unten drücken!",
  "Event 1": "Ereignis 1",
  "When you press the up arrow key, the rocket changes position.": "Wenn Sie die Pfeiltaste nach oben drücken, ändert die Rakete ihre Position.",
  "Motion 1": "Bewegung 1",
  "This command sets the position of the sprite on the stage using coordinates. 1. Place the sprite in a certain place, and the command \"Go to x: __ y: __\" will contain the coordinate values corresponding to that position. 2. Drag the \"Go to x: __ y: __\" block from the command palette.": "Dieser Befehl legt die Position des Sprites auf der Bühne mithilfe von Koordinaten fest. 1. Platzieren Sie das Sprite an einer bestimmten Stelle, und der Befehl „Gehe zu x:__y:__“ enthält die Koordinatenwerte, die dieser Position entsprechen. 2. Ziehen Sie den Block „Gehe zu x:__y:__“ aus der Befehlspalette.",  "Event 2": "Ereignis 2",
  "When you press the down arrow key, the rocket again changes position.": "Wenn Sie die Pfeiltaste nach unten drücken, ändert die Rakete erneut ihre Position.",
  "Motion 2": "Bewegung 2",
  "Move the sprite to a different position, and then new values will appear in the \"go to x: __ y: __\" command.": "Bewegen Sie das Sprite an eine andere Position, und dann erscheinen neue Werte im Befehl „Gehe zu x:__y:__“.",
  "Star": "Stern",
  "The star appears randomly in multiple places.": "Der Stern erscheint zufällig an mehreren Stellen.",
  "Motion": "Bewegung",
  "Move the star anywhere and use the command \"Go to X __ Y __\", and do it 4 times. Use different coordinates for the command \"Go to X __ Y __\"": "Bewegen Sie den Stern an eine beliebige Stelle, und verwenden Sie den Befehl „Gehe zu X__y__“, und wiederholen Sie dies 4 Mal. Verwende verschiedene Koordinaten für den Befehl „Gehe zu X __ Y __“",  "Delay": "Verzögerung",
  "Use the command \"wait __ sec\" between position changes, so that they become visible!": "Verwende den Befehl „warte __ Sek.“ zwischen Positionsänderungen, damit diese sichtbar werden!",
  "Moon": "Mond",
  "Did you notice that the moon moves across the sky? Let's program it!": "Ist dir aufgefallen, dass der Mond sich über den Himmel bewegt? Lass es uns programmieren!",
  "Change the position of the moon 3 times. You already know how to set a position. Do it yourself!": "Ändere die Position des Mondes 3 Mal. Du weißt bereits, wie man eine Position einstellt. Mach es selbst!",
  "Don't forget to use the command \"wait __ sec\" between movements.": "Vergiss nicht, den Befehl „warte __ Sek.“ zwischen den Bewegungen zu verwenden.",
  "Crab": "Krabbe",
  "This crab moves sideways! Look, only the X coordinate changes.": "Diese Krabbe bewegt sich seitwärts! Schau, nur die X-Koordinate ändert sich.",
  "The \"set x to __\" command": "Der Befehl „setze x auf __“",
  "We can only change one coordinate. The X coordinate changes the position of the sprite left-right. Change the position of the crab 5 times.": "Wir können nur eine Koordinate ändern. Die X-Koordinate ändert die Position des Sprites von links nach rechts. Ändere die Position des Krabbens 5 Mal.",
  "Use a delay.": "Verwende eine Verzögerung.",
  "Thermometer": "Thermometer",
  "Move the red marker up and down by changing the Y coordinate.": "Bewege den roten Marker nach oben und unten, indem du die Y-Koordinate änderst.",
  "Hot!": "Heiß!",
  "This command moves the sprites up and down by changing the Y coordinate. Set the red marker, so that the thermometer shows a high temperature.": "Dieser Befehl bewegt die Sprites nach oben und unten, indem er die Y-Koordinate ändert. Setze den roten Marker, damit das Thermometer eine hohe Temperatur anzeigt.",  "Let's have the thermometer report the temperature.": "Lassen wir das Thermometer die Temperatur melden.",
  "Let's have the thermometer report the temperature. Instead of the command to wait, use the command to say \"Hot!\"": "Lassen wir das Thermometer die Temperatur anzeigen. Anstelle des Befehls zum Warten verwenden wir den Befehl „Heiß!“",
  "Warm": "Warm",
  "Set the red marker, so that the thermometer reads a little over 20 degrees. Don't forget that our thermometer notifies about the temperature.": "Setzen Sie die rote Markierung so, dass das Thermometer etwas über 20 Grad anzeigt. Vergessen Sie nicht, dass unser Thermometer die Temperatur meldet.",
  "Cool": "Kühl",
  "Set the red marker, so that the thermometer reads just under 10 degrees. Don't forget that our thermometer notifies about the temperature, and at this temperature, it is \"Cool!\"": "Setzen Sie die rote Markierung so, dass das Thermometer knapp 10 Grad anzeigt. Vergessen Sie nicht, dass unser Thermometer die Temperatur meldet, und bei dieser Temperatur ist es „Kühl!“",
  "Cold": "Kalt",
  "Set the red marker, so that the thermometer reads about -10 degrees. Don't forget that our thermometer notifies about the temperature.": "Setzen Sie die rote Markierung so, dass das Thermometer etwa -10 Grad anzeigt. Vergessen Sie nicht, dass unser Thermometer die Temperatur meldet",
  "Freezing": "Gefrierend",
  "Set the red marker, so that the thermometer reads about -30 degrees. Don't forget that our thermometer notifies about the temperature.": "Setzen Sie die rote Markierung so, dass das Thermometer etwa -30 Grad anzeigt. Vergessen Sie nicht, dass unser Thermometer die Temperatur meldet",
  "Traffic light": "Ampel",
  "Cover the not-working colors with a gray circle and move it to the right place! Press the keys 1,2,3": "Decken Sie die nicht funktionierenden Farben mit einem grauen Kreis ab und verschieben Sie ihn an die richtige Stelle! Drücken Sie die Tasten 1,2,3",
  "Red light": "Rotes Licht",
  "When you press the number \"1,\" the red light is on. One gray circle should cover the green, and the other should cover the yellow.": "Wenn Sie die Zahl „1“ drücken, leuchtet das rote Licht. Ein grauer Kreis sollte das Grüne abdecken, und der andere das Gelbe.",
  "Yellow light": "Gelbes Licht",
  "When you press the number \"2,\" the yellow light is on. One gray circle should cover the green, and the other should cover the red.": "Wenn Sie die Zahl „2“ drücken, leuchtet das gelbe Licht. Ein grauer Kreis sollte das Grüne abdecken, und der andere das Rote.",
  "Green light": "Grünes Licht",
  "When you press the number \"3,\" the green light is on. One gray circle should cover the red, and the second one should cover the yellow.": "Wenn Sie die Zahl „3“ drücken, leuchtet das grüne Licht. Ein grauer Kreis sollte das Rote abdecken, und der zweite das Gelbe.",
  "Sun": "Sonne",
  "Watch how smoothly the sun moves across the sky!": "Beobachten Sie, wie sanft sich die Sonne über den Himmel bewegt!",
  "The sun glides to multiple points": "Die Sonne gleitet zu mehreren Punkten",
  "The sun changes costumes": "Die Sonne wechselt das Kostüm",
  "Anfangsplatzierung": "Anfangsplatzierung",
  "Cat": "Katze",
  "Program the cat so that it turns to each of the goodies one after another.": "Programmieren Sie die Katze so, dass sie sich nacheinander den Leckereien zuwendet.",
  "Turn up": "Nach oben drehen",
  "To make the cat turn towards the mouse, use the direction equal to 0.": "Damit sich die Katze zur Maus dreht, verwende die Richtung gleich 0.",
  "Turn right": "Nach rechts drehen",
  "To make the cat turn towards the milk, use the direction equal to 90.": "Damit sich die Katze zur Milch dreht, verwende die Richtung gleich 90.",
  "Turn down": "Nach unten drehen",
  "To make the cat turn towards the can of food, use the direction equal to 90.": "Damit sich die Katze zur Futterdose dreht, verwende die Richtung gleich 90.",
  "What does the cat say between direction changes?": "Was sagt die Katze zwischen den Richtungswechseln?",
  "Come up with it yourself!": "Denk es dir selbst aus!",
  "Sprite direction": "Sprite-Richtung",
  "The direction the sprite is facing can be seen in the sprite properties.": "Die Richtung, in die das Sprite blickt, ist in den Sprite-Eigenschaften zu sehen.",
  "Direction values": "Richtungswerte",
  "By clicking on the window with the direction, it can be forcibly changed without using commands.": "Durch Klicken auf das Fenster mit der Richtung kann diese zwangsweise geändert werden, ohne Befehle zu verwenden.",
  "Mouse": "Maus",
  "Program the mouse so that it runs around the stage but does not run off of it!": "Programmiere die Maus so, dass sie um die Bühne läuft, aber nicht von ihr wegläuft!",
  "Endless movement: the mouse tries to run away": "Endlose Bewegung: Die Maus versucht wegzulaufen",
  "The \"go __ steps\" command moves the sprite a few steps in the direction it is currently looking in. Now just make it so that it always repeats itself!": "Der Befehl „gehe __ Schritte“ bewegt das Sprite einige Schritte in die Richtung, in die es gerade blickt. Jetzt mach es einfach so, dass es sich immer wiederholt!",
  "The mouse does not run away": "Die Maus läuft nicht weg",
  "The command \"if on edge, bounce\" does not allow the mouse to go off the stage.": "Der Befehl „wenn auf der Kante, hüpfe“ lässt die Maus nicht von der Bühne weglaufen.",
  "Set the position that the mouse occupies at the start, as well as the direction it is pointed in at the beginning!": "Legen Sie die Position fest, die die Maus zu Beginn einnimmt, sowie die Richtung, in die sie zu Beginn zeigt!",
  "MarsBot on Mars": "MarsBot auf dem Mars",
  "Program the MarsBot to walk left and right and not bump into mountains!": "Programmieren Sie den MarsBot so, dass er nach links und rechts geht und nicht gegen Berge stößt!",
  "Initial placement of the MarsBot": "Anfangsplatzierung des MarsBots",
  "Don't forget about placement: you need to set the position of the MarsBot and the direction it is looking in.": "Vergessen Sie die Platzierung nicht: Sie müssen die Position des MarsBots und die Richtung festlegen, in die er blickt.",
  "The MarsBot goes from one mountain to another": "Der MarsBot geht von einem Berg zum anderen",
  "Use motion, wait, and loop commands to program the movement of the sprite.": "Verwenden Sie die Befehle „Bewegung“, „Warte“ und „Schleife“, um die Bewegung des Sprites zu programmieren.",
  "The MarsBot turns around": "Der MarsBot dreht sich um",
  "But how to turn around without pushing off of the edge? Use the already familiar \"point in direction __\" command. And don't forget about rotation style!": "Aber wie dreht man sich um, ohne sich von der Kante abzustoßen? Verwenden Sie den bereits bekannten Befehl „In Richtung __ zeigen“. Und vergessen Sie den Rotationsstil nicht!",
  "The MarsBot returns to the starting point": "Der MarsBot kehrt zum Ausgangspunkt zurück",
  "Penguin": "Pinguin",
  "Program the Penguin's walk!": "Programmieren Sie den Gang des Pinguins!",
  "Initial placement of the penguin": "Anfangsplatzierung des Pinguins",
  "Set the initial placement of the penguin so that the project always starts the same way.": "Legen Sie die Anfangsplatzierung des Pinguins fest, damit das Projekt immer auf die gleiche Weise beginnt.",
  "The penguin walks": "Der Pinguin geht",
  "Use motion, wait, and loop commands to program the sprite to walk!": "Verwenden Sie die Befehle „Bewegung“, „Warte“ und „Schleife“, um das Gehen des Sprites zu programmieren!",
  "The penguin turns": "Der Pinguin dreht sich",
  "How to turn around without pushing off of the edge? Use the already familiar \"point in direction __\" command. And don't forget about rotation style!": "Wie kann man sich umdrehen, ohne sich von der Kante abzustoßen? Verwenden Sie den bereits bekannten Befehl „in Richtung __ zeigen“. Und vergessen Sie den Rotationsstil nicht!",
  "The penguin change costumes": "Der Pinguin wechselt das Kostüm",
  "Make the penguin change costumes while walking.": "Lassen Sie den Pinguin beim Gehen das Kostüm wechseln.",
  "Bug": "Käfer",
  "The bug should reach the ladybug by moving along the branches of the tree!": "Der Käfer sollte den Marienkäfer erreichen, indem er sich entlang der Äste des Baumes bewegt!",
  "Initial placement of the bug": "Erste Platzierung des Käfers",
  "The initial placement is already complete, but you can add size settings, a phrase, or whatever you like!": "Die erste Platzierung ist bereits abgeschlossen, aber Sie können Größeneinstellungen, einen Satz oder was auch immer Sie möchten hinzufügen!",
  "The bug moves": "Der Käfer bewegt sich",
  "The bug turns in a certain direction, takes a few steps, and then turns again, and takes a few more steps. Experiment and guide the bug to the ladybug!": "Der Käfer dreht sich in eine bestimmte Richtung, macht ein paar Schritte, dreht sich dann wieder um und macht noch ein paar Schritte. Experimentieren Sie und führen Sie den Käfer zum Marienkäfer!",
  "Mouse in the maze": "Maus im Labyrinth",
  "The mouse has to get to the red button in the maze.": "Die Maus muss zum roten Knopf im Labyrinth gelangen.",
  "Do the initial placement. Some of the commands are already there!": "Führen Sie die erste Platzierung durch. Einige der Befehle sind bereits vorhanden!",
  "Mouse sprite movement starts": "Die Bewegung des Maus-Sprites beginnt",
  "Make it so that clicking the green flag triggers mouse movement.": "Machen Sie es so, dass das Klicken auf die grüne Flagge die Mausbewegung auslöst.",
  "The mouse runs to the red button": "Die Maus läuft zum roten Knopf",
  "Use this construction to bypass the walls of the labyrinth.": "Verwenden Sie diese Konstruktion, um die Wände des Labyrinths zu umgehen."
}

