{
  "Hey! Let's get acquainted with Scratch": "Hey! Machen wir uns mit Scratch vertraut",
  "Here are the tasks that need to be completed. To hide this window, click on the purple line to the left of the text.\nTo reopen the tasks, click on the purple line in the upper right corner.\n\nYou can find information about useful buttons in Scratch in the task list below.\nLet's open the first one!": "Hier sind die Aufgaben, die erledigt werden müssen. Um dieses Fenster auszublenden, klicken Sie auf die violette Linie links neben dem Text.\nUm die Aufgaben erneut zu öffnen, klicken Sie auf die violette Linie in der oberen rechten Ecke.\n\nInformationen zu nützlichen Schaltflächen in Scratch finden Sie in der Aufgabenliste unten.\nÖffnen wir die erste!",
  "Add a background": "Hintergrund hinzufügen",
  "Add a background to your project. Click on the animation above to see how.\nWhen the background is ready, mark the task completed by checking the box and move on to the next task!": "Fügen Sie Ihrem Projekt einen Hintergrund hinzu. Klicken Sie auf die Animation oben, um zu sehen, wie das geht.\nWenn der Hintergrund fertig ist, markieren Sie die Aufgabe als erledigt, indem Sie das Kontrollkästchen aktivieren, und fahren Sie mit der nächsten Aufgabe fort!",
  "Add sprites": "Sprites hinzufügen",
  "A sprite is a character that we program in Scratch. Add a sprite, size it, and move it to the desired location.": "Ein Sprite ist eine Figur, die wir in Scratch programmieren. Fügen Sie ein Sprite hinzu, passen Sie seine Größe an und verschieben Sie es an die gewünschte Stelle.",
  "Delete the extra sprite": "Löschen Sie das zusätzliche Sprite",
  "Click on the x to delete the sprite. If you delete a sprite by accident, click \"Edit\" -> \"Restore Sprite.\"": "Klicken Sie auf das x, um das Sprite zu löschen. Wenn Sie ein Sprite versehentlich löschen, klicken Sie auf \"Bearbeiten\" -> \"Sprite wiederherstellen.\"",
  "Save the project": "Speichern Sie das Projekt",
  "Click the \"Save\" button to save all the latest changes to the project!": "Klicken Sie auf die \"Speichern\"-Schaltfläche, um alle letzten Änderungen am Projekt zu speichern!",
  "Choose and add a suitable background for these characters! Click on the animation and see how to add a background.": "Wählen Sie einen passenden Hintergrund für diese Figuren aus und fügen Sie ihn hinzu! Klicken Sie auf die Animation und sehen Sie, wie Sie einen Hintergrund hinzufügen.",
  "Add a suitable background": "Fügen Sie einen passenden Hintergrund hinzu",
  "Save the project and go to the next level": "Speichern Sie das Projekt und gehen Sie zum nächsten Level",
  "Add suitable sprites": "Fügen Sie passende Sprites hinzu",
  "What sprites would look good against this background?": "Welche Sprites würden vor diesem Hintergrund gut aussehen?",
  "Move the sprites to suitable places using the mouse": "Verschieben Sie die Sprites mit der Maus an die passenden Stellen",
  "To delete a sprite, click on the x next to it.": "Um ein Sprite zu löschen, klicken Sie auf das x daneben.",
  "Choose a suitable background": "Wählen Sie einen passenden Hintergrund",
  "Please note: there are already a few ready-made backgrounds in the project. You just need to choose the right one.": "Bitte beachten Sie: Es gibt bereits einige vorgefertigte Hintergründe im Projekt. Sie müssen nur den richtigen auswählen.",
  "Choose a background from those that are available in the project": "Wählen Sie einen Hintergrund aus denen aus, die im Projekt verfügbar sind",
  "Choose the costume you want": "Wählen Sie das gewünschte Kostüm aus",
  "Let the dog look at you. Can you find the right costume?": "Lassen Sie sich vom Hund ansehen. Können Sie das richtige Kostüm finden?",
  "Ask a question": "Stellen Sie eine Frage",
  "If you can't solve a task, write to the teacher in the special chat — Marsgram!": "Wenn Sie eine Aufgabe nicht lösen können, schreiben Sie dem Lehrer im speziellen Chat – Marsgram!",
  "Add a phrase": "Fügen Sie einen Satz hinzu",
  "What will your snowman say?": "Was wird Ihr Schneemann sagen?",
  "The start of the script": "Der Beginn des Skripts",
  "The script starts with the command \"When the green flag is clicked.\"": "Das Skript beginnt mit dem Befehl \"Wenn auf die grüne Flagge geklickt wird.\"",
  "Finish the Mars project": "Das Mars-Projekt beenden",
  "Look, the programmer hasn't completed this project! Finish it.": "Schauen Sie, der Programmierer hat dieses Projekt nicht abgeschlossen! Beenden Sie es.",
  "Change the background from Earth to Mars": "Ändern Sie den Hintergrund von der Erde zum Mars",
  "Use the command \"speak...\"": "Verwenden Sie den Befehl \"sprechen...\"",
  "Choose and add a suitable background for these characters!": "Wählen und fügen Sie einen passenden Hintergrund für diese Charaktere hinzu!",
  "Finish the project at your own discretion": "Beenden Sie das Projekt nach eigenem Ermessen",
  "See how the project should work": "Sehen Sie, wie das Projekt funktionieren soll",
  "Add a command to start the project": "Fügen Sie einen Befehl hinzu, um das Projekt zu starten",
  "The project should be run by clicking on the green flag.": "Das Projekt sollte durch Klicken auf die grüne Flagge gestartet werden.",
  "Add a command for the bear to speak.": "Fügen Sie einen Befehl hinzu, damit der Bär spricht.",
  "The bear should say \"Hello!\" within 3 seconds.": "Der Bär sollte innerhalb von 3 Sekunden \"Hallo!\" sagen.",
  
  "Dinosaur and snake": "Dinosaurier und Schlange",
  "The snake first wriggles, then sees the dinosaur, is surprised, and then straightens its body. How do we program this?": "Die Schlange windet sich zunächst, sieht dann den Dinosaurier, ist überrascht und richtet dann ihren Körper auf. Wie programmieren wir das?",
  "Start of the script": "Start des Skripts",
  "The \"When the green flag is pressed\" command starts the script.": "Der Befehl \"Wenn die grüne Flagge angeklickt wird\" startet das Skript.",
  "Setting the costume": "Einstellen des Kostüms",
  "This command will help you to set a specific costume. We have two different costumes set.": "Dieser Befehl hilft Ihnen, ein bestimmtes Kostüm festzulegen. Wir haben zwei verschiedene Kostüme eingestellt.",
  "Expectation": "Erwartung",
  "The snake sees the dinosaur in a second instead of immediately. To prevent it from changing its costume ahead of time, we use the \"wait __ sec\" command": "Die Schlange sieht den Dinosaurier erst nach einer Sekunde statt sofort. Um zu verhindern, dass sie ihr Kostüm zu früh wechselt, verwenden wir den Befehl \"warte __ Sek\".",

  "The \"Heart\" project": "Das \"Herz\"-Projekt",
  "Take a look at the example. The heart changes costume 4 times. Each costume is visible for 1 second. Can you do the same?": "Schauen Sie sich das Beispiel an. Das Herz wechselt viermal das Kostüm. Jedes Kostüm ist für 1 Sekunde sichtbar. Können Sie das auch?",
  "Costume change": "Kostümwechsel",
  "The \"Next Costume\" command changes the costume that is set next in the list of costumes.": "Der Befehl \"Nächstes Kostüm\" ändert das nächste Kostüm in der Liste.",
  "Repeating actions": "Wiederholende Aktionen",
  "For the sprite to perform an action multiple times, you need to use the \"Repeat __ times\" command. In the window, you can set the number of repetitions.": "Damit die Figur eine Aktion mehrmals ausführt, müssen Sie den Befehl \"Wiederhole __ mal\" verwenden. Im Fenster können Sie die Anzahl der Wiederholungen festlegen.",
  "Oops! If we use the \"Next costume\" command multiple times in a row, the costumes will change too quickly and we will not see how they change: it will be like nothing is happening. To prevent commands from being executed almost simultaneously, we insert a \"pause.\" To do this, we need the \"Wait __ sec\" command.": "Ups! Wenn wir den Befehl \"Nächstes Kostüm\" mehrmals hintereinander verwenden, wechseln die Kostüme zu schnell, und wir sehen nicht, wie sie sich ändern – es sieht aus, als würde nichts passieren. Damit die Befehle nicht gleichzeitig ausgeführt werden, fügen wir eine \"Pause\" ein. Dafür brauchen wir den Befehl \"Warte __ Sek\".",

  "The bear walks": "Der Bär läuft",
  "Program a costume change so that it seems like the bear is constantly walking! See the example.": "Programmieren Sie einen Kostümwechsel, sodass es so aussieht, als würde der Bär ständig laufen! Sehen Sie sich das Beispiel an.",
  "Constant repetition": "Ständige Wiederholung",
  "To make an action repeat itself constantly, use the \"Repeat Always\" command.": "Damit eine Aktion ständig wiederholt wird, verwenden Sie den Befehl \"Wiederhole immer\".",
  "Smooth movements": "Sanfte Bewegungen",
  "You can make the movements smoother by setting a wait before each costume change. We can set the wait time. Try setting it for 0.1 seconds! This command is already ready — just put it in the right place.": "Sie können die Bewegungen sanfter gestalten, indem Sie eine Wartezeit vor jedem Kostümwechsel einfügen. Sie können die Wartezeit festlegen. Versuchen Sie, sie auf 0,1 Sekunden zu setzen! Dieser Befehl ist bereits fertig – setzen Sie ihn einfach an die richtige Stelle.",
  "Remember where the script starts?": "Erinnern Sie sich, wo das Skript beginnt?",
  
  "Create a clock!": "Erstellen Sie eine Uhr!",
  "Look, all the backgrounds you need are already there, you just need to change them every second.": "Schauen Sie, alle benötigten Hintergründe sind bereits da, Sie müssen sie nur jede Sekunde ändern.",
  "Set the first background": "Setzen Sie den ersten Hintergrund",
  "Let the clock hands start moving from 12.": "Lassen Sie die Zeiger der Uhr bei 12 starten.",
  "Change the background": "Hintergrund ändern",
  "Change the background using the \"Next Background\" command. Program the background to change every second.": "Ändern Sie den Hintergrund mit dem Befehl \"Nächster Hintergrund\". Programmieren Sie den Hintergrund so, dass er sich jede Sekunde ändert.",
  "Program the background change to repeat": "Programmieren Sie die Wiederholung des Hintergrundwechsels",
  "If you accidentally delete the script": "Wenn Sie das Skript versehentlich löschen",
  "Simultaneously press the \"CTRL\" and \"Z\" keys in the lower-left corner of the keyboard.": "Drücken Sie gleichzeitig die Tasten \"STRG\" und \"Z\" in der unteren linken Ecke der Tastatur.",

  "Super cat": "Super-Katze",
  "The super cat grows in size. Program the same!": "Die Super-Katze wächst. Programmieren Sie dasselbe!",
  "Smoothly resize the sprite using a loop": "Ändern Sie die Größe der Figur sanft mit einer Schleife.",
  "Use a loop to resize smoothly.": "Verwenden Sie eine Schleife, um die Größe sanft zu ändern.",
  "Set the size": "Größe festlegen",
  "Set the size you want at the beginning of the script.": "Legen Sie die gewünschte Größe zu Beginn des Skripts fest.",
  "Cat talks": "Die Katze spricht",
  "The cat should say \"I am super cat!\" before growing.": "Die Katze sollte \"Ich bin Super-Katze!\" sagen, bevor sie wächst.",
  "Sprite size": "Figurengröße",
  "Here you can find out what size the sprite is now and also manually change it.": "Hier können Sie sehen, welche Größe die Figur derzeit hat, und sie manuell ändern.",

  "Flashing star": "Blinkender Stern",
  "The star decreases slowly and increases slowly. And it does so constantly. Shall we program it?": "Der Stern verkleinert sich langsam und vergrößert sich langsam. Und das ständig. Wollen wir es programmieren?",
  "Starting size": "Startgröße",
  "Set the desired size at the beginning of the script.": "Legen Sie die gewünschte Größe zu Beginn des Skripts fest.",
  "Resize - increase": "Größe ändern - vergrößern",
  "Use this command to increase the size.": "Verwenden Sie diesen Befehl, um die Größe zu vergrößern.",
  "Resize - decrease": "Größe ändern - verkleinern",
  "You already know the command for how to resize a sprite. To reduce the size, just enter a number with a minus sign. For example, -5.": "Sie kennen bereits den Befehl zum Ändern der Größe einer Figur. Um die Größe zu reduzieren, geben Sie einfach eine Zahl mit einem Minuszeichen ein, z. B. -5.",
  "The star is steadily increasing and decreasing": "Der Stern vergrößert und verkleinert sich gleichmäßig",
  "Use two loops in a row.": "Verwenden Sie zwei Schleifen hintereinander.",
  "Before takeoff": "Vor dem Abheben",
  "Program the project from your workbook. You can use the ready-made plan, or you can use the one that you wrote yourself.": "Programmieren Sie das Projekt aus Ihrem Arbeitsbuch. Sie können den vorgefertigten Plan verwenden oder den, den Sie selbst geschrieben haben.",
  "Study the project plan in your workbook": "Studieren Sie den Projektplan in Ihrem Arbeitsbuch",
  "The sprites speak in turn. When they are silent and listening, the command \"Wait __ sec\" is used.": "Die Kobolde sprechen abwechselnd. Wenn sie schweigen und zuhören, wird der Befehl „Warte __ Sek.“ verwendet.",
  "Program Captain Kepler": "Programmieren Sie Captain Kepler",
  "Program the MarsBot": "Programmieren Sie den MarsBot",
  "Program the astro cadet": "Programmieren Sie den Astro-Kadetten",
  "Dinosaurs": "Dinosaurier",
  "The dinosaurs speak in turn, not at the same time! Put together a similar dialog in which one dinosaur responds to the other!": "Die Dinosaurier sprechen abwechselnd, nicht gleichzeitig! Stellen Sie einen ähnlichen Dialog zusammen, in dem ein Dinosaurier dem anderen antwortet!",
  "The dinosaurs take turns talking": "Die Dinosaurier sprechen abwechselnd",
  "The dinosaurs' lines do not appear at the same time — when one speaks, the other listens!": "Die Zeilen der Dinosaurier erscheinen nicht gleichzeitig – wenn einer spricht, hört der andere zu!",
  "Project plan": "Projektplan",
  "Near the castle": "In der Nähe des Schlosses",
  "Create a dialog from three phrases!": "Erstellen Sie einen Dialog aus drei Sätzen!",
  "The girls take turns talking": "Die Mädchen sprechen abwechselnd",
  "The girls don't interrupt each other!": "Die Mädchen unterbrechen sich nicht gegenseitig!",
  "About the planet": "Über den Planeten",
  "In this dialog, each astronaut replies twice!": "In diesem Dialog antwortet jeder Astronaut zweimal!",
  "The astronauts take turns talking": "Die Astronauten sprechen abwechselnd",
  "When one sprite speaks, the other listens and is silent.": "Wenn ein Kobold spricht, hört der andere zu und schweigt.",
  "Trying on a dress": "Ein Kleid anprobieren",
  "Look, the outfits change every two seconds and the Harper girl comments on each outfit!": "Schau, die Outfits wechseln alle zwei Sekunden und das Harper-Mädchen kommentiert jedes Outfit!",
  "The costumes change every two seconds": "Die Kostüme wechseln alle zwei Sekunden",
  "The girl comments on each outfit": "Das Mädchen kommentiert jedes Outfit",
  "Sorceress and broom": "Zauberin und Besen",
  "Another dialog, but now three characters are talking! Even the broom is talking!": "Noch ein Dialog, aber jetzt reden drei Charaktere! Sogar der Besen redet!",
  "The characters don't interrupt each other": "Die Charaktere unterbrechen sich nicht gegenseitig",
  "Each character talks for 2 seconds.": "Jeder Charakter redet 2 Sekunden.",
  "The rocket approaches and recedes": "Die Rakete nähert sich und entfernt sich",
  "Up arrow: the rocket is approaching. Down arrow: the rocket is receding.": "Pfeil nach oben: Die Rakete nähert sich. Pfeil nach unten: Die Rakete entfernt sich.",
  "Approaching": "Annäherung",
  "Pressing the up arrow changes the costume and increases the size.": "Durch Drücken des Pfeils nach oben wird das Kostüm geändert und die Größe vergrößert.",
  "Receding": "Entfernung",
  "Pressing the down arrow changes the costume and decreases the size. Think about how to do it.": "Durch Drücken des Pfeils nach unten wird das Kostüm geändert und die Größe verkleinert. Überlegen Sie, wie Sie das machen.",
  "Initial placement": "Anfangsplatzierung",
  "When you click on the green flag, the rocket is always the same size.": "Wenn Sie auf die grüne Flagge klicken, hat die Rakete immer die gleiche Größe.",
  "Stopping other scripts": "Andere Skripte stoppen",
  "If you first press the up arrow and move the rocket closer, and then click the down arrow, you must first stop the approaching, and then start the receding.": "Wenn Sie zuerst den Pfeil nach oben drücken und die Rakete näher heranbewegen und dann auf den Pfeil nach unten klicken, müssen Sie zuerst die Annäherung stoppen und dann die Entfernung starten.",
  "*Bonus task: the Earth approaching and receding": "*Bonusaufgabe: Die Erde nähert sich und entfernt sich",
  "When you press the up arrow, the Earth recedes, when you press the down arrow, it approaches.": "Wenn Sie den Pfeil nach oben drücken, entfernt sich die Erde, wenn Sie den Pfeil nach unten drücken, nähert sie sich.",
  "Hen": "Henne",
  "The hen walks, eats, or turns its head when the keys \"1\", \"2\", and \"3\" are pressed. These actions do not happen at the same time.": "Die Henne geht, isst oder dreht den Kopf, wenn die Tasten „1“, „2“ und „3“ gedrückt werden. Diese Aktionen finden nicht gleichzeitig statt.",
  "The hen walks when the \"1\" key is pressed": "Die Henne geht, wenn die Taste „1“ gedrückt wird.",
  "We need costumes to change for the hen to take steps. How many seconds do we need to use in the \"wait\" command for the actions to run smoothly? Use the \"forever\" command to keep the chicken going.": "Wir müssen uns umziehen, damit die Henne Schritte machen kann. Wie viele Sekunden müssen wir im „Warten“-Befehl verwenden, damit die Aktionen reibungslos ablaufen? Verwenden Sie den Befehl „für immer“, damit das Huhn weitermacht.",
  "The hen pecks the grains when the \"2\" key is pressed": "Die Henne pickt die Körner, wenn die Taste „2“ gedrückt wird.",
  "We need costumes to change for the hen to eat. Use the same number of seconds in the \"wait\" command for the actions to run smoothly. Use the \"forever\" command to keep the chicken pecking.": "Wir müssen uns umziehen, damit die Henne frisst. Verwenden Sie die gleiche Anzahl von Sekunden im „Warten“-Befehl, damit die Aktionen reibungslos ablaufen. Verwenden Sie den Befehl „für immer“, damit das Huhn weiterpickt.",
  "The hen looks when the \"3\" key is pressed": "Die Henne schaut, wenn die Taste „3“ gedrückt wird.",
  "We need costumes to change for the hen to turn its head. Here the “forever” command is also needed.": "Wir müssen uns umziehen, damit die Henne den Kopf dreht. Auch hier wird der Befehl „forever“ benötigt.",
  "At the start, the hen always returns to its original position.": "Zu Beginn kehrt das Huhn immer in seine Ausgangsposition zurück.",
  "When we start an action, we stop the others.": "Wenn wir eine Aktion starten, stoppen wir die anderen.",
  "Skeleton and ghost": "Skelett und Geist",
  "Fantasy characters are walking without our consent — let's stop them by pressing the space bar!": "Fantasy-Figuren laufen ohne unser Einverständnis – stoppen wir sie mit der Leertaste!",
  "The skeleton walks": "Das Skelett läuft",
  "When you click on the green flag, the skeleton is constantly walking. Please note that only three costumes are used for walking. Use the \"wait_sec\" command, so that the animation is visible.": "Wenn du auf die grüne Flagge klickst, läuft das Skelett ständig. Beachte, dass nur drei Kostüme zum Laufen verwendet werden. Verwende den Befehl „wait_sec“, damit die Animation sichtbar wird.",
  "The ghost": "Der Geist",
  "When you click on the green flag, the ghost changes costumes. Use the \"wait_sec\" command, so that the animation is visible.": "Wenn du auf die grüne Flagge klickst, wechselt der Geist das Kostüm. Verwende den Befehl „wait_sec“, damit die Animation sichtbar wird.",
  "Stop the whole project": "Das ganze Projekt stoppen",
  "All the scripts stop when you press the space bar. The Stop All command immediately stops all scripts for both the skeleton and the ghost.": "Alle Skripte werden gestoppt, wenn du die Leertaste drückst. Der Befehl „Alle stoppen“ stoppt sofort alle Skripte sowohl für das Skelett als auch für den Geist.",  "Stars": "Sterne",
  "Wow! So many stars — and each one can twinkle and change costumes and size!": "Wow! So viele Sterne – und jeder einzelne kann funkeln und Kostüm und Größe ändern!",
  "Press the keys 1,2,3.": "Drücke die Tasten 1,2,3.",
  "The star gradually gets bigger and smaller when the \"1\" key is pressed": "Der Stern wird allmählich größer und kleiner, wenn die Taste „1“ gedrückt wird",
  "Verwenden Sie zwei Schleifen hintereinander.": "Verwenden Sie zwei Schleifen hintereinander.",
  "The star twinkles when the \"2\" key is pressed": "Der Stern funkelt, wenn die Taste „2“ gedrückt wird",
  "The star appears, lingers for a while, disappears, and then it waits a little more before reappearing.": "Der Stern erscheint, verweilt eine Weile, verschwindet und wartet dann noch ein wenig, bevor er wieder erscheint.",
  "Remember to use the repeat forever command.": "Denken Sie daran, den Befehl „Endlos wiederholen“ zu verwenden.",
  "The star changes color when the \"3\" key is pressed": "Der Stern ändert seine Farbe, wenn die Taste „3“ gedrückt wird",
  "Constantly switching multicolored costumes.": "Ständig wechselnde mehrfarbige Kostüme.",
  "Three parameters change here. Think about which ones and set them for the initial placement.": "Hier ändern sich drei Parameter. Überlegen Sie, welche, und legen Sie diese für die anfängliche Platzierung fest.",
  "Duplicate the sprite": "Duplizieren Sie das Sprite",
  "Create 2 more stars.": "Erstellen Sie 2 weitere Sterne.",
  "Right-click on it to duplicate it.": "Klicken Sie mit der rechten Maustaste darauf, um es zu duplizieren.",
  "Personal website": "Persönliche Website",
  "Tell about your hobbies.": "Erzählen Sie von Ihren Hobbys.",
  "Add 2-3 sprites and a background": "Fügen Sie 2-3 Sprites und einen Hintergrund hinzu",
  "Add or draw 2-3 sprites that show your hobbies! Think about who will talk about them. Perhaps you will have a \"presenter\" or the items will tell about themselves.": "Fügen Sie 2-3 Sprites hinzu oder zeichnen Sie sie, die Ihre Hobbys zeigen! Überlegen Sie, wer darüber sprechen wird. Vielleicht haben Sie einen „Moderator“ oder die Elemente werden von sich selbst erzählen.",
  "Planning": "Planung",
  "What will your personal website be like? Did you come up with anything? Use the pages in your notebook to draw your plan!": "Wie wird Ihre persönliche Website aussehen? Haben Sie sich etwas ausgedacht? Verwenden Sie die Seiten in Ihrem Notizbuch, um Ihren Plan zu zeichnen!",
  "Use all the events": "Verwenden Sie alle Ereignisse:",
  "\"When the green flag is clicked,\" \"when the key is pressed,\" and \"when the sprite is clicked.\"": "„Wenn auf die grüne Flagge geklickt wird“, „Wenn die Taste gedrückt wird“ und „Wenn auf die Figur geklickt wird“.",
  "Create!": "Erstellen!",
  "The most important part is left — programming!": "Der wichtigste Teil bleibt noch – das Programmieren!",
  "Teleport": "Teleportieren",
  "Program the rocket to move between two points when you press the up arrow and down arrow keys!": "Programmieren Sie die Rakete so, dass sie sich zwischen zwei Punkten bewegt, wenn Sie die Pfeiltasten nach oben und unten drücken!",
  "Event 1": "Ereignis 1",
  "When you press the up arrow key, the rocket changes position.": "Wenn Sie die Pfeiltaste nach oben drücken, ändert die Rakete ihre Position.",
  "Motion 1": "Bewegung 1",
  "This command sets the position of the sprite on the stage using coordinates.1.Place the sprite in a certain place, and the command \"Go to x: __ y: __\" will contain the coordinate values corresponding to that position.2.Drag the \"Go to x: __ y: __\" block from the command palette.": "Dieser Befehl legt die Position des Sprites auf der Bühne mithilfe von Koordinaten fest.",
  "1. Place the sprite in a certain place, and the command \"Go to x: __ y: __\" will contain the coordinate values corresponding to that position.": "1. Platzieren Sie das Sprite an einer bestimmten Stelle, und der Befehl „Gehe zu x:__y:__“ enthält die Koordinatenwerte, die dieser Position entsprechen.",
  "2. Drag the \"Go to x: __ y: __\" block from the command palette.": "2. Ziehen Sie den Block „Gehe zu x:__y:__“ aus der Befehlspalette.",
  "Event 2": "Ereignis 2",
  "When you press the down arrow key, the rocket again changes position.": "Wenn Sie die Pfeiltaste nach unten drücken, ändert die Rakete erneut ihre Position.",
  "Motion 2": "Bewegung 2",
  "Move the sprite to a different position, and then new values will appear in the \"go to x: __ y: __\" command.": "Bewegen Sie das Sprite an eine andere Position, und dann erscheinen neue Werte im Befehl „Gehe zu x:__y:__“.",
  "Star": "Stern",
  "The star appears randomly in multiple places.": "Der Stern erscheint zufällig an mehreren Stellen.",
  "Motion": "Bewegung",
  "Move the star anywhere and use the command \"Go to X __ Y __\", and do it 4 times.": "Bewegen Sie den Stern an eine beliebige Stelle, und verwenden Sie den Befehl „Gehe zu X__y__“, und wiederholen Sie dies 4 Mal.",
  "Use different coordinates for the command \"Go to X __ Y __\"": "Verwende verschiedene Koordinaten für den Befehl „Gehe zu X __ Y __“",
  "Delay": "Verzögerung",
  "Use the command \"wait __ sec\" between position changes, so that they become visible!": "Verwende den Befehl „warte __ Sek.“ zwischen Positionsänderungen, damit diese sichtbar werden!",
  "Moon": "Mond",
  "Did you notice that the moon moves across the sky? Let's program it!": "Ist dir aufgefallen, dass der Mond sich über den Himmel bewegt? Lass es uns programmieren!",
  "Change the position of the moon 3 times.": "Ändere die Position des Mondes 3 Mal.",
  "You already know how to set a position. Do it yourself!": "Du weißt bereits, wie man eine Position einstellt. Mach es selbst!",
  "Don't forget to use the command \"wait __ sec\" between movements.": "Vergiss nicht, den Befehl „warte __ Sek.“ zwischen den Bewegungen zu verwenden.",
  "Crab": "Krabbe",
  "This crab moves sideways! Look, only the X coordinate changes.": "Diese Krabbe bewegt sich seitwärts! Schau, nur die X-Koordinate ändert sich.",
  "The \"set x to __\" command": "Der Befehl „setze x auf __“",
  "We can only change one coordinate.": "Wir können nur eine Koordinate ändern.",
  "The X coordinate changes the position of the sprite left-right. Change the position of the crab 5 times.": "Die X-Koordinate ändert die Position des Sprites von links nach rechts. Ändere die Position des Krabbens 5 Mal.",
  "Use a delay.": "Verwende eine Verzögerung.",
  "Thermometer": "Thermometer",
  "Move the red marker up and down by changing the Y coordinate.": "Bewege den roten Marker nach oben und unten, indem du die Y-Koordinate änderst.",
  "Hot!": "Heiß!",
  "This command moves the sprites up and down by changing the Y coordinate.": "Dieser Befehl bewegt die Sprites nach oben und unten, indem er die Y-Koordinate ändert.",
  "Set the red marker, so that the thermometer shows a high temperature.": "Setze den roten Marker, damit das Thermometer eine hohe Temperatur anzeigt.",
  "Let's have the thermometer report the temperature.": "Lassen wir das Thermometer die Temperatur melden.",
  "Instead of the command to wait, use the command to say \"Hot!\"": "Anstelle des Befehls zum Warten verwenden wir den Befehl „Heiß!“",
  "Warm": "Warm",
  "Set the red marker, so that the thermometer reads a little over 20 degrees.": "Setzen Sie die rote Markierung so, dass das Thermometer etwas über 20 Grad anzeigt.",
  "Don't forget that our thermometer notifies about the temperature.": "Vergessen Sie nicht, dass unser Thermometer die Temperatur meldet.",
  "Cool": "Kühl",
  "Set the red marker, so that the thermometer reads just under 10 degrees.": "Setzen Sie die rote Markierung so, dass das Thermometer knapp 10 Grad anzeigt.",
  "Don't forget that our thermometer notifies about the temperature, and at this temperature, it is \"Cool!\"": "Vergessen Sie nicht, dass unser Thermometer die Temperatur meldet, und bei dieser Temperatur ist es „Kühl!“",
  "Cold": "Kalt",
  "Set the red marker, so that the thermometer reads about -10 degrees.": "Setzen Sie die rote Markierung so, dass das Thermometer etwa -10 Grad anzeigt.",
  "Freezing": "Gefrierend",
  "Set the red marker, so that the thermometer reads about -30 degrees.": "Setzen Sie die rote Markierung so, dass das Thermometer etwa -30 Grad anzeigt.",
  "Traffic light": "Ampel",
  "Cover the not-working colors with a gray circle and move it to the right place!": "Decken Sie die nicht funktionierenden Farben mit einem grauen Kreis ab und verschieben Sie ihn an die richtige Stelle!",
  "Press the keys 1,2,3": "Drücken Sie die Tasten 1,2,3",
  "Red light": "Rotes Licht",
  "When you press the number \"1,\" the red light is on. One gray circle should cover the green, and the other should cover the yellow.": "Wenn Sie die Zahl „1“ drücken, leuchtet das rote Licht. Ein grauer Kreis sollte das Grüne abdecken, und der andere das Gelbe.",
  "Yellow light": "Gelbes Licht",
  "When you press the number \"2,\" the yellow light is on. One gray circle should cover the green, and the other should cover the red.": "Wenn Sie die Zahl „2“ drücken, leuchtet das gelbe Licht. Ein grauer Kreis sollte das Grüne abdecken, und der andere das Rote.",
  "Green light": "Grünes Licht",
  "When you press the number \"3,\" the green light is on. One gray circle should cover the red, and the second one should cover the yellow.": "Wenn Sie die Zahl „3“ drücken, leuchtet das grüne Licht. Ein grauer Kreis sollte das Rote abdecken, und der zweite das Gelbe.",
  "Sun": "Sonne",
  "Watch how smoothly the sun moves across the sky!": "Beobachten Sie, wie sanft sich die Sonne über den Himmel bewegt!",
  "The sun glides to multiple points": "Die Sonne gleitet zu mehreren Punkten",
  "The sun changes costumes": "Die Sonne wechselt das Kostüm",
  "Anfangsplatzierung": "Anfangsplatzierung",
  "Cat": "Katze",
  "Program the cat so that it turns to each of the goodies one after another.": "Programmieren Sie die Katze so, dass sie sich nacheinander den Leckereien zuwendet.",
  "Turn up": "Nach oben drehen",
  "To make the cat turn towards the mouse, use the direction equal to 0.": "Damit sich die Katze zur Maus dreht, verwende die Richtung gleich 0.",
  "Turn right": "Nach rechts drehen",
  "To make the cat turn towards the milk, use the direction equal to 90.": "Damit sich die Katze zur Milch dreht, verwende die Richtung gleich 90.",
  "Turn down": "Nach unten drehen",
  "To make the cat turn towards the can of food, use the direction equal to 90.": "Damit sich die Katze zur Futterdose dreht, verwende die Richtung gleich 90.",
  "What does the cat say between direction changes?": "Was sagt die Katze zwischen den Richtungswechseln?",
  "Come up with it yourself!": "Denk es dir selbst aus!",
  "Sprite direction": "Sprite-Richtung",
  "The direction the sprite is facing can be seen in the sprite properties.": "Die Richtung, in die das Sprite blickt, ist in den Sprite-Eigenschaften zu sehen.",
  "Direction values": "Richtungswerte",
  "By clicking on the window with the direction, it can be forcibly changed without using commands.": "Durch Klicken auf das Fenster mit der Richtung kann diese zwangsweise geändert werden, ohne Befehle zu verwenden.",
  "Mouse": "Maus",
  "Program the mouse so that it runs around the stage but does not run off of it!": "Programmiere die Maus so, dass sie um die Bühne läuft, aber nicht von ihr wegläuft!",
  "Endless movement: the mouse tries to run away": "Endlose Bewegung: Die Maus versucht wegzulaufen",
  "The \"go __ steps\" command moves the sprite a few steps in the direction it is currently looking in. Now just make it so that it always repeats itself!": "Der Befehl „gehe __ Schritte“ bewegt das Sprite einige Schritte in die Richtung, in die es gerade blickt. Jetzt mach es einfach so, dass es sich immer wiederholt!",
  "The mouse does not run away": "Die Maus läuft nicht weg",
  "The command \"if on edge, bounce\" does not allow the mouse to go off the stage.": "Der Befehl „wenn auf der Kante, hüpfe“ lässt die Maus nicht von der Bühne weglaufen.",
  "Set the position that the mouse occupies at the start, as well as the direction it is pointed in at the beginning!": "Legen Sie die Position fest, die die Maus zu Beginn einnimmt, sowie die Richtung, in die sie zu Beginn zeigt!",
  "MarsBot on Mars": "MarsBot auf dem Mars",
  "Program the MarsBot to walk left and right and not bump into mountains!": "Programmieren Sie den MarsBot so, dass er nach links und rechts geht und nicht gegen Berge stößt!",
  "Initial placement of the MarsBot": "Anfangsplatzierung des MarsBots",
  "Don't forget about placement: you need to set the position of the MarsBot and the direction it is looking in.": "Vergessen Sie die Platzierung nicht: Sie müssen die Position des MarsBots und die Richtung festlegen, in die er blickt.",
  "The MarsBot goes from one mountain to another": "Der MarsBot geht von einem Berg zum anderen",
  "Use motion, wait, and loop commands to program the movement of the sprite.": "Verwenden Sie die Befehle „Bewegung“, „Warte“ und „Schleife“, um die Bewegung des Sprites zu programmieren.",
  "The MarsBot turns around": "Der MarsBot dreht sich um",
  "But how to turn around without pushing off of the edge? Use the already familiar \"point in direction __\" command. And don't forget about rotation style!": "Aber wie dreht man sich um, ohne sich von der Kante abzustoßen? Verwenden Sie den bereits bekannten Befehl „In Richtung __ zeigen“. Und vergessen Sie den Rotationsstil nicht!",
  "The MarsBot returns to the starting point": "Der MarsBot kehrt zum Ausgangspunkt zurück",
  "Penguin": "Pinguin",
  "Program the Penguin's walk!": "Programmieren Sie den Gang des Pinguins!",
  "Initial placement of the penguin": "Anfangsplatzierung des Pinguins",
  "Set the initial placement of the penguin so that the project always starts the same way.": "Legen Sie die Anfangsplatzierung des Pinguins fest, damit das Projekt immer auf die gleiche Weise beginnt.",
  "The penguin walks": "Der Pinguin geht",
  "Use motion, wait, and loop commands to program the sprite to walk!": "Verwenden Sie die Befehle „Bewegung“, „Warte“ und „Schleife“, um das Gehen des Sprites zu programmieren!",
  "The penguin turns": "Der Pinguin dreht sich",
  "How to turn around without pushing off of the edge? Use the already familiar \"point in direction __\" command. And don't forget about rotation style!": "Wie kann man sich umdrehen, ohne sich von der Kante abzustoßen? Verwenden Sie den bereits bekannten Befehl „in Richtung __ zeigen“. Und vergessen Sie den Rotationsstil nicht!",
  "The penguin change costumes": "Der Pinguin wechselt das Kostüm",
  "Make the penguin change costumes while walking.": "Lassen Sie den Pinguin beim Gehen das Kostüm wechseln.",
  "Bug": "Käfer",
  "The bug should reach the ladybug by moving along the branches of the tree!": "Der Käfer sollte den Marienkäfer erreichen, indem er sich entlang der Äste des Baumes bewegt!",
  "Initial placement of the bug": "Erste Platzierung des Käfers",
  "The initial placement is already complete, but you can add size settings, a phrase, or whatever you like!": "Die erste Platzierung ist bereits abgeschlossen, aber Sie können Größeneinstellungen, einen Satz oder was auch immer Sie möchten hinzufügen!",
  "The bug moves": "Der Käfer bewegt sich",
  "The bug turns in a certain direction, takes a few steps, and then turns again, and takes a few more steps. Experiment and guide the bug to the ladybug!": "Der Käfer dreht sich in eine bestimmte Richtung, macht ein paar Schritte, dreht sich dann wieder um und macht noch ein paar Schritte. Experimentieren Sie und führen Sie den Käfer zum Marienkäfer!",
  "Mouse in the maze": "Maus im Labyrinth",
  "The mouse has to get to the red button in the maze.": "Die Maus muss zum roten Knopf im Labyrinth gelangen.",
  "Do the initial placement. Some of the commands are already there!": "Führen Sie die erste Platzierung durch. Einige der Befehle sind bereits vorhanden!",
  "Mouse sprite movement starts": "Die Bewegung des Maus-Sprites beginnt",
  "Make it so that clicking the green flag triggers mouse movement.": "Machen Sie es so, dass das Klicken auf die grüne Flagge die Mausbewegung auslöst.",
  "The mouse runs to the red button": "Die Maus läuft zum roten Knopf",
  "Use this construction to bypass the walls of the labyrinth.": "Verwenden Sie diese Konstruktion, um die Wände des Labyrinths zu umgehen.",
  "Open the door": "Öffne die Tür",
  "Help the robots meet! Program the door to open when you press the space bar!": "Helfe den Robotern, sich zu treffen! Programmiere die Tür so, dass sie sich öffnet, wenn du die Leertaste drückst!",
  "The door must always be closed at startup. Use the Point in direction __ command to set the position of the door.": "Die Tür muss beim Start immer geschlossen sein. Verwende den Befehl „In Richtung zeigen __“, um die Position der Tür festzulegen.",
  "The door turns": "Die Tür dreht sich",
  "The door opens when you press the space bar.": "Die Tür öffnet sich, wenn du die Leertaste drückst.",
  "The \"Rotate clockwise __ degrees\" command will rotate the door relative to itself. Let's put it inside a loop so that it does it multiple times.": "Der Befehl „Im Uhrzeigersinn drehen __ Grad“ dreht die Tür relativ zu sich selbst. Lass uns ihn in eine Schleife setzen, damit er das mehrmals macht.",
  "The knight": "Der Ritter",
  "The knight is on duty and guarding the tower! Program it to walk around the tower from all sides.": "Der Ritter ist im Dienst und bewacht den Turm! Programmiere ihn so, dass er den Turm von allen Seiten umrundet.",
  "The knight starts moving from the lower-left corner and looks to the right.": "Der Ritter beginnt sich in der unteren linken Ecke zu bewegen und schaut nach rechts.",
  "The knight walks around one side of the tower": "Der Ritter geht um eine Seite des Turms herum",
  "To get around one side of the tower, the knight takes 10 steps 25 times.": "Um um eine Seite des Turms herumzukommen, macht der Ritter 25 Mal 10 Schritte.",
  "The knight turns": "Der Ritter dreht sich",
  "Each time after going around a wall, the knight turns 90 degrees. Note: counterclockwise turn.": "Jedes Mal, nachdem er um eine Wand herumgegangen ist, dreht sich der Ritter um 90 Grad. Hinweis: Drehung gegen den Uhrzeigersinn.",
  "Loop": "Schleife",
  "To get around the 4 walls, the knight needs to repeat the walk and turn 4 times.": "Um um die 4 Wände herumzukommen, muss der Ritter den Gang und die Drehung 4 Mal wiederholen.",
  "Egg": "Ei",
  "Crack the egg! To do that, program a 90° rotation.": "Schlag das Ei auf! Programmiere dazu eine 90°-Drehung.",
  "At startup, the egg is at a certain point, turned in a certain direction, and not broken.": "Beim Start befindet sich das Ei an einem bestimmten Punkt, ist in eine bestimmte Richtung gedreht und nicht zerbrochen.",
  "If the position changes are instantaneous, we will not see the difference. Let's add a 1-second delay to see the animation.": "Wenn die Positionsänderungen augenblicklich erfolgen, sehen wir den Unterschied nicht. Fügen wir eine Verzögerung von 1 Sekunde hinzu, um die Animation zu sehen.",
  "The egg turns": "Das Ei dreht sich",
  "Use the \"turn 90 degrees\" command.": "Verwende den Befehl „90 Grad drehen“.",
  "Note that the egg will turn to the left.": "Beachte, dass sich das Ei nach links dreht.",
  "The egg moves to the left": "Das Ei bewegt sich nach links",
  "To visually drop the egg on its side, but so that it doesn't move, you need to change the coordinate.": "Um das Ei optisch auf die Seite fallen zu lassen, es sich aber nicht bewegt, musst du die Koordinate ändern.",
  "What coordinate should change if the egg moves to the left?": "Welche Koordinate soll sich ändern, wenn sich das Ei nach links bewegt?",
  "The egg is cracked": "Das Ei ist zerbrochen",
  "Select the appropriate costume": "Wähle das passende Kostüm",
  "The ball is spinning!": "Der Ball dreht sich!",
  "The ball sprite is spinning like a real one! Program it.": "Die Ball-Sprite dreht sich wie eine echte! Programmiere sie.",
  "Repeating turns": "Wiederholte Drehungen",
  "The ball sprite must rotate around its axis.": "Die Ball-Sprite muss sich um ihre Achse drehen.",
  "Use the commands \"repeat __ times\", \"turn ___\".": "Verwende die Befehle „__-mal wiederholen“, „___ drehen“.",
  "*Bonus: change the speed": "*Bonus: Geschwindigkeit ändern",
  "Think about how to change the rotation speed.": "Überlegen Sie, wie Sie die Rotationsgeschwindigkeit ändern können.",
  "Butterfly": "Schmetterling",
  "The butterfly flies around the flower. Program it!": "Der Schmetterling fliegt um die Blume. Programmieren Sie ihn!",
  "Rotation": "Rotation",
  "First, program the rotation of the butterfly — just like the ball in the previous task!": "Programmieren Sie zuerst die Rotation des Schmetterlings – genau wie beim Ball in der vorherigen Aufgabe!",
  "Circular movement": "Kreisbewegung",
  "To make a circle, add the command \"move __ steps\" to the loop. Then, after each small turn, the butterfly will move to the side, and then again make a turn and step: that is rotation!": "Um einen Kreis zu erstellen, fügen Sie der Schleife den Befehl „move __ steps“ hinzu. Dann bewegt sich der Schmetterling nach jeder kleinen Drehung zur Seite und macht dann erneut eine Drehung und einen Schritt: das ist Rotation!",
  "Clock": "Uhr",
  "This clock will be just like a real one after you program it.": "Nachdem Sie diese Uhr programmiert haben, ist sie genau wie eine echte.",
  "At startup, the time is exactly 12:00!": "Beim Start ist es genau 12:00 Uhr!",
  "Movement of the second hand": "Bewegung des Sekundenzeigers",
  "Does the arrow move clockwise or counterclockwise?": "Bewegt sich der Pfeil im oder gegen den Uhrzeigersinn?",
  "The whole circle is 360 degrees. 60 seconds in one circle. 360 divided by 60 = 6.": "Der gesamte Kreis hat 360 Grad. 60 Sekunden in einem Kreis. 360 geteilt durch 60 = 6.",
  "The second hand rotates 6 degrees every second.": "Der Sekundenzeiger dreht sich jede Sekunde um 6 Grad.",
  "Movement of the minute hand": "Bewegung des Minutenzeigers",
  "Have you noticed that the minute hand moves less often and a shorter distance than the second hand? Let's move it one degree at a time. The minute hand moves 6 degrees in 60 seconds. 60 seconds divided by 6 degrees is 10 seconds — after that, the minute hand will move 1 degree.": "Ist Ihnen aufgefallen, dass sich der Minutenzeiger seltener und über eine kürzere Distanz bewegt als der Sekundenzeiger? Bewegen wir ihn um jeweils ein Grad. Der Minutenzeiger bewegt sich in 60 Sekunden um 6 Grad. 60 Sekunden geteilt durch 6 Grad sind 10 Sekunden – danach bewegt sich der Minutenzeiger um 1 Grad.",
  "Sprite center": "Sprite-Mitte",
  "Notice the small gray circle on the cloth of the sprite's costume. This is the center of the sprite around which it rotates.": "Beachten Sie den kleinen grauen Kreis auf dem Stoff des Sprite-Kostüms. Dies ist die Mitte des Sprites, um die es rotiert.",
  "Meeting on Mars": "Treffen auf dem Mars",
  "Watch a fragment of the animation: what should we do with what we found?": "Sehen Sie sich einen Ausschnitt der Animation an: Was sollen wir mit dem tun, was wir gefunden haben?",
  "The \"On Mars\" scene is already prepared": "Die Szene „Auf dem Mars“ ist bereits vorbereitet",
  "Part of the code is already ready. Study it; it does the initial placement and the first scene.": "Ein Teil des Codes ist bereits fertig. Studieren Sie ihn; er sorgt für die anfängliche Platzierung und die erste Szene.",
  "Program the \"On the base\" scene": "Programmieren Sie die Szene „Auf der Basis“",
  "Program the second scene using the prepared plan in your workbook.": "Programmieren Sie die zweite Szene mithilfe des vorbereiteten Plans in Ihrem Arbeitsbuch.",
  "Create your own scene": "Erstellen Sie Ihre eigene Szene",
  "Come up with a continuation and program it! It can be inserted before the \"On Mars\" scene, or after it!": "Denken Sie sich eine Fortsetzung aus und programmieren Sie sie! Sie kann vor oder nach der Szene „Auf dem Mars“ eingefügt werden!",
  "Animation": "Animation",
  "Come up with a story and tell it!": "Denken Sie sich eine Geschichte aus und erzählen Sie sie!",
  "Planung": "Planung",
  "Use the pages in your workbook to sketch an outline of your animation. Pay special attention to how the scene switching will be arranged!": "Verwenden Sie die Seiten in Ihrem Arbeitsbuch, um einen Umriss Ihrer Animation zu skizzieren. Achten Sie besonders darauf, wie der Szenenwechsel angeordnet wird!",
  "Add 2-3 sprites and 2-3 backgrounds.": "Füge 2-3 Sprites und 2-3 Hintergründe hinzu.",
  "Add or draw 2-3 sprites that you need for your animation!": "Füge 2-3 Sprites hinzu oder zeichne sie, die du für deine Animation brauchst!",
  "- Think about what will happen in the first scene of the animation?": "- Überlege, was in der ersten Szene der Animation passieren wird?",
  "- And the second?": "- Und in der zweiten?",
  "- What are the sprites and backgrounds like?": "- Wie sehen die Sprites und Hintergründe aus?",
  "Erstellen!": "Erstellen!",
  "The most important part is left — program!": "Der wichtigste Teil bleibt noch – das Programmieren!",
  "Colored ball": "Farbiger Ball",
  "The ball moves freely around the stage. Each time it touches the edge, it changes color and direction!": "Der Ball bewegt sich frei auf der Bühne. Bei jeder Berührung des Randes ändert er Farbe und Richtung!",
  "Program the ball sprite to move constantly": "Programmiere den Ball-Sprite so, dass er sich konstant bewegt",
  "Complete this task using the familiar \"move _ steps\" and \"repeat forever\" commands.": "Erledige diese Aufgabe mit den bekannten Befehlen „move _ steps“ und „repeat forever“.",
  "Program the ball so that it does not fly out of bounds": "Programmiere den Ball so, dass er nicht aus dem Spielfeld fliegt",
  "To complete this task, you need the command \"if on edge, bounce,\" which also checks the condition! And it contains a mathematical formula for calculating the angle at which the ball turns.": "Um diese Aufgabe zu erledigen, benötigst du den Befehl „if on edge, bounce“, der auch die Bedingung prüft! Und er enthält eine mathematische Formel zur Berechnung des Winkels, um den sich der Ball dreht.",
  "But where do we put this command so that it always works?": "Aber wo platzieren wir diesen Befehl, damit er immer funktioniert?",
  "Program the condition \"if the ball touches the edge, it changes color\"": "Programmiere die Bedingung „if the ball touches the edge, it change color“",
  "But we do not have this ready-made command. We need to program a check for the condition \"if it touches the edge, it changes color.\"": "Aber diesen vorgefertigten Befehl haben wir nicht. Wir müssen eine Prüfung für die Bedingung „if it touches the edge, it change color“ programmieren.",
  "You can change the color by changing the costume!": "Du kannst die Farbe ändern, indem du das Kostüm wechselst!",
  "Anfangsplatzierung": "Anfangsplatzierung",
  "Set the initial size, costume, and position of the sprite Ball!": "Lege die Anfangsgröße, das Kostüm und die Position des Sprite-Balls fest!",
  "Sterne": "Sterne",
  "Move your mouse cursor over the stars to collect them!": "Bewege deinen Mauszeiger über die Sterne, um sie einzusammeln!",
  "When you collect all the stars, press the space bar and they will reappear.": "Wenn du alle Sterne eingesammelt hast, drücke die Leertaste und sie werden wieder erscheinen.",
  "A star is hiding": "Ein Stern versteckt sich",
  "Program the condition \"if the mouse pointer touches the star, it hides.\"": "Programmiere die Bedingung „Wenn der Mauszeiger den Stern berührt, versteckt er sich.“",
  "To check the condition, always use the \"repeat forever\" command.": "Um die Bedingung zu überprüfen, verwende immer den Befehl „Endlos wiederholen“.",
  "A star appears": "Ein Stern erscheint",
  "When we press the space bar a star appears.": "Wenn wir die Leertaste drücken, erscheint ein Stern.",
  "At the start, the sprite Star is always visible.": "Zu Beginn ist der Sprite Stern immer sichtbar.",
  "Let's program the remaining stars": "Programmieren wir die restlichen Sterne",
  "Program the remaining stars": "Programmiere die restlichen Sterne",
  "Jellyfish": "Qualle",
  "Click anywhere on the stage! When you press the mouse button, the background and costume change.": "Klicke irgendwo auf die Bühne! Wenn du die Maustaste drückst, ändern sich Hintergrund und Kostüm.",
  "When you click on the mouse, the sprite changes its costume": "Wenn du mit der Maus klickst, wechselt der Sprite sein Kostüm",
  "Program the condition so that when you click on the mouse pointer, the sprite changes its costume.": "Programmiere die Bedingung so, dass wenn du mit dem Mauszeiger klickst, der Sprite sein Kostüm wechselt.",
  "The script for changing backgrounds is already in the project.": "Das Skript zum Ändern der Hintergründe ist bereits im Projekt vorhanden.",
  "Always check if the mouse is clicked": "Immer überprüfen, ob mit der Maus geklickt wird",
  "This condition must always be checked. We need this command to do so.": "Diese Bedingung muss immer überprüft werden. Dafür benötigen wir diesen Befehl.",
  "The costume must always be the same when starting up.": "Das Kostüm muss beim Start immer gleich sein.",
  "Bat": "Fledermaus",
  "Click anywhere on the stage, the Bat sprite will fly to the mouse pointer for 1 second! Let's program it!": "Klicken Sie irgendwo auf die Bühne, das Fledermaus-Sprite fliegt 1 Sekunde lang zum Mauszeiger! Lass es uns programmieren!",
  "Program the condition \"if the mouse is clicked, glide...\"": "Programmieren Sie die Bedingung „Wenn die Maus geklickt wird, gleiten Sie …“",
  "Program the rule \"if the mouse is clicked, glide for 1 second to the mouse pointer.\"": "Programmieren Sie die Regel „Wenn die Maus geklickt wird, gleiten Sie 1 Sekunde lang zum Mauszeiger.“",
  "You already know how to check rules using the \"if ...\" operator. Use this condition!": "Sie wissen bereits, wie Sie Regeln mit dem Operator „wenn …“ überprüfen. Verwenden Sie diese Bedingung!",
  "This condition must always be checked. What command do we need?": "Diese Bedingung muss immer überprüft werden. Welchen Befehl benötigen wir?",
  "Three balls": "Drei Bälle",
  "After clicking on the green flag, the balls begin to move chaotically.": "Nach dem Klicken auf die grüne Flagge beginnen die Bälle, sich chaotisch zu bewegen.",
  "Set the position of the sprite Ball at the start and its direction.": "Stellen Sie die Position des Sprite-Balls am Anfang und seine Richtung ein.",
  "Any direction can be used!": "Jede Richtung kann verwendet werden!",
  "Chaotic ball movement": "Chaotische Ballbewegung",
  "Program the movement of the ball using the \"move_steps\" and \"repeat forever\" commands.": "Programmieren Sie die Bewegung des Balls mit den Befehlen „move_steps“ und „repeat forever“.",
  "Change of direction": "Richtungsänderung",
  "Program a change in the direction of the Ball sprite if it reaches the edge.": "Programmieren Sie eine Richtungsänderung des Ball-Sprites, wenn es den Rand erreicht.",
  "For the command to always work, where should it be placed — in the loop or after?": "Damit der Befehl immer funktioniert, wo sollte er platziert werden – in der Schleife oder danach?",
  "Program 2 more balls": "Programmiere 2 weitere Bälle",
  "Program the remaining balls by moving the resulting script to the sprite icon. Set for each ball its own starting position.": "Programmiere die restlichen Bälle, indem du das resultierende Skript auf das Sprite-Symbol verschiebst. Lege für jeden Ball seine eigene Startposition fest.",
  "Watch how the balls move: when they touch, they bounce off each other!": "Beobachte, wie sich die Bälle bewegen: Wenn sie sich berühren, prallen sie voneinander ab!",
  "Modify the program to make the yellow ball fly away from others when it collides.": "Ändere das Programm, damit der gelbe Ball bei einer Kollision von den anderen wegfliegt.",
  "Checking if touching": "Berührungsprüfung",
  "Use this condition to program the balls touching.": "Verwende diese Bedingung, um die Berührung der Bälle zu programmieren.",
  "Bouncing": "Abprallen",
  "To make them bounce, they need to turn in the opposite direction and move!": "Damit sie abprallen, müssen sie sich in die entgegengesetzte Richtung drehen und bewegen!",
  "Let's do the same!": "Machen wir das Gleiche!",
  "Checking if touching and bouncing": "Berührungsprüfung und Abprallen",
  "Checking if both balls are touching": "Überprüfen, ob sich beide Bälle berühren",
  "Move the script": "Verschiebe das Skript",
  "The ball scripts are very similar: they differ only in specifying the sprites they are colliding with. If you assemble a script for one ball, it can then be used as a template for other balls. To do that, transfer the script to the sprite image, as shown in the animation.": "Die Ballskripte sind sehr ähnlich: Sie unterscheiden sich nur in der Angabe der Sprites, mit denen sie kollidieren. Wenn du ein Skript für einen Ball zusammenstellst, kann es als Vorlage für andere Bälle verwendet werden. Übertrage dazu das Skript auf das Sprite-Bild, wie in der Animation gezeigt.",
  "The balloons are coming out of the box!": "Die Ballons kommen aus der Schachtel!",
  "Use the mouse cursor to keep the balloons away from the edge!": "Benutze den Mauszeiger, um die Ballons vom Rand fernzuhalten!",
  "Program touching the edge": "Programmiere das Berühren des Rands",
  "When the balloons touch the edge, they start coming out of the box again. Use a condition and the \"move\" command!": "Wenn die Ballons den Rand berühren, beginnen sie wieder aus der Box zu kommen. Verwende eine Bedingung und den Befehl „Bewegen“!",
  "The balloons touch the mouse cursor": "Die Ballons berühren den Mauszeiger",
  "When the balloons touch the mouse cursor, they should turn. Use a condition and command with rotation!": "Wenn die Ballons den Mauszeiger berühren, sollten sie sich drehen. Verwende eine Bedingung und einen Befehl mit Drehung!",
  "The hedgehog is flying to the crab!": "Der Igel fliegt zur Krabbe!",
  "Study the game: you will need to create a similar one.": "Studiere das Spiel: Du wirst ein ähnliches erstellen müssen.",
  "Use the mouse cursor to aim and shoot the crabs by clicking on the mouse.": "Verwende den Mauszeiger, um zu zielen und die Krabben durch Klicken mit der Maus abzuschießen.",
  "The game consists of 2 stages: aiming and launching. Program the sprite to send messages to itself and split up the execution of the conditions using those messages!": "Das Spiel besteht aus 2 Phasen: Zielen und Abschießen. Programmiere die Figur so, dass sie sich selbst Nachrichten sendet und teile die Ausführung der Bedingungen mithilfe dieser Nachrichten auf!",
  "Use the \"if... then...\" command at least 2 times.": "Verwende den Befehl „wenn... dann...“ mindestens 2 Mal.",
  "Use the \"if... then...\" command to check the conditions \"mouse clicked?\" and \"touching the edge?\"": "Verwende den Befehl „wenn... dann...“, um die Bedingungen „Maus geklickt?“ und „Rand berühren?“ zu überprüfen.",
  "Use the \"repeat forever\" command at least 2 times.": "Verwende den Befehl „für immer wiederholen“ mindestens 2 Mal.",
  "Use the \"repeat forever\" command to program constant checking of the conditions.": "Verwende den Befehl „für immer wiederholen“, um die ständige Überprüfung der Bedingungen zu programmieren.",
  "Use the \"stop other sprite scripts\" command at least 2 times.": "Verwenden Sie den Befehl „Andere Sprite-Skripte stoppen“ mindestens 2 Mal.",
  "Use the \"stop other sprite scripts\" command to prevent the simultaneous execution of scripts.": "Verwenden Sie den Befehl „Andere Sprite-Skripte stoppen“, um die gleichzeitige Ausführung von Skripten zu verhindern.",
  "Beetle on a tree": "Käfer auf einem Baum",
  "Let's program it: the sprite Beetle moves up the tree!": "Lass es uns programmieren: Der Sprite Käfer bewegt sich den Baum hinauf!",
  "Upward movement": "Aufwärtsbewegung",
  "To move the Beetle sprite up, use the \"change y by __\" command.": "Um den Käfer-Sprite nach oben zu bewegen, verwenden Sie den Befehl „y um __ ändern“.",
  "Having reached the top of the trunk, the Beetle sprite starts moving from the beginning.": "Nachdem der Käfer-Sprite die Spitze des Baumstamms erreicht hat, beginnt er sich von vorne zu bewegen.",
  "Use the command \"go to x: __ y: __\" to return the Beetle sprite to the beginning of its journey.": "Verwenden Sie den Befehl „gehe zu x:__y:__“, um den Käfer-Sprite an den Anfang seiner Reise zurückzubringen.",
  "Set the direction and size of the Beetle sprite at the very beginning.": "Stellen Sie die Richtung und Größe des Käfer-Sprites ganz am Anfang ein.",
  "Snowflakes": "Schneeflocken",
  "The Snowflake sprite appears at the top of the stage and falls down.": "Der Schneeflocken-Sprite erscheint oben auf der Bühne und fällt herunter.",
  "Set the initial position of the Snowflake sprite.": "Stellen Sie die Anfangsposition des Schneeflocken-Sprites ein.",
  "Falling": "Fallen",
  "Repeat the coordinate change a few times to simulate falling!": "Wiederholen Sie die Koordinatenänderung ein paar Mal, um das Fallen zu simulieren!",
  "The snowflake falls constantly": "Die Schneeflocke fällt ständig",
  "The Snowflake sprite always returns to the top and falls again!": "Der Schneeflocken-Sprite kehrt immer wieder nach oben zurück und fällt erneut!",
  "The dragon guards the castle": "Der Drache bewacht das Schloss",
  "The sprite Dragon flies left and right!": "Der Sprite Drache fliegt nach links und rechts!",
  "The dragon moves to the right": "Der Drache bewegt sich nach rechts",
  "To move to the right, you need to change the X coordinate to a positive number (without the minus sign).": "Um sich nach rechts zu bewegen, müssen Sie die X-Koordinate in eine positive Zahl ändern (ohne Minuszeichen).",
  "The dragon moves to the left": "Der Drache bewegt sich nach links",
  "To move to the left, you need to change the X coordinate to a negative number that has a minus sign.": "Um sich nach links zu bewegen, müssen Sie die X-Koordinate in eine negative Zahl mit einem Minuszeichen ändern.",
  "The dragon turns": "Der Drache dreht sich",
  "The sprite Dragon looks in the direction it is flying in. Use the \"point in direction __\" command.": "Der Sprite Drache schaut in die Richtung, in die er fliegt. Verwenden Sie den Befehl „in Richtung __ zeigen“.",
  "The dragon moves constantly": "Der Drache bewegt sich ständig",
  "Use the commands \"repeat forever\" and \"go to x: _ y: _\" to make the Dragon sprite move on the same level.": "Verwende die Befehle „Endlos wiederholen“ und „Gehe zu x:_y:_“, damit sich der Drachen-Sprite auf derselben Ebene bewegt.",
  "Set the size and rotation of the Dragon sprite.": "Stelle die Größe und Rotation des Drachen-Sprites ein.",
  "Goalkeeper control right and left": "Torwartsteuerung rechts und links",
  "Use the right arrow key to move the goalkeeper to the right and the left arrow key to move the goalkeeper to the left.": "Verwende die rechte Pfeiltaste, um den Torwart nach rechts zu bewegen, und die linke Pfeiltaste, um den Torwart nach links zu bewegen.",
  "Movement to the right": "Bewegung nach rechts",
  "Program the following rule: if the right arrow key is pressed, the goalkeeper moves to the right.": "Programmiere folgende Regel: Wird die rechte Pfeiltaste gedrückt, bewegt sich der Torwart nach rechts.",
  "Movement to the left": "Bewegung nach links",
  "Program the following rule: if the left arrow key is pressed, the goalkeeper moves to the left.": "Programmiere folgende Regel: Wird die linke Pfeiltaste gedrückt, bewegt sich der Torwart nach links.",
  "Constantly checking keystrokes": "Ständige Kontrolle der Tastenanschläge",
  "Use one \"repeat forever\" command to constantly check to see if any keys are pressed.": "Verwende einen „Endlos wiederholen“-Befehl, um ständig zu kontrollieren, ob Tasten gedrückt werden.",
  "Set the size of the goalkeeper at the very beginning.": "Stelle die Größe des Torwarts ganz am Anfang ein.",
  "Goalkeeper control up and down": "Torwartsteuerung nach oben und unten",
  "Use the up arrow key to move the goalkeeper up and the down arrow key to move the goalkeeper down.": "Verwende die Pfeiltaste nach oben, um den Torwart nach oben zu bewegen, und die Pfeiltaste nach unten, um den Torwart nach unten zu bewegen.",
  "Program the following rule: if the up arrow key is pressed, the goalkeeper moves up.": "Programmiere folgende Regel: Wird die Pfeiltaste nach oben gedrückt, bewegt sich der Torwart nach oben.",
  "Downward movement": "Abwärtsbewegung",
  "Program the following rule: if the down arrow key is pressed, the goalkeeper moves down.": "Programmiere folgende Regel: Wird die Pfeiltaste nach unten gedrückt, bewegt sich der Torwart nach unten.",
  "In order for the program to always check if a key is pressed, use the \"repeat forever\" command.": "Damit das Programm immer prüft, ob eine Taste gedrückt wurde, verwende den Befehl „Endlos wiederholen“.",
  "Snowflake sprites appear at the top of the stage and fall down. Let's program that!": "Schneeflocken-Sprites erscheinen oben auf der Bühne und fallen nach unten. Das programmieren wir!",
  "Falling snowflakes": "Fallende Schneeflocken",
  "Program the Snowflake sprites so that they constantly fall.": "Programmiere die Schneeflocken-Sprites so, dass sie ständig fallen.",
  "Use the \"wait __ seconds\" command.": "Verwende den Befehl „Warte __ Sekunden“.",
  "The snowflakes fall at different speeds": "Die Schneeflocken fallen mit unterschiedlicher Geschwindigkeit",
  "Enter different values that change the Y coordinate for different snowflakes — then they will fall differently!": "Gebe unterschiedliche Werte ein, die die Y-Koordinate für unterschiedliche Schneeflocken ändern – dann fallen sie unterschiedlich!",
  "* Bonus: spinning snowflakes": "* Bonus: Rotierende Schneeflocken",
  "Think about how to make the snowflakes spin while they're falling. Which command will turn the snowflakes?": "Überlege, wie du die Schneeflocken beim Fallen rotieren lassen kannst. Welcher Befehl dreht die Schneeflocken?",
  "Soccer": "Fußball",
  "Create a game in which the goalkeeper has to protect their goal.": "Erstelle ein Spiel, bei dem der Torwart sein Tor verteidigen muss.",
  "Use the arrow keys on the keyboard to control the movement of the Goalkeeper sprite.": "Verwende die Pfeiltasten auf der Tastatur, um die Bewegung des Torwart-Sprites zu steuern.",
  "Goalkeeper control": "Torwartsteuerung",
  "If the corresponding key is pressed, the sprite moves in that direction.": "Wenn die entsprechende Taste gedrückt wird, bewegt sich der Sprite in diese Richtung.",
  "Ball movement": "Ballbewegung",
  "Program the Ball sprite so that it moves randomly using the move_steps, repeat forever, and if on edge, bounce.": "Programmiere den Ball-Sprite so, dass er sich mit den Bewegungsschritten zufällig bewegt, dies unendlich wiederholt und, wenn er am Rand steht, abprallt.",
  "The Cat sprite jumps": "Der Katzen-Sprite springt",
  "Press the space bar!": "Drücke die Leertaste!",
  "Program the Cat sprite to move up when you press the spacebar. What coordinate are we going to change?": "Programmiere den Katzen-Sprite so, dass er sich nach oben bewegt, wenn du die Leertaste drückst. Welche Koordinate werden wir ändern?",
  "Program downward movement. What coordinate are we going to change? To what number?": "Programmiere eine Abwärtsbewegung. Welche Koordinate werden wir ändern? Auf welche Zahl?",
  "Use the \"go to x: _ y: _\" command.": "Verwende den Befehl „gehe zu x: _ y: _“.",
  "Race": "Rennen",
  "Use the arrows to control the Car sprite and reach the finish line!": "Verwende die Pfeile, um den Auto-Sprite zu steuern und die Ziellinie zu erreichen!",
  "Car control": "Autosteuerung",
  "Another control method is to turn when you click on the arrows instead of moving! Try to program that.": "Eine andere Steuerungsmethode ist, sich zu drehen, wenn du auf die Pfeile klickst, anstatt dich zu bewegen! Versuche das zu programmieren.",
  "Touching the grass": "Das Gras berühren",
  "Program this rule:": "Programmiere diese Regel:",
  "If the Car sprite touches anything green (i.e. travels off the road), it begins its journey again.": "Wenn der Auto-Sprite etwas Grünes berührt (d. h. von der Straße abkommt), beginnt er seine Reise erneut.",
  "Touching the finish line sprite": "Ziellinien-Sprite berühren",
  "If the Car sprite touches the finish line, you win and the project stops.": "Wenn das Auto-Sprite die Ziellinie berührt, gewinnst du und das Projekt wird beendet.",
  "Dog in the maze": "Hund im Labyrinth",
  "Collect the crystals!": "Sammle die Kristalle!",
  "Create a project plan": "Erstelle einen Projektplan",
  "Plan the project using a notebook. Make notes to help you program your project correctly!": "Plane das Projekt mithilfe eines Notizbuchs. Mache dir Notizen, die dir dabei helfen, dein Projekt richtig zu programmieren!",
  "Controlling the Dog sprite": "Hunde-Sprite steuern",
  "Touching obstacles": "Hindernisse berühren",
  "There are two obstacles in this project — the walls of the maze and the lightning.": "In diesem Projekt gibt es zwei Hindernisse – die Wände des Labyrinths und den Blitz.",
  "Level 1": "Level 1",
  "Program the initial placement for level 1.": "Programmiere die anfängliche Platzierung für Level 1.",
  "Level 2": "Level 2",
  "Program the initial placement for level 2.": "Programmiere die anfängliche Platzierung für Level 2.",
  "Touching the target": "Ziel berühren",
  "We have two targets: two different crystals. One of the crystals takes us to the next level, and the other one creates the \"Victory\" event.": "Wir haben zwei Ziele: zwei verschiedene Kristalle. Einer der Kristalle bringt uns zum nächsten Level und der andere erzeugt das „Sieg“-Ereignis.",
  "Game": "Spiel",
  "Create your own game with a main character, prize, obstacles or enemies, and program it!": "Erstelle dein eigenes Spiel mit einer Hauptfigur, einem Preis, Hindernissen oder Feinden und programmiere es!",
  "Planung": "Planung",
  "Use the pages in your notebook to display your game plan.": "Verwende die Seiten in deinem Notizbuch, um deinen Spielplan darzustellen.",
  "Controlling the main character": "Hauptfigur steuern",
  "Choose the main character for your game and program their control!": "Wähle die Hauptfigur für dein Spiel und programmiere ihre Steuerung!",
  "Program the transition to the second stage and the initial placement for it! Don't forget the obstacles and the goal!": "Programmiere den Übergang zur zweiten Stufe und die anfängliche Platzierung dafür! Vergiss die Hindernisse und das Ziel nicht!",
  "Victory": "Sieg",
  "Remember to program how the player will find out when they have won.": "Denke daran, zu programmieren, wie der Spieler erfährt, wenn er gewonnen hat.",
  "Erstellen!": "Erstellen!",
  "Program your level!": "Programmiere dein Level!",
  "Use the pages in your workbook to display your game plan.": "Verwende die Seiten in deinem Arbeitsbuch, um deinen Spielplan darzustellen.",
  "Do the initial placement and movement of obstacles and enemies for the first level!": "Mache die anfängliche Platzierung und Bewegung von Hindernissen und Feinden für das erste Level!"
}

