{
  "Hey! Let's get acquainted with Scratch": "Hey! Machen wir uns mit Scratch vertraut",
  "Here are the tasks that need to be completed. To hide this window, click on the purple line to the left of the text. To reopen the tasks, click on the purple line in the upper right corner. You can find information about useful buttons in Scratch in the task list below. Let's open the first one!": "Hier sind die Aufgaben, die erledigt werden müssen. Um dieses Fenster auszublenden, klicken Sie auf die violette Linie links neben dem Text.\nUm die Aufgaben erneut zu öffnen, klicken Sie auf die violette Linie in der oberen rechten Ecke.\n\nInformationen zu nützlichen Schaltflächen in Scratch finden Sie in der Aufgabenliste unten.\nÖffnen wir die erste!",
  "Add a background": "Hintergrund hinzufügen",
  "Add a background to your project. Click on the animation above to see how. When the background is ready, mark the task completed by checking the box and move on to the next task!": "Fügen Sie Ihrem Projekt einen Hintergrund hinzu. Klicken Sie auf die Animation oben, um zu sehen, wie das geht.\nWenn der Hintergrund fertig ist, markieren Sie die Aufgabe als erledigt, indem Sie das Kontrollkästchen aktivieren, und fahren Sie mit der nächsten Aufgabe fort!",
  "Add sprites": "Sprites hinzufügen",
  "A sprite is a character that we program in Scratch. Add a sprite, size it, and move it to the desired location.": "Ein Sprite ist eine Figur, die wir in Scratch programmieren. Fügen Sie ein Sprite hinzu, passen Sie seine Größe an und verschieben Sie es an die gewünschte Stelle.",
  "Delete the extra sprite": "Löschen Sie das zusätzliche Sprite",
  "Click on the x to delete the sprite. If you delete a sprite by accident, click \"Edit\" -> \"Restore Sprite.\"": "Klicken Sie auf das x, um das Sprite zu löschen. Wenn Sie ein Sprite versehentlich löschen, klicken Sie auf \"Bearbeiten\" -> \"Sprite wiederherstellen.\"",
  "Save the project": "Speichern Sie das Projekt",
  "Click the \"Save\" button to save all the latest changes to the project!": "Klicken Sie auf die \"Speichern\"-Schaltfläche, um alle letzten Änderungen am Projekt zu speichern!",
  "Choose and add a suitable background for these characters! Click on the animation and see how to add a background.": "Wählen Sie einen passenden Hintergrund für diese Figuren aus und fügen Sie ihn hinzu! Klicken Sie auf die Animation und sehen Sie, wie Sie einen Hintergrund hinzufügen.",
  "Add a suitable background": "Fügen Sie einen passenden Hintergrund hinzu",
  "Save the project and go to the next level": "Speichern Sie das Projekt und gehen Sie zum nächsten Level",
  "Add suitable sprites": "Fügen Sie passende Sprites hinzu",
  "What sprites would look good against this background?": "Welche Sprites würden vor diesem Hintergrund gut aussehen?",
  "Move the sprites to suitable places using the mouse": "Verschieben Sie die Sprites mit der Maus an die passenden Stellen",
  "To delete a sprite, click on the x next to it.": "Um ein Sprite zu löschen, klicken Sie auf das x daneben.",
  "Choose a suitable background": "Wählen Sie einen passenden Hintergrund",
  "Please note: there are already a few ready-made backgrounds in the project. You just need to choose the right one.": "Bitte beachten Sie: Es gibt bereits einige vorgefertigte Hintergründe im Projekt. Sie müssen nur den richtigen auswählen.",
  "Choose a background from those that are available in the project": "Wählen Sie einen Hintergrund aus denen aus, die im Projekt verfügbar sind",
  "Choose the costume you want": "Wählen Sie das gewünschte Kostüm aus",
  "Let the dog look at you. Can you find the right costume?": "Lassen Sie sich vom Hund ansehen. Können Sie das richtige Kostüm finden?",
  "Ask a question": "Stellen Sie eine Frage",
  "If you can't solve a task, write to the teacher in the special chat — Marsgram!": "Wenn Sie eine Aufgabe nicht lösen können, schreiben Sie dem Lehrer im speziellen Chat – Marsgram!",
  "Add a phrase": "Fügen Sie einen Satz hinzu",
  "What will your snowman say?": "Was wird Ihr Schneemann sagen?",
  "The start of the script": "Der Beginn des Skripts",
  "The script starts with the command \"When the green flag is clicked.\"": "Das Skript beginnt mit dem Befehl \"Wenn auf die grüne Flagge geklickt wird.\"",
  "Finish the Mars project": "Das Mars-Projekt beenden",
  "Look, the programmer hasn't completed this project! Finish it.": "Schauen Sie, der Programmierer hat dieses Projekt nicht abgeschlossen! Beenden Sie es.",
  "Change the background from Earth to Mars": "Ändern Sie den Hintergrund von der Erde zum Mars",
  "Use the command \"speak...\"": "Verwenden Sie den Befehl \"sprechen...\"",
  "Choose and add a suitable background for these characters!": "Wählen und fügen Sie einen passenden Hintergrund für diese Charaktere hinzu!",
  "Finish the project at your own discretion": "Beenden Sie das Projekt nach eigenem Ermessen",
  "See how the project should work": "Sehen Sie, wie das Projekt funktionieren soll",
  "Add a command to start the project": "Fügen Sie einen Befehl hinzu, um das Projekt zu starten",
  "The project should be run by clicking on the green flag.": "Das Projekt sollte durch Klicken auf die grüne Flagge gestartet werden.",
  "Add a command for the bear to speak.": "Fügen Sie einen Befehl hinzu, damit der Bär spricht.",
  "The bear should say \"Hello!\" within 3 seconds.": "Der Bär sollte innerhalb von 3 Sekunden \"Hallo!\" sagen.",
  "Dinosaur and snake": "Dinosaurier und Schlange",
  "The snake first wriggles, then sees the dinosaur, is surprised, and then straightens its body. How do we program this?": "Die Schlange windet sich zunächst, sieht dann den Dinosaurier, ist überrascht und richtet dann ihren Körper auf. Wie programmieren wir das?",
  "Start of the script": "Start des Skripts",
  "The \"When the green flag is pressed\" command starts the script.": "Der Befehl \"Wenn die grüne Flagge angeklickt wird\" startet das Skript.",
  "Setting the costume": "Einstellen des Kostüms",
  "This command will help you to set a specific costume. We have two different costumes set.": "Dieser Befehl hilft Ihnen, ein bestimmtes Kostüm festzulegen. Wir haben zwei verschiedene Kostüme eingestellt.",
  "Expectation": "Erwartung",
  "The snake sees the dinosaur in a second instead of immediately. To prevent it from changing its costume ahead of time, we use the \"wait __ sec\" command": "Die Schlange sieht den Dinosaurier erst nach einer Sekunde statt sofort. Um zu verhindern, dass sie ihr Kostüm zu früh wechselt, verwenden wir den Befehl \"warte __ Sek\".",
  "The \"Heart\" project": "Das \"Herz\"-Projekt",
  "Take a look at the example. The heart changes costume 4 times. Each costume is visible for 1 second. Can you do the same?": "Schauen Sie sich das Beispiel an. Das Herz wechselt viermal das Kostüm. Jedes Kostüm ist für 1 Sekunde sichtbar. Können Sie das auch?",
  "Costume change": "Kostümwechsel",
  "The \"Next Costume\" command changes the costume that is set next in the list of costumes.": "Der Befehl \"Nächstes Kostüm\" ändert das nächste Kostüm in der Liste.",
  "Repeating actions": "Wiederholende Aktionen",
  "For the sprite to perform an action multiple times, you need to use the \"Repeat __ times\" command. In the window, you can set the number of repetitions.": "Damit die Figur eine Aktion mehrmals ausführt, müssen Sie den Befehl \"Wiederhole __ mal\" verwenden. Im Fenster können Sie die Anzahl der Wiederholungen festlegen.",
  "Oops! If we use the \"Next costume\" command multiple times in a row, the costumes will change too quickly and we will not see how they change: it will be like nothing is happening. To prevent commands from being executed almost simultaneously, we insert a \"pause.\" To do this, we need the \"Wait __ sec\" command.": "Ups! Wenn wir den Befehl \"Nächstes Kostüm\" mehrmals hintereinander verwenden, wechseln die Kostüme zu schnell, und wir sehen nicht, wie sie sich ändern – es sieht aus, als würde nichts passieren. Damit die Befehle nicht gleichzeitig ausgeführt werden, fügen wir eine \"Pause\" ein. Dafür brauchen wir den Befehl \"Warte __ Sek\".",
  "The bear walks": "Der Bär läuft",
  "Program a costume change so that it seems like the bear is constantly walking! See the example.": "Programmieren Sie einen Kostümwechsel, sodass es so aussieht, als würde der Bär ständig laufen! Sehen Sie sich das Beispiel an.",
  "Constant repetition": "Ständige Wiederholung",
  "To make an action repeat itself constantly, use the \"Repeat Always\" command.": "Damit eine Aktion ständig wiederholt wird, verwenden Sie den Befehl \"Wiederhole immer\".",
  "Smooth movements": "Sanfte Bewegungen",
  "You can make the movements smoother by setting a wait before each costume change. We can set the wait time. Try setting it for 0.1 seconds! This command is already ready — just put it in the right place.": "Sie können die Bewegungen sanfter gestalten, indem Sie eine Wartezeit vor jedem Kostümwechsel einfügen. Sie können die Wartezeit festlegen. Versuchen Sie, sie auf 0,1 Sekunden zu setzen! Dieser Befehl ist bereits fertig – setzen Sie ihn einfach an die richtige Stelle.",
  "Remember where the script starts?": "Erinnern Sie sich, wo das Skript beginnt?",
  "Create a clock!": "Erstellen Sie eine Uhr!",
  "Look, all the backgrounds you need are already there, you just need to change them every second.": "Schauen Sie, alle benötigten Hintergründe sind bereits da, Sie müssen sie nur jede Sekunde ändern.",
  "Set the first background": "Setzen Sie den ersten Hintergrund",
  "Let the clock hands start moving from 12.": "Lassen Sie die Zeiger der Uhr bei 12 starten.",
  "Change the background": "Hintergrund ändern",
  "Change the background using the \"Next Background\" command. Program the background to change every second.": "Ändern Sie den Hintergrund mit dem Befehl \"Nächster Hintergrund\". Programmieren Sie den Hintergrund so, dass er sich jede Sekunde ändert.",
  "Program the background change to repeat": "Programmieren Sie die Wiederholung des Hintergrundwechsels",
  "If you accidentally delete the script": "Wenn Sie das Skript versehentlich löschen",
  "Simultaneously press the \"CTRL\" and \"Z\" keys in the lower-left corner of the keyboard.": "Drücken Sie gleichzeitig die Tasten \"STRG\" und \"Z\" in der unteren linken Ecke der Tastatur.",

  "Super cat": "Super-Katze",
  "The super cat grows in size. Program the same!": "Die Super-Katze wächst. Programmieren Sie dasselbe!",
  "Smoothly resize the sprite using a loop": "Ändern Sie die Größe der Figur sanft mit einer Schleife.",
  "Use a loop to resize smoothly.": "Verwenden Sie eine Schleife, um die Größe sanft zu ändern.",
  "Set the size": "Größe festlegen",
  "Set the size you want at the beginning of the script.": "Legen Sie die gewünschte Größe zu Beginn des Skripts fest.",
  "Cat talks": "Die Katze spricht",
  "The cat should say \"I am super cat!\" before growing.": "Die Katze sollte \"Ich bin Super-Katze!\" sagen, bevor sie wächst.",
  "Sprite size": "Figurengröße",
  "Here you can find out what size the sprite is now and also manually change it.": "Hier können Sie sehen, welche Größe die Figur derzeit hat, und sie manuell ändern.",

  "Flashing star": "Blinkender Stern",
  "The star decreases slowly and increases slowly. And it does so constantly. Shall we program it?": "Der Stern verkleinert sich langsam und vergrößert sich langsam. Und das ständig. Wollen wir es programmieren?",
  "Starting size": "Startgröße",
  "Set the desired size at the beginning of the script.": "Legen Sie die gewünschte Größe zu Beginn des Skripts fest.",
  "Resize - increase": "Größe ändern - vergrößern",
  "Use this command to increase the size.": "Verwenden Sie diesen Befehl, um die Größe zu vergrößern.",
  "Resize - decrease": "Größe ändern - verkleinern",
  "You already know the command for how to resize a sprite. To reduce the size, just enter a number with a minus sign. For example, -5.": "Sie kennen bereits den Befehl zum Ändern der Größe einer Figur. Um die Größe zu reduzieren, geben Sie einfach eine Zahl mit einem Minuszeichen ein, z. B. -5.",
  "The star is steadily increasing and decreasing": "Der Stern vergrößert und verkleinert sich gleichmäßig",
  "Use two loops in a row.": "Verwenden Sie zwei Schleifen hintereinander.",
  "Before takeoff": "Vor dem Abheben",
  "Program the project from your workbook. You can use the ready-made plan, or you can use the one that you wrote yourself.": "Programmieren Sie das Projekt aus Ihrem Arbeitsbuch. Sie können den vorgefertigten Plan verwenden oder den, den Sie selbst geschrieben haben.",
  "Study the project plan in your workbook": "Studieren Sie den Projektplan in Ihrem Arbeitsbuch",
  "The sprites speak in turn. When they are silent and listening, the command \"Wait __ sec\" is used.": "Die Kobolde sprechen abwechselnd. Wenn sie schweigen und zuhören, wird der Befehl „Warte __ Sek.“ verwendet.",
  "Program Captain Kepler": "Programmieren Sie Captain Kepler",
  "Program the MarsBot": "Programmieren Sie den MarsBot",
  "Program the astro cadet": "Programmieren Sie den Astro-Kadetten",
  "Dinosaurs": "Dinosaurier",
  "The dinosaurs speak in turn, not at the same time! Put together a similar dialog in which one dinosaur responds to the other!": "Die Dinosaurier sprechen abwechselnd, nicht gleichzeitig! Stellen Sie einen ähnlichen Dialog zusammen, in dem ein Dinosaurier dem anderen antwortet!",
  "The dinosaurs take turns talking": "Die Dinosaurier sprechen abwechselnd",
  "The dinosaurs' lines do not appear at the same time — when one speaks, the other listens!": "Die Zeilen der Dinosaurier erscheinen nicht gleichzeitig – wenn einer spricht, hört der andere zu!",
  "Project plan": "Projektplan",
  "Near the castle": "In der Nähe des Schlosses",
  "Create a dialog from three phrases!": "Erstellen Sie einen Dialog aus drei Sätzen!",
  "The girls take turns talking": "Die Mädchen sprechen abwechselnd",
  "The girls don't interrupt each other!": "Die Mädchen unterbrechen sich nicht gegenseitig!",
  "About the planet": "Über den Planeten",
  "In this dialog, each astronaut replies twice!": "In diesem Dialog antwortet jeder Astronaut zweimal!",
  "The astronauts take turns talking": "Die Astronauten sprechen abwechselnd",
  "When one sprite speaks, the other listens and is silent.": "Wenn ein Kobold spricht, hört der andere zu und schweigt.",
  "Trying on a dress": "Ein Kleid anprobieren",
  "Look, the outfits change every two seconds and the Harper girl comments on each outfit!": "Schau, die Outfits wechseln alle zwei Sekunden und das Harper-Mädchen kommentiert jedes Outfit!",
  "The costumes change every two seconds": "Die Kostüme wechseln alle zwei Sekunden",
  "The girl comments on each outfit": "Das Mädchen kommentiert jedes Outfit",
  "Sorceress and broom": "Zauberin und Besen",
  "Another dialog, but now three characters are talking! Even the broom is talking!": "Noch ein Dialog, aber jetzt reden drei Charaktere! Sogar der Besen redet!",
  "The characters don't interrupt each other": "Die Charaktere unterbrechen sich nicht gegenseitig",
  "Each character talks for 2 seconds.": "Jeder Charakter redet 2 Sekunden.",
  "The rocket approaches and recedes": "Die Rakete nähert sich und entfernt sich",
  "Up arrow: the rocket is approaching. Down arrow: the rocket is receding.": "Pfeil nach oben: Die Rakete nähert sich. Pfeil nach unten: Die Rakete entfernt sich.",
  "Approaching": "Annäherung",
  "Pressing the up arrow changes the costume and increases the size.": "Durch Drücken des Pfeils nach oben wird das Kostüm geändert und die Größe vergrößert.",
  "Receding": "Entfernung",
  "Pressing the down arrow changes the costume and decreases the size. Think about how to do it.": "Durch Drücken des Pfeils nach unten wird das Kostüm geändert und die Größe verkleinert. Überlegen Sie, wie Sie das machen.",
  "Initial placement": "Anfangsplatzierung",
  "When you click on the green flag, the rocket is always the same size.": "Wenn Sie auf die grüne Flagge klicken, hat die Rakete immer die gleiche Größe.",
  "Stopping other scripts": "Andere Skripte stoppen",
  "If you first press the up arrow and move the rocket closer, and then click the down arrow, you must first stop the approaching, and then start the receding.": "Wenn Sie zuerst den Pfeil nach oben drücken und die Rakete näher heranbewegen und dann auf den Pfeil nach unten klicken, müssen Sie zuerst die Annäherung stoppen und dann die Entfernung starten.",
  "*Bonus task: the Earth approaching and receding": "*Bonusaufgabe: Die Erde nähert sich und entfernt sich",
  "When you press the up arrow, the Earth recedes, when you press the down arrow, it approaches.": "Wenn Sie den Pfeil nach oben drücken, entfernt sich die Erde, wenn Sie den Pfeil nach unten drücken, nähert sie sich.",
  "Hen": "Henne",
  "The hen walks, eats, or turns its head when the keys \"1\", \"2\", and \"3\" are pressed. These actions do not happen at the same time.": "Die Henne geht, isst oder dreht den Kopf, wenn die Tasten „1“, „2“ und „3“ gedrückt werden. Diese Aktionen finden nicht gleichzeitig statt.",
  "The hen walks when the \"1\" key is pressed": "Die Henne geht, wenn die Taste „1“ gedrückt wird.",
  "We need costumes to change for the hen to take steps. How many seconds do we need to use in the \"wait\" command for the actions to run smoothly? Use the \"forever\" command to keep the chicken going.": "Wir müssen uns umziehen, damit die Henne Schritte machen kann. Wie viele Sekunden müssen wir im „Warten“-Befehl verwenden, damit die Aktionen reibungslos ablaufen? Verwenden Sie den Befehl „für immer“, damit das Huhn weitermacht.",
  "The hen pecks the grains when the \"2\" key is pressed": "Die Henne pickt die Körner, wenn die Taste „2“ gedrückt wird.",
  "We need costumes to change for the hen to eat. Use the same number of seconds in the \"wait\" command for the actions to run smoothly. Use the \"forever\" command to keep the chicken pecking.": "Wir müssen uns umziehen, damit die Henne frisst. Verwenden Sie die gleiche Anzahl von Sekunden im „Warten“-Befehl, damit die Aktionen reibungslos ablaufen. Verwenden Sie den Befehl „für immer“, damit das Huhn weiterpickt.",
  "The hen looks when the \"3\" key is pressed": "Die Henne schaut, wenn die Taste „3“ gedrückt wird.",
  "We need costumes to change for the hen to turn its head. Here the “forever” command is also needed.": "Wir müssen uns umziehen, damit die Henne den Kopf dreht. Auch hier wird der Befehl „forever“ benötigt.",
  "At the start, the hen always returns to its original position.": "Zu Beginn kehrt das Huhn immer in seine Ausgangsposition zurück.",
  "When we start an action, we stop the others.": "Wenn wir eine Aktion starten, stoppen wir die anderen.",
  "Skeleton and ghost": "Skelett und Geist",
  "Fantasy characters are walking without our consent — let's stop them by pressing the space bar!": "Fantasy-Figuren laufen ohne unser Einverständnis – stoppen wir sie mit der Leertaste!",
  "The skeleton walks": "Das Skelett läuft",
  "When you click on the green flag, the skeleton is constantly walking. Please note that only three costumes are used for walking. Use the \"wait_sec\" command, so that the animation is visible.": "Wenn du auf die grüne Flagge klickst, läuft das Skelett ständig. Beachte, dass nur drei Kostüme zum Laufen verwendet werden. Verwende den Befehl „wait_sec“, damit die Animation sichtbar wird.",
  "The ghost": "Der Geist",
  "When you click on the green flag, the ghost changes costumes. Use the \"wait_sec\" command, so that the animation is visible.": "Wenn du auf die grüne Flagge klickst, wechselt der Geist das Kostüm. Verwende den Befehl „wait_sec“, damit die Animation sichtbar wird.",
  "Stop the whole project": "Das ganze Projekt stoppen",
  "All the scripts stop when you press the space bar. The Stop All command immediately stops all scripts for both the skeleton and the ghost.": "Alle Skripte werden gestoppt, wenn du die Leertaste drückst. Der Befehl „Alle stoppen“ stoppt sofort alle Skripte sowohl für das Skelett als auch für den Geist.",
  "Stars": "Sterne",
  "Wow! So many stars — and each one can twinkle and change costumes and size! Press the keys 1,2,3.": "Wow! So viele Sterne – und jeder einzelne kann funkeln und Kostüm und Größe ändern! Drücken Sie die Tasten 1,2,3.",
  "Press the keys 1,2,3.": "Drücke die Tasten 1,2,3.",
  "The star gradually gets bigger and smaller when the \"1\" key is pressed": "Der Stern wird allmählich größer und kleiner, wenn die Taste „1“ gedrückt wird",
  "Verwenden Sie zwei Schleifen hintereinander.": "Verwenden Sie zwei Schleifen hintereinander.",
  "The star twinkles when the \"2\" key is pressed": "Der Stern funkelt, wenn die Taste „2“ gedrückt wird",
  "The star appears, lingers for a while, disappears, and then it waits a little more before reappearing. Remember to use the repeat forever command.": "Der Stern erscheint, verweilt eine Weile, verschwindet und wartet dann noch ein wenig, bevor er wieder erscheint. Denken Sie daran, den Befehl „Endlos wiederholen“ zu verwenden.",
  "The star changes color when the \"3\" key is pressed": "Der Stern ändert seine Farbe, wenn die Taste „3“ gedrückt wird",
  "Constantly switching multicolored costumes.": "Ständig wechselnde mehrfarbige Kostüme.",
  "Three parameters change here. Think about which ones and set them for the initial placement.": "Hier ändern sich drei Parameter. Überlegen Sie, welche, und legen Sie diese für die anfängliche Platzierung fest.",
  "Duplicate the sprite": "Duplizieren Sie das Sprite",
  "Create 2 more stars. Right-click on it to duplicate it.": "Erstellen Sie 2 weitere Sterne. Klicken Sie mit der rechten Maustaste darauf, um es zu duplizieren.",
  "Personal website": "Persönliche Website",
  "Tell about your hobbies.": "Erzählen Sie von Ihren Hobbys.",
  "Add 2-3 sprites and a background": "Fügen Sie 2-3 Sprites und einen Hintergrund hinzu",
  "Add or draw 2-3 sprites that show your hobbies! Think about who will talk about them. Perhaps you will have a \"presenter\" or the items will tell about themselves.": "Fügen Sie 2-3 Sprites hinzu oder zeichnen Sie sie, die Ihre Hobbys zeigen! Überlegen Sie, wer darüber sprechen wird. Vielleicht haben Sie einen „Moderator“ oder die Elemente werden von sich selbst erzählen.",
  "Planning": "Planung",
  "What will your personal website be like? Did you come up with anything? Use the pages in your notebook to draw your plan!": "Wie wird Ihre persönliche Website aussehen? Haben Sie sich etwas ausgedacht? Verwenden Sie die Seiten in Ihrem Notizbuch, um Ihren Plan zu zeichnen!",
  "Use all the events": "Verwenden Sie alle Ereignisse:",
  "\"When the green flag is clicked,\" \"when the key is pressed,\" and \"when the sprite is clicked.\"": "„Wenn auf die grüne Flagge geklickt wird“, „Wenn die Taste gedrückt wird“ und „Wenn auf die Figur geklickt wird“.",
  "Create!": "Erstellen!",
  "The most important part is left — programming!": "Der wichtigste Teil bleibt noch – das Programmieren!",
  "Teleport": "Teleportieren",
  "Program the rocket to move between two points when you press the up arrow and down arrow keys!": "Programmieren Sie die Rakete so, dass sie sich zwischen zwei Punkten bewegt, wenn Sie die Pfeiltasten nach oben und unten drücken!",
  "Event 1": "Ereignis 1",
  "When you press the up arrow key, the rocket changes position.": "Wenn Sie die Pfeiltaste nach oben drücken, ändert die Rakete ihre Position.",
  "Motion 1": "Bewegung 1",
  "This command sets the position of the sprite on the stage using coordinates. 1. Place the sprite in a certain place, and the command \"Go to x: __ y: __\" will contain the coordinate values corresponding to that position. 2. Drag the \"Go to x: __ y: __\" block from the command palette.": "Dieser Befehl legt die Position des Sprites auf der Bühne mithilfe von Koordinaten fest. 1. Platzieren Sie das Sprite an einer bestimmten Stelle, und der Befehl „Gehe zu x:__y:__“ enthält die Koordinatenwerte, die dieser Position entsprechen. 2. Ziehen Sie den Block „Gehe zu x:__y:__“ aus der Befehlspalette.",  "Event 2": "Ereignis 2",
  "When you press the down arrow key, the rocket again changes position.": "Wenn Sie die Pfeiltaste nach unten drücken, ändert die Rakete erneut ihre Position.",
  "Motion 2": "Bewegung 2",
  "Move the sprite to a different position, and then new values will appear in the \"go to x: __ y: __\" command.": "Bewegen Sie das Sprite an eine andere Position, und dann erscheinen neue Werte im Befehl „Gehe zu x:__y:__“.",
  "Star": "Stern",
  "The star appears randomly in multiple places.": "Der Stern erscheint zufällig an mehreren Stellen.",
  "Motion": "Bewegung",
  "Move the star anywhere and use the command \"Go to X __ Y __\", and do it 4 times. Use different coordinates for the command \"Go to X __ Y __\"": "Bewegen Sie den Stern an eine beliebige Stelle, und verwenden Sie den Befehl „Gehe zu X__y__“, und wiederholen Sie dies 4 Mal. Verwende verschiedene Koordinaten für den Befehl „Gehe zu X __ Y __“",  "Delay": "Verzögerung",
  "Use the command \"wait __ sec\" between position changes, so that they become visible!": "Verwende den Befehl „warte __ Sek.“ zwischen Positionsänderungen, damit diese sichtbar werden!",
  "Moon": "Mond",
  "Did you notice that the moon moves across the sky? Let's program it!": "Ist dir aufgefallen, dass der Mond sich über den Himmel bewegt? Lass es uns programmieren!",
  "Change the position of the moon 3 times. You already know how to set a position. Do it yourself!": "Ändere die Position des Mondes 3 Mal. Du weißt bereits, wie man eine Position einstellt. Mach es selbst!",
  "Don't forget to use the command \"wait __ sec\" between movements.": "Vergiss nicht, den Befehl „warte __ Sek.“ zwischen den Bewegungen zu verwenden.",
  "Crab": "Krabbe",
  "This crab moves sideways! Look, only the X coordinate changes.": "Diese Krabbe bewegt sich seitwärts! Schau, nur die X-Koordinate ändert sich.",
  "The \"set x to __\" command": "Der Befehl „setze x auf __“",
  "We can only change one coordinate. The X coordinate changes the position of the sprite left-right. Change the position of the crab 5 times.": "Wir können nur eine Koordinate ändern. Die X-Koordinate ändert die Position des Sprites von links nach rechts. Ändere die Position des Krabbens 5 Mal.",
  "Use a delay.": "Verwende eine Verzögerung.",
  "Thermometer": "Thermometer",
  "Move the red marker up and down by changing the Y coordinate.": "Bewege den roten Marker nach oben und unten, indem du die Y-Koordinate änderst.",
  "Hot!": "Heiß!",
  "This command moves the sprites up and down by changing the Y coordinate. Set the red marker, so that the thermometer shows a high temperature.": "Dieser Befehl bewegt die Sprites nach oben und unten, indem er die Y-Koordinate ändert. Setze den roten Marker, damit das Thermometer eine hohe Temperatur anzeigt.",  "Let's have the thermometer report the temperature.": "Lassen wir das Thermometer die Temperatur melden.",
  "Let's have the thermometer report the temperature. Instead of the command to wait, use the command to say \"Hot!\"": "Lassen wir das Thermometer die Temperatur anzeigen. Anstelle des Befehls zum Warten verwenden wir den Befehl „Heiß!“",
  "Warm": "Warm",
  "Set the red marker, so that the thermometer reads a little over 20 degrees. Don't forget that our thermometer notifies about the temperature.": "Setzen Sie die rote Markierung so, dass das Thermometer etwas über 20 Grad anzeigt. Vergessen Sie nicht, dass unser Thermometer die Temperatur meldet.",
  "Cool": "Kühl",
  "Set the red marker, so that the thermometer reads just under 10 degrees. Don't forget that our thermometer notifies about the temperature, and at this temperature, it is \"Cool!\"": "Setzen Sie die rote Markierung so, dass das Thermometer knapp 10 Grad anzeigt. Vergessen Sie nicht, dass unser Thermometer die Temperatur meldet, und bei dieser Temperatur ist es „Kühl!“",
  "Cold": "Kalt",
  "Set the red marker, so that the thermometer reads about -10 degrees. Don't forget that our thermometer notifies about the temperature.": "Setzen Sie die rote Markierung so, dass das Thermometer etwa -10 Grad anzeigt. Vergessen Sie nicht, dass unser Thermometer die Temperatur meldet",
  "Freezing": "Gefrierend",
  "Set the red marker, so that the thermometer reads about -30 degrees. Don't forget that our thermometer notifies about the temperature.": "Setzen Sie die rote Markierung so, dass das Thermometer etwa -30 Grad anzeigt. Vergessen Sie nicht, dass unser Thermometer die Temperatur meldet",
  "Traffic light": "Ampel",
  "Cover the not-working colors with a gray circle and move it to the right place! Press the keys 1,2,3": "Decken Sie die nicht funktionierenden Farben mit einem grauen Kreis ab und verschieben Sie ihn an die richtige Stelle! Drücken Sie die Tasten 1,2,3",
  "Red light": "Rotes Licht",
  "When you press the number \"1,\" the red light is on. One gray circle should cover the green, and the other should cover the yellow.": "Wenn Sie die Zahl „1“ drücken, leuchtet das rote Licht. Ein grauer Kreis sollte das Grüne abdecken, und der andere das Gelbe.",
  "Yellow light": "Gelbes Licht",
  "When you press the number \"2,\" the yellow light is on. One gray circle should cover the green, and the other should cover the red.": "Wenn Sie die Zahl „2“ drücken, leuchtet das gelbe Licht. Ein grauer Kreis sollte das Grüne abdecken, und der andere das Rote.",
  "Green light": "Grünes Licht",
  "When you press the number \"3,\" the green light is on. One gray circle should cover the red, and the second one should cover the yellow.": "Wenn Sie die Zahl „3“ drücken, leuchtet das grüne Licht. Ein grauer Kreis sollte das Rote abdecken, und der zweite das Gelbe.",
  "Sun": "Sonne",
  "Watch how smoothly the sun moves across the sky!": "Beobachten Sie, wie sanft sich die Sonne über den Himmel bewegt!",
  "The sun glides to multiple points": "Die Sonne gleitet zu mehreren Punkten",
  "The sun changes costumes": "Die Sonne wechselt das Kostüm",
  "Anfangsplatzierung": "Anfangsplatzierung",
  "Cat": "Katze",
  "Program the cat so that it turns to each of the goodies one after another.": "Programmieren Sie die Katze so, dass sie sich nacheinander den Leckereien zuwendet.",
  "Turn up": "Nach oben drehen",
  "To make the cat turn towards the mouse, use the direction equal to 0.": "Damit sich die Katze zur Maus dreht, verwende die Richtung gleich 0.",
  "Turn right": "Nach rechts drehen",
  "To make the cat turn towards the milk, use the direction equal to 90.": "Damit sich die Katze zur Milch dreht, verwende die Richtung gleich 90.",
  "Turn down": "Nach unten drehen",
  "To make the cat turn towards the can of food, use the direction equal to 90.": "Damit sich die Katze zur Futterdose dreht, verwende die Richtung gleich 90.",
  "What does the cat say between direction changes?": "Was sagt die Katze zwischen den Richtungswechseln?",
  "Come up with it yourself!": "Denk es dir selbst aus!",
  "Sprite direction": "Sprite-Richtung",
  "The direction the sprite is facing can be seen in the sprite properties.": "Die Richtung, in die das Sprite blickt, ist in den Sprite-Eigenschaften zu sehen.",
  "Direction values": "Richtungswerte",
  "By clicking on the window with the direction, it can be forcibly changed without using commands.": "Durch Klicken auf das Fenster mit der Richtung kann diese zwangsweise geändert werden, ohne Befehle zu verwenden.",
  "Mouse": "Maus",
  "Program the mouse so that it runs around the stage but does not run off of it!": "Programmiere die Maus so, dass sie um die Bühne läuft, aber nicht von ihr wegläuft!",
  "Endless movement: the mouse tries to run away": "Endlose Bewegung: Die Maus versucht wegzulaufen",
  "The \"go __ steps\" command moves the sprite a few steps in the direction it is currently looking in. Now just make it so that it always repeats itself!": "Der Befehl „gehe __ Schritte“ bewegt das Sprite einige Schritte in die Richtung, in die es gerade blickt. Jetzt mach es einfach so, dass es sich immer wiederholt!",
  "The mouse does not run away": "Die Maus läuft nicht weg",
  "The command \"if on edge, bounce\" does not allow the mouse to go off the stage.": "Der Befehl „wenn auf der Kante, hüpfe“ lässt die Maus nicht von der Bühne weglaufen.",
  "Set the position that the mouse occupies at the start, as well as the direction it is pointed in at the beginning!": "Legen Sie die Position fest, die die Maus zu Beginn einnimmt, sowie die Richtung, in die sie zu Beginn zeigt!",
  "MarsBot on Mars": "MarsBot auf dem Mars",
  "Program the MarsBot to walk left and right and not bump into mountains!": "Programmieren Sie den MarsBot so, dass er nach links und rechts geht und nicht gegen Berge stößt!",
  "Initial placement of the MarsBot": "Anfangsplatzierung des MarsBots",
  "Don't forget about placement: you need to set the position of the MarsBot and the direction it is looking in.": "Vergessen Sie die Platzierung nicht: Sie müssen die Position des MarsBots und die Richtung festlegen, in die er blickt.",
  "The MarsBot goes from one mountain to another": "Der MarsBot geht von einem Berg zum anderen",
  "Use motion, wait, and loop commands to program the movement of the sprite.": "Verwenden Sie die Befehle „Bewegung“, „Warte“ und „Schleife“, um die Bewegung des Sprites zu programmieren.",
  "The MarsBot turns around": "Der MarsBot dreht sich um",
  "But how to turn around without pushing off of the edge? Use the already familiar \"point in direction __\" command. And don't forget about rotation style!": "Aber wie dreht man sich um, ohne sich von der Kante abzustoßen? Verwenden Sie den bereits bekannten Befehl „In Richtung __ zeigen“. Und vergessen Sie den Rotationsstil nicht!",
  "The MarsBot returns to the starting point": "Der MarsBot kehrt zum Ausgangspunkt zurück",
  "Penguin": "Pinguin",
  "Program the Penguin's walk!": "Programmieren Sie den Gang des Pinguins!",
  "Initial placement of the penguin": "Anfangsplatzierung des Pinguins",
  "Set the initial placement of the penguin so that the project always starts the same way.": "Legen Sie die Anfangsplatzierung des Pinguins fest, damit das Projekt immer auf die gleiche Weise beginnt.",
  "The penguin walks": "Der Pinguin geht",
  "Use motion, wait, and loop commands to program the sprite to walk!": "Verwenden Sie die Befehle „Bewegung“, „Warte“ und „Schleife“, um das Gehen des Sprites zu programmieren!",
  "The penguin turns": "Der Pinguin dreht sich",
  "How to turn around without pushing off of the edge? Use the already familiar \"point in direction __\" command. And don't forget about rotation style!": "Wie kann man sich umdrehen, ohne sich von der Kante abzustoßen? Verwenden Sie den bereits bekannten Befehl „in Richtung __ zeigen“. Und vergessen Sie den Rotationsstil nicht!",
  "The penguin change costumes": "Der Pinguin wechselt das Kostüm",
  "Make the penguin change costumes while walking.": "Lassen Sie den Pinguin beim Gehen das Kostüm wechseln.",
  "Bug": "Käfer",
  "The bug should reach the ladybug by moving along the branches of the tree!": "Der Käfer sollte den Marienkäfer erreichen, indem er sich entlang der Äste des Baumes bewegt!",
  "Initial placement of the bug": "Erste Platzierung des Käfers",
  "The initial placement is already complete, but you can add size settings, a phrase, or whatever you like!": "Die erste Platzierung ist bereits abgeschlossen, aber Sie können Größeneinstellungen, einen Satz oder was auch immer Sie möchten hinzufügen!",
  "The bug moves": "Der Käfer bewegt sich",
  "The bug turns in a certain direction, takes a few steps, and then turns again, and takes a few more steps. Experiment and guide the bug to the ladybug!": "Der Käfer dreht sich in eine bestimmte Richtung, macht ein paar Schritte, dreht sich dann wieder um und macht noch ein paar Schritte. Experimentieren Sie und führen Sie den Käfer zum Marienkäfer!",
  "Mouse in the maze": "Maus im Labyrinth",
  "The mouse has to get to the red button in the maze.": "Die Maus muss zum roten Knopf im Labyrinth gelangen.",
  "Do the initial placement. Some of the commands are already there!": "Führen Sie die erste Platzierung durch. Einige der Befehle sind bereits vorhanden!",
  "Mouse sprite movement starts": "Die Bewegung des Maus-Sprites beginnt",
  "Make it so that clicking the green flag triggers mouse movement.": "Machen Sie es so, dass das Klicken auf die grüne Flagge die Mausbewegung auslöst.",
  "The mouse runs to the red button": "Die Maus läuft zum roten Knopf",
  "Use this construction to bypass the walls of the labyrinth.": "Verwenden Sie diese Konstruktion, um die Wände des Labyrinths zu umgehen.",
  "Open the door": "Öffne die Tür",
  "Help the robots meet! Program the door to open when you press the space bar!": "Hilf den Robotern sich zu treffen! Programmiere die Tür so, dass sie sich öffnet, wenn du die Leertaste drückst!",
  "Anfangsplatzierung": "Anfangsplatzierung",
  "The door must always be closed at startup. Use the Point in direction __ command to set the position of the door.": "Die Tür muss beim Start immer geschlossen sein. Verwende den Befehl 'Richte dich in Richtung __ aus', um die Position der Tür festzulegen.",
  "The door turns": "Die Tür dreht sich",
  "The door opens when you press the space bar. The \"Rotate clockwise __ degrees\" command will rotate the door relative to itself. Let's put it inside a loop so that it does it multiple times.": "Die Tür öffnet sich, wenn du die Leertaste drückst.\nDer Befehl \"Drehe um __ Grad im Uhrzeigersinn\" dreht die Tür relativ zu sich selbst. Setzen wir es in eine Schleife, damit es mehrmals geschieht.",
  "The knight": "Der Ritter",
  "The knight is on duty and guarding the tower! Program it to walk around the tower from all sides.": "Der Ritter ist im Dienst und bewacht den Turm! Programmiere ihn so, dass er den Turm von allen Seiten umrundet.",
  "The knight starts moving from the lower-left corner and looks to the right.": "Der Ritter startet in der unteren linken Ecke und blickt nach rechts.",
  "The knight walks around one side of the tower": "Der Ritter umrundet eine Seite des Turms",
  "To get around one side of the tower, the knight takes 10 steps 25 times.": "Um eine Seite des Turms zu umrunden, macht der Ritter 25-mal 10 Schritte.",
  "The knight turns": "Der Ritter dreht sich",
  "Each time after going around a wall, the knight turns 90 degrees. Note: counterclockwise turn.": "Jedes Mal, nachdem er eine Mauer umrundet hat, dreht sich der Ritter um 90 Grad. Hinweis: gegen den Uhrzeigersinn.",
  "Loop": "Schleife",
  "To get around the 4 walls, the knight needs to repeat the walk and turn 4 times.": "Um die vier Wände zu umrunden, muss der Ritter das Gehen und Drehen viermal wiederholen.",
  "Egg": "Ei",
  "Crack the egg! To do that, program a 90° rotation.": "Zerbrich das Ei! Programmiere dafür eine Drehung um 90°.",
  "At startup, the egg is at a certain point, turned in a certain direction, and not broken.": "Beim Start befindet sich das Ei an einem bestimmten Punkt, ist in eine bestimmte Richtung gedreht und nicht zerbrochen.",
  "Verzögerung": "Verzögerung",
  "If the position changes are instantaneous, we will not see the difference. Let's add a 1-second delay to see the animation.": "Wenn sich die Positionen sofort ändern, sehen wir keinen Unterschied. Fügen wir eine Verzögerung von 1 Sekunde hinzu, um die Animation sichtbar zu machen.",
  "The egg turns": "Das Ei dreht sich",
  "Use the \"turn 90 degrees\" command. Note that the egg will turn to the left.": "Verwende den Befehl \"Drehe um 90 Grad\".\nBeachte, dass sich das Ei nach links dreht.",
  "The egg moves to the left": "Das Ei bewegt sich nach links",
  "To visually drop the egg on its side, but so that it doesn't move, you need to change the coordinate. What coordinate should change if the egg moves to the left?": "Um das Ei optisch auf die Seite fallen zu lassen, ohne dass es sich bewegt, musst du die Koordinate ändern.\nWelche Koordinate muss sich ändern, wenn das Ei nach links bewegt wird?",
  "The egg is cracked": "Das Ei ist zerbrochen",
  "Select the appropriate costume": "Wähle das passende Kostüm aus",
  "The ball is spinning!": "Der Ball dreht sich!",
  "The ball sprite is spinning like a real one! Program it.": "Das Ball-Sprite dreht sich wie ein echtes! Programmiere es.",
  "Repeating turns": "Wiederholte Drehungen",
  "The ball sprite must rotate around its axis. Use the commands \"repeat __ times\", \"turn ___\".": "Das Ball-Sprite muss sich um seine Achse drehen.\nVerwende die Befehle \"Wiederhole __ mal\", \"Drehe um ___\".",
  "*Bonus: change the speed": "*Bonus: Ändere die Geschwindigkeit",
  "Think about how to change the rotation speed.": "Überlege, wie du die Drehgeschwindigkeit ändern kannst.",
  "Butterfly": "Schmetterling",
  "The butterfly flies around the flower. Program it!": "Der Schmetterling fliegt um die Blume. Programmiere es!",
  "Rotation": "Drehung",
  "First, program the rotation of the butterfly — just like the ball in the previous task!": "Programmiere zuerst die Drehung des Schmetterlings – genau wie beim Ball in der vorherigen Aufgabe!",
  "Circular movement": "Kreisbewegung",
  "To make a circle, add the command \"move __ steps\" to the loop. Then, after each small turn, the butterfly will move to the side, and then again make a turn and step: that is rotation!": "Um einen Kreis zu machen, füge den Befehl \"Gehe __ Schritte\" zur Schleife hinzu. Nach jeder kleinen Drehung bewegt sich der Schmetterling zur Seite, dann dreht er sich wieder und macht einen Schritt: Das ist Drehung!",
  "Clock": "Uhr",
  "This clock will be just like a real one after you program it.": "Diese Uhr wird wie eine echte sein, wenn du sie programmierst.",
  "At startup, the time is exactly 12:00!": "Beim Start ist die Zeit genau 12:00!",
  "Movement of the second hand": "Bewegung des Sekundenzeigers",
  "Does the arrow move clockwise or counterclockwise? The whole circle is 360 degrees. 60 seconds in one circle. 360 divided by 60 = 6. The second hand rotates 6 degrees every second.": "Bewegt sich der Zeiger im oder gegen den Uhrzeigersinn?\nEin ganzer Kreis hat 360 Grad. 60 Sekunden für einen Kreis. 360 geteilt durch 60 = 6.\nDer Sekundenzeiger dreht sich jede Sekunde um 6 Grad.",
  "Movement of the minute hand": "Bewegung des Minutenzeigers",
  "Have you noticed that the minute hand moves less often and a shorter distance than the second hand? Let's move it one degree at a time. The minute hand moves 6 degrees in 60 seconds. 60 seconds divided by 6 degrees is 10 seconds — after that, the minute hand will move 1 degree.": "Hast du bemerkt, dass sich der Minutenzeiger seltener und weniger weit bewegt als der Sekundenzeiger? Lassen wir ihn jeweils um 1 Grad bewegen. Der Minutenzeiger bewegt sich in 60 Sekunden um 6 Grad. 60 Sekunden geteilt durch 6 Grad ergibt 10 Sekunden – danach bewegt sich der Minutenzeiger um 1 Grad.",
  "Sprite center": "Sprite-Zentrum",
  "Notice the small gray circle on the cloth of the sprite's costume. This is the center of the sprite around which it rotates.": "Beachte den kleinen grauen Kreis auf dem Kostüm des Sprites. Dies ist das Zentrum des Sprites, um das es sich dreht.",
  "Meeting on Mars": "Treffen auf dem Mars",
  "Watch a fragment of the animation: what should we do with what we found?": "Sieh dir einen Ausschnitt der Animation an: Was sollen wir mit dem tun, was wir gefunden haben?",
  "The \"On Mars\" scene is already prepared": "Die Szene \"Auf dem Mars\" ist bereits vorbereitet",
  "Part of the code is already ready. Study it; it does the initial placement and the first scene.": "Ein Teil des Codes ist bereits fertig. Studiere ihn; er macht die Anfangsplatzierung und die erste Szene.",
  "Program the \"On the base\" scene": "Programmiere die Szene \"Auf der Basis\"",
  "Program the second scene using the prepared plan in your workbook.": "Programmiere die zweite Szene anhand des vorbereiteten Plans in deinem Arbeitsheft.",
  "Create your own scene": "Erstelle deine eigene Szene",
  "Come up with a continuation and program it! It can be inserted before the \"On Mars\" scene, or after it!": "Denke dir eine Fortsetzung aus und programmiere sie! Sie kann vor oder nach der Szene \"Auf dem Mars\" eingefügt werden!",
  "Animation": "Animation",
  "Come up with a story and tell it!": "Denke dir eine Geschichte aus und erzähle sie!",
  "Planung": "Planung",
  "Use the pages in your workbook to sketch an outline of your animation. Pay special attention to how the scene switching will be arranged!": "Nutze die Seiten in deinem Arbeitsheft, um eine Skizze deiner Animation zu erstellen. Achte besonders darauf, wie der Szenenwechsel gestaltet wird!",
  "Add 2-3 sprites and 2-3 backgrounds.": "Füge 2-3 Figuren und 2-3 Hintergründe hinzu.",
  "Add or draw 2-3 sprites that you need for your animation! - Think about what will happen in the first scene of the animation? - And the second? - What are the sprites and backgrounds like?": "Füge 2-3 Figuren hinzu oder zeichne sie, die du für deine Animation brauchst!\n-Überlege dir, was in der ersten Szene der Animation passiert?\n-Und in der zweiten?\n-Wie sehen die Figuren und Hintergründe aus?",
  "Erstellen!": "Erstellen!",
  "The most important part is left — program!": "Der wichtigste Teil bleibt — programmieren!",
  "Colored ball": "Farbiger Ball",
  "The ball moves freely around the stage. Each time it touches the edge, it changes color and direction!": "Der Ball bewegt sich frei über die Bühne. Jedes Mal, wenn er den Rand berührt, ändert er seine Farbe und Richtung!",
  "Program the ball sprite to move constantly": "Programmiere die Ball-Figur so, dass sie sich ständig bewegt",
  "Complete this task using the familiar \"move _ steps\" and \"repeat forever\" commands.": "Erfülle diese Aufgabe mit den bekannten Befehlen \"_ Schritte bewegen\" und \"für immer wiederholen\".",
  "Program the ball so that it does not fly out of bounds": "Programmiere den Ball so, dass er nicht aus dem Spielfeld fliegt",
  "To complete this task, you need the command \"if on edge, bounce,\" which also checks the condition! And it contains a mathematical formula for calculating the angle at which the ball turns. But where do we put this command so that it always works?": "Um diese Aufgabe zu erfüllen, braucht man den Befehl „if on edge, bounce“, der ebenfalls die Bedingung überprüft! Und der eine mathematische Formel zur Berechnung des Winkels enthält, um den sich der Ball dreht. \n\nAber wo platzieren wir diesen Befehl, damit er immer funktioniert?",
  "Program the condition \"if the ball touches the edge, it changes color\"": "Programmiere die Bedingung \"Wenn der Ball den Rand berührt, ändert er die Farbe\"",
  "But we do not have this ready-made command. We need to program a check for the condition \"if it touches the edge, it changes color.\" You can change the color by changing the costume!": "Aber wir haben diesen Befehl nicht fertig. Wir müssen eine Bedingungsprüfung programmieren: \"Wenn er den Rand berührt, ändert er die Farbe.\" Du kannst die Farbe ändern, indem du das Kostüm wechselst!",
  "Anfangsplatzierung": "Anfangsplatzierung",
  "Set the initial size, costume, and position of the sprite Ball!": "Setze die Anfangsgröße, das Kostüm und die Position der Ball-Figur!",
  "Beetle on a tree": "Käfer auf einem Baum",
  "Let's program it: the sprite Beetle moves up the tree!": "Programmieren wir es: Die Käfer-Figur bewegt sich den Baum hinauf!",
  "Upward movement": "Aufwärtsbewegung",
  "To move the Beetle sprite up, use the \"change y by __\" command.": "Um die Käfer-Figur nach oben zu bewegen, benutze den Befehl \"y um __ ändern\".",
  "Having reached the top of the trunk, the Beetle sprite starts moving from the beginning.": "Sobald er die Spitze des Stammes erreicht hat, beginnt die Käfer-Figur von vorne.",
  "Use the command \"go to x: __ y: __\" to return the Beetle sprite to the beginning of its journey.": "Benutze den Befehl \"gehe zu x: __ y: __\", um die Käfer-Figur zum Anfang ihrer Reise zurückzubringen.",
  "Set the direction and size of the Beetle sprite at the very beginning.": "Setze die Richtung und Größe der Käfer-Figur ganz am Anfang.",
  "Dog in the maze": "Hund im Labyrinth",
  "Collect the crystals!": "Sammle die Kristalle!",
  "Create a project plan": "Erstelle einen Projektplan",
  "Plan the project using a notebook. Make notes to help you program your project correctly!": "Plane das Projekt mit einem Notizbuch. Mache Notizen, um dein Projekt richtig zu programmieren!",
  "Controlling the Dog sprite": "Steuerung der Hund-Figur",
  "Touching obstacles": "Berührung von Hindernissen",
  "There are two obstacles in this project — the walls of the maze and the lightning.": "Es gibt zwei Hindernisse in diesem Projekt – die Wände des Labyrinths und den Blitz.",
  "Level 1": "Level 1",
  "Program the initial placement for level 1.": "Programmiere die Anfangsplatzierung für Level 1.",
  "Level 2": "Level 2",
  "Program the initial placement for level 2.": "Programmiere die Anfangsplatzierung für Level 2.",
  "Touching the target": "Berührung des Ziels",
  "We have two targets: two different crystals. One of the crystals takes us to the next level, and the other one creates the \"Victory\" event.": "Wir haben zwei Ziele: zwei verschiedene Kristalle. Einer der Kristalle bringt uns zum nächsten Level, der andere löst das Ereignis \"Sieg\" aus.",
  "Game": "Spiel",
  "Create your own game with a main character, prize, obstacles or enemies, and program it!": "Erstelle dein eigenes Spiel mit einer Hauptfigur, einem Preis, Hindernissen oder Feinden und programmiere es!",
  "Draw a picture": "Ein Bild zeichnen",
  "The picture should start on a clean page. And only then does it change costumes when adding a drawing.": "Das Bild sollte auf einer leeren Seite beginnen. Und erst dann wechselt es das Kostüm, wenn eine Zeichnung hinzugefügt wird.",
  "Set the right costume at the beginning": "Das richtige Kostüm am Anfang festlegen",
  "So that the picture always starts on a clean page, after the start command, set the costume with a blank canvas.": "Damit das Bild immer auf einer leeren Seite beginnt, setzen Sie nach dem Startbefehl das Kostüm mit einer leeren Leinwand.",
  "Changing costumes every second": "Kostümwechsel jede Sekunde",
  "The first 4 costumes change every second, and it seems like a drawing appears on the canvas. Think about how to do it.": "Die ersten 4 Kostüme wechseln jede Sekunde, und es sieht so aus, als ob eine Zeichnung auf der Leinwand erscheint. Überlegen Sie, wie das geht.",
  "In what order do the costumes change?": "In welcher Reihenfolge wechseln die Kostüme?",
  "The costumes are changed in the order in which they appear in the list.": "Die Kostüme wechseln in der Reihenfolge, in der sie in der Liste erscheinen.",
  "Penguin coming from Antarctica": "Pinguin kommt aus der Antarktis",
  "The penguin is going on a journey! And it's beginning its journey from its native Antarctica.": "Der Pinguin geht auf eine Reise! Und er beginnt seine Reise in seiner Heimat, der Antarktis.",
  "The first background - \"Antarctica\"": "Der erste Hintergrund - \"Antarktis\"",
  "The penguin begins its journey from Antarctica — this particular background should be the first.": "Der Pinguin beginnt seine Reise in der Antarktis – dieser Hintergrund sollte der erste sein.",
  "Change of costume and background": "Kostüm- und Hintergrundwechsel",
  "While the \"Antarctica\" background is on, the penguin takes \"steps,\" meaning it changes its costume. After several costume changes, the background changes.": "Während der Hintergrund \"Antarktis\" aktiv ist, macht der Pinguin \"Schritte\", d. h. er wechselt sein Kostüm. Nach mehreren Kostümwechseln ändert sich der Hintergrund.",
  "In what order do the backgrounds change?": "In welcher Reihenfolge wechseln die Hintergründe?",
  "The backgrounds change in the order in which they appear in the list.": "Die Hintergründe wechseln in der Reihenfolge, in der sie in der Liste erscheinen.",
  "Disappearing potion": "Verschwindender Trank",
  "The sorceress appears, drinks the potion, and disappears.": "Die Zauberin erscheint, trinkt den Trank und verschwindet.",
  "Emerging": "Erscheinen",
  "The Show command makes the sprite visible.": "Der Befehl \"Zeigen\" macht die Figur sichtbar.",
  "The sorceress drinks the potion": "Die Zauberin trinkt den Trank",
  "Before disappearing, the sorceress says that she wants to drink the potion.": "Bevor sie verschwindet, sagt die Zauberin, dass sie den Trank trinken will.",
  "Disappearing": "Verschwinden",
  "The Hide command makes the sprite invisible.": "Der Befehl \"Verstecken\" macht die Figur unsichtbar.",
  "Is the sprite hidden?": "Ist die Figur versteckt?",
  "Here you can see if the sprite is hidden and manually hide or show it.": "Hier können Sie sehen, ob die Figur versteckt ist, und sie manuell ausblenden oder anzeigen.",
  "Sorceress and teacher": "Die Zauberin und der Lehrer",
  "The wizard shrank under the influence of the potion. But if you run the project again, the wizard returns to his normal size!": "Der Zauberer schrumpfte unter dem Einfluss des Tranks. Aber wenn du das Projekt erneut startest, kehrt der Zauberer zu seiner normalen Größe zurück!",
  "Drinking the potion": "Den Trank trinken",
  "Before shrinking, the wizard says he will drink the potion.": "Bevor er schrumpft, sagt der Zauberer, dass er den Trank trinken wird.",
  "Abrupt resizing": "Abrupte Größenänderung",
  "Use this command to abruptly resize something.": "Verwende diesen Befehl, um die Größe eines Objekts abrupt zu ändern.",
  "At the beginning, the wizard is his normal height again!": "Zu Beginn ist der Zauberer wieder in seiner normalen Größe!",
  "Set the desired size of the wizard at the beginning of the script": "Setze die gewünschte Größe des Zauberers am Anfang des Skripts fest.",
  "Figurengröße": "Figurengröße",
  "Hier können Sie sehen, welche Größe die Figur derzeit hat, und sie manuell ändern.": "Hier kannst du sehen, welche Größe die Figur derzeit hat, und sie manuell ändern.",
  "Balloon": "Ballon",
  "The balloon is large at first and is in a warm room. And then it's outside in the cold and becomes smaller.": "Der Ballon ist zunächst groß und befindet sich in einem warmen Raum. Dann geht er nach draußen in die Kälte und wird kleiner.",
  "Initial size": "Anfangsgröße",
  "Set the size at startup to 200%.": "Setze die Größe beim Start auf 200%.",
  "Smooth reduction in size": "Sanfte Verkleinerung",
  "To reduce the size, we need to specify a value with a minus sign: \"-10\".": "Um die Größe zu reduzieren, müssen wir einen Wert mit einem Minuszeichen angeben: \"-10\".",
  "Pterodactyl": "Flugsaurier",
  "It seems like the pterodactyl is flying right here! It is growing in size and flapping its wings. But in the beginning, it is still far away, small in size and with its wings spread.": "Es sieht so aus, als würde der Flugsaurier direkt hierher fliegen! Er wächst in der Größe und schlägt mit den Flügeln. Aber am Anfang ist er noch weit entfernt, klein und mit ausgebreiteten Flügeln.",
  "To make it seem like the pterodactyl is flying closer, we need to increase its size and change the costume. And we need to repeat that several times. Add a command that will repeat these steps.": "Damit es so aussieht, als würde der Flugsaurier näher kommen, müssen wir seine Größe erhöhen und das Kostüm ändern. Und das müssen wir mehrmals wiederholen. Füge einen Befehl hinzu, der diese Schritte wiederholt.",
  "Think about what properties change for the pterodactyl. They need to be set at startup.": "Überlege, welche Eigenschaften sich beim Flugsaurier ändern. Diese müssen beim Start festgelegt werden.",
  "Wizard and dog": "Zauberer und Hund",
  "Look, the wizard accidentally enlarged the dog and made himself invisible in order to hide from it!": "Sieh mal, der Zauberer hat den Hund versehentlich vergrößert und sich unsichtbar gemacht, um sich vor ihm zu verstecken!",
  "What the dog does": "Was der Hund macht",
  "The dog changes size smoothly. How do we do that?": "Der Hund ändert seine Größe sanft. Wie machen wir das?",
  "What the wizard does": "Was der Zauberer macht",
  "The wizard says two phrases, between each of which he is silent for 1 second. And then he disappears.": "Der Zauberer sagt zwei Sätze, zwischen denen er jeweils eine Sekunde lang schweigt. Und dann verschwindet er.",
  "What changes about the wizard?": "Was ändert sich beim Zauberer?",
  "The wizard becomes invisible. So you need to make it visible at startup.": "Der Zauberer wird unsichtbar. Du musst ihn also beim Start sichtbar machen.",
  "What changes about the dog?": "Was ändert sich beim Hund?",
  "The dog changes its size. But at startup it becomes normal again.": "Der Hund ändert seine Größe. Aber beim Start wird er wieder normal groß.",
  "Graphic editor — Fill": "Füllfunktion im Grafikeditor",
  "Change the color of the apple from red to green.": "Ändere die Farbe des Apfels von Rot zu Grün.",
  "Graphic editor — Reshape": "Umformen im Grafikeditor",
  "Change the shape of the flag according to the example.": "Verändere die Form der Flagge entsprechend dem Beispiel.",
  "Graphic editor — Character creation": "Charaktererstellung im Grafikeditor",
  "Using the Circle tool, draw 3 circles of different sizes as shown in the example.": "Zeichne mit dem Kreis-Werkzeug 3 Kreise unterschiedlicher Größe, wie im Beispiel gezeigt.",
  "Use the Rectangle and Reshape tools, draw the snowman's hat.": "Zeichne mit dem Rechteck- und Umformwerkzeug den Hut des Schneemanns.",
  "Use the Brush tool to add details.": "Nutze das Pinsel-Werkzeug, um Details hinzuzufügen.",
  "Graphic editor — Working with tools": "Arbeiten mit Werkzeugen im Grafikeditor",
  "Use the Circle tool to draw the middle of the flower.": "Verwende das Kreis-Werkzeug, um die Mitte der Blume zu zeichnen.",
  "Use the Circle and Reshape tools to draw a petal.": "Verwende das Kreis- und Umformwerkzeug, um ein Blütenblatt zu zeichnen.",
  "Use the Copy and Rotate functions to draw the right number of petals.": "Nutze die Kopieren- und Drehen-Funktion, um die richtige Anzahl an Blütenblättern zu erstellen.",
  "Graphic editor — Costume change": "Kostümwechsel im Grafikeditor",
  "Use the graphic tools to change the sprite's costume according to the example.": "Verwende die Grafikwerkzeuge, um das Kostüm der Figur entsprechend dem Beispiel zu ändern.",
  "Choosing an outfit": "Ein Outfit auswählen",
  "We can run commands from the keyboard too! Let's program a costume change by pressing the space bar.": "Wir können auch Befehle über die Tastatur ausführen! Programmieren wir einen Kostümwechsel durch Drücken der Leertaste.",
  "Startup script": "Startskript",
  "When you click on the green flag, the girl says which key to press.": "Wenn du auf die grüne Flagge klickst, sagt das Mädchen, welche Taste du drücken sollst.",
  "Pressing a key": "Eine Taste drücken",
  "When you press a key, the costume changes.": "Wenn du eine Taste drückst, ändert sich das Kostüm.",
  "Bell": "Glocke",
  "Here the bell rings if you click on it!": "Hier läutet die Glocke, wenn du darauf klickst!",
  "When you click on the green flag, the bell tells you what to do.": "Wenn du auf die grüne Flagge klickst, erklärt die Glocke, was zu tun ist.",
  "Clicking on the bell": "Auf die Glocke klicken",
  "When you click on the bell, it rings (it says the phrase \"Ding-dong\").": "Wenn du auf die Glocke klickst, läutet sie (sie sagt den Satz \"Ding-dong\").",
  "Balloons": "Luftballons",
  "If you click on a balloon, it disappears. If you click the green flag, the balloons reappear!": "Wenn du auf einen Luftballon klickst, verschwindet er. Wenn du auf die grüne Flagge klickst, erscheinen die Ballons wieder!",
  "A balloon appears": "Ein Ballon erscheint",
  "When you click on the green flag, a balloon appears and says what to do.": "Wenn du auf die grüne Flagge klickst, erscheint ein Ballon und erklärt, was zu tun ist.",
  "The balloon pops": "Der Ballon platzt",
  "When you click on a balloon, it pops (disappears).": "Wenn du auf einen Ballon klickst, platzt er (verschwindet).",
  "Duplicate the scripts for the blue and yellow balloons": "Dupliziere die Skripte für die blauen und gelben Ballons",
  "To duplicate the script for another balloon, transfer the script as shown!": "Um das Skript für einen anderen Ballon zu duplizieren, übertrage das Skript wie gezeigt!",
  "Seasons": "Jahreszeiten",
  "Press the buttons to change the background.": "Drücke die Tasten, um den Hintergrund zu ändern.",
  "Set a background for the blue button": "Setze einen Hintergrund für die blaue Taste",
  "When the sprite is clicked on, the background changes.": "Wenn auf die Figur geklickt wird, ändert sich der Hintergrund.",
  "Multiple buttons": "Mehrere Tasten",
  "All four buttons work the same way!": "Alle vier Tasten funktionieren auf die gleiche Weise!",
  "When you click on the green flag, the background changes to neutral.": "Wenn du auf die grüne Flagge klickst, wechselt der Hintergrund zu neutral.",
  "Musician": "Musiker",
  "If you press different keys, you can play the guitar!": "Wenn du verschiedene Tasten drückst, kannst du Gitarre spielen!",
  "Choose the key you want": "Wähle die gewünschte Taste aus",
  "You can program more than just pressing the space bar — choose the \"1\" key for that!": "Du kannst mehr als nur die Leertaste programmieren – wähle dafür die \"1\"-Taste!",
  "Choose the sound you want": "Wähle den gewünschten Klang aus",
  "Minimum 3 keys": "Mindestens 3 Tasten",
  "Program the keys \"1\", \"2\", and \"3,\" so that when you press on them, different sounds are played!": "Programmiere die Tasten \"1\", \"2\" und \"3\", sodass beim Drücken unterschiedliche Klänge abgespielt werden!",
  "The musician's script has already been made": "Das Skript des Musikers wurde bereits erstellt",
  "One script is already ready!": "Ein Skript ist bereits fertig!",
  "Dancers": "Tänzer",
  "Please note: the dancers first talk to each other, and they only start dancing when you press the space bar.": "Bitte beachten Sie: Die Tänzer sprechen zuerst miteinander und beginnen erst zu tanzen, wenn Sie die Leertaste drücken.",
  "Plan the dialog": "Den Dialog planen",
  "Write a dialog plan in your workbook so that you don't get confused!": "Schreiben Sie einen Dialogplan in Ihr Arbeitsheft, damit Sie nicht durcheinander kommen!",
  "Dancing": "Tanzen",
  "When you press the space bar, the dancers change their costumes at regular intervals.": "Wenn Sie die Leertaste drücken, wechseln die Tänzer in regelmäßigen Abständen ihre Kostüme.",
  "Music": "Musik",
  "After pressing the space bar, one of the dancers \"starts\" the music, and at the end stops it.": "Nach dem Drücken der Leertaste \"startet\" einer der Tänzer die Musik und stoppt sie am Ende.",
  "Clicker": "Klickspiel",
  "The aim of the game is to catch the balloon! Make a game like this and invite a friend to play it.": "Ziel des Spiels ist es, den Ballon zu fangen! Erstelle ein solches Spiel und lade einen Freund zum Spielen ein.",
  "The balloon moves across the screen": "Der Ballon bewegt sich über den Bildschirm",
  "At the start, the balloon moves across the screen.": "Zu Beginn bewegt sich der Ballon über den Bildschirm.",
  "When you click on the balloon, the background changes": "Wenn Sie auf den Ballon klicken, ändert sich der Hintergrund.",
  "Think about what properties of the balloon and the stage change during the game and set their initial values.": "Überlegen Sie, welche Eigenschaften des Ballons und der Bühne sich während des Spiels ändern, und setzen Sie deren Anfangswerte fest.",
  "Draw a square": "Zeichne ein Quadrat",
  "Watch the demo video and repeat the steps": "Sieh dir das Demovideo an und wiederhole die Schritte",
  "Pen down": "Stift runter",
  "The Pen Down command starts drawing from the point where the sprite is.": "Der Befehl \"Stift runter\" beginnt das Zeichnen von dem Punkt aus, an dem sich die Figur befindet.",
  "Add pen": "Stift hinzufügen",
  "Deleting": "Löschen",
  "Draw a few shapes using the script": "Zeichne ein paar Formen mit dem Skript",
  "Delete All": "Alles löschen",
  "This command clears the stage": "Dieser Befehl leert die Bühne",
  "Put a stamp": "Einen Stempel setzen",
  "The \"Stamp\" command lets you leave a stamp of the sprite on the screen": "Der Befehl \"Stempel\" hinterlässt einen Abdruck der Figur auf dem Bildschirm",
  "Watch the video and repeat": "Sieh dir das Video an und wiederhole es",
  "Solution": "Lösung",
  "Apple": "Apfel",
  "Potion": "Trank",
  "You click on the Potion sprite, and a completely different sprite reacts. Look!": "Du klickst auf die Trank-Figur, und eine ganz andere Figur reagiert. Schau!",
  "The potion sends a message": "Der Trank sendet eine Nachricht",
  "To make this possible, sprites exchange messages. For example, when the Potion sprite is clicked, it sends the Transform message.": "Um dies zu ermöglichen, tauschen Figuren Nachrichten aus. Zum Beispiel sendet die Trank-Figur beim Anklicken die Nachricht \"Transformieren\".",
  "The Sorceress receives the message": "Die Zauberin erhält die Nachricht",
  "The Sorceress sprite receives the message. To do this, you need to create a script that starts with the command \"when I receive a message.\"": "Die Zauberin-Figur erhält die Nachricht. Dafür musst du ein Skript erstellen, das mit dem Befehl \"Wenn ich eine Nachricht erhalte\" beginnt.",
  "Sorceress transformations": "Verwandlungen der Zauberin",
  "Think up what happens to the Sorceress sprite and program it!": "Überlege, was mit der Zauberin-Figur passiert, und programmiere es!",
  "There are so many transformations of the Sorceress sprite! Of course, all the changes must be reset at startup.": "Es gibt so viele Verwandlungen der Zauberin-Figur! Natürlich müssen alle Änderungen beim Start zurückgesetzt werden.",
  "Store": "Laden",
  "Click on the bell!": "Klicke auf die Glocke!",
  "The bell sends the message": "Die Glocke sendet die Nachricht",
  "When you press the bell, it sends the message.": "Wenn du die Glocke drückst, sendet sie die Nachricht.",
  "The seller appears": "Der Verkäufer erscheint",
  "If the bell is pressed, the seller appears.": "Wenn die Glocke gedrückt wird, erscheint der Verkäufer.",
  "The boy greets the seller": "Der Junge begrüßt den Verkäufer",
  "If the bell is pressed, the boy greets the seller.": "Wenn die Glocke gedrückt wird, begrüßt der Junge den Verkäufer.",
  "Don't forget to set the initial parameters.": "Vergiss nicht, die Anfangsparameter festzulegen.",
  "Research": "Erforschung",
  "Watch the mini-animation and press the button!": "Sieh dir die Mini-Animation an und drücke den Knopf!",
  "The MarsBot talks about the button": "Der MarsBot spricht über den Knopf",
  "When you click on the green flag, the MarsBot says what the button is!": "Wenn du auf die grüne Flagge klickst, sagt der MarsBot, was der Knopf macht!",
  "The button sends a message": "Der Knopf sendet eine Nachricht",
  "Pressing the button changes the background and sends a message": "Das Drücken des Knopfes ändert den Hintergrund und sendet eine Nachricht",
  "The MarsBot hides": "Der MarsBot versteckt sich",
  "When the MarsBot receives the message, it hides.": "Wenn der MarsBot die Nachricht erhält, versteckt er sich.",
  "The dog appears and moves": "Der Hund erscheint und bewegt sich",
  "When the dog receives the message, it appears and moves. Think up what it will do.": "Wenn der Hund die Nachricht erhält, erscheint er und bewegt sich. Überlege dir, was er tun soll.",
  "At the start, the button and the MarsBot appear and fall into place, and the dog hides.": "Zu Beginn erscheinen der Knopf und der MarsBot und nehmen ihre Position ein, während sich der Hund versteckt.",
  "Choose a piece of fruit": "Wähle ein Stück Obst",
  "Help Dani pick some fruit! Click on a piece of fruit to transfer it to the bowl.": "Hilf Dani, Obst zu sammeln! Klicke auf ein Stück Obst, um es in die Schüssel zu legen.",
  "When you click on the green flag, the pieces of fruit fall back to their original places.": "Wenn du auf die grüne Flagge klickst, kehren die Obststücke an ihre ursprünglichen Orte zurück.",
  "Choice of fruit": "Obstauswahl",
  "When you click on the fruit, it changes position and sends a message to the Dani sprite": "Wenn du auf das Obst klickst, ändert es seine Position und sendet eine Nachricht an die Dani-Figur.",
  "Dani gets a message": "Dani erhält eine Nachricht",
  "Dani receives the message and expresses gratitude for the help!": "Dani erhält die Nachricht und bedankt sich für die Hilfe!",
  "When you press the button, another sprite changes — the Dancer!": "Wenn du die Taste drückst, ändert sich ein anderer Sprite – der Tänzer!",
  "Program the gray button": "Programmiere die graue Taste",
  "When you click on the gray button, it sends a message. The Dancer sprite receives it and performs the action.": "Wenn du auf die graue Taste klickst, sendet sie eine Nachricht. Der Tänzer-Sprite erhält sie und führt die Aktion aus.",
  "Program the blue button": "Programmiere die blaue Taste",
  "Pressing the blue button turns on the music.": "Das Drücken der blauen Taste schaltet die Musik ein.",
  "Dialog": "Dialog",
  "Look at the dialog and program a similar one.": "Sieh dir den Dialog an und programmiere einen ähnlichen.",
  "Initial placement of stage 1": "Anfangsplatzierung von Szene 1",
  "What do the characters look like and where are they in the first scene?": "Wie sehen die Charaktere aus und wo befinden sie sich in der ersten Szene?",
  "Scene 1": "Szene 1",
  "Program scene 1, which takes place in the room.": "Programmiere Szene 1, die im Raum stattfindet.",
  "Transition to stage 2": "Übergang zu Szene 2",
  "Choose which sprite will send messages to switch scenes and change backgrounds.": "Wähle, welcher Sprite Nachrichten sendet, um die Szenen zu wechseln und den Hintergrund zu ändern.",
  "Initial placement of stage 2": "Anfangsplatzierung von Szene 2",
  "Where do the sprites go during the second scene? How big do they get?": "Wo befinden sich die Sprites in der zweiten Szene? Wie groß werden sie?",
  "Scene 2": "Szene 2",
  "What are the sprites doing during scene 2?": "Was machen die Sprites in Szene 2?",
  "*Test it": "*Teste es",
  "Run the animation a few times and check that everything works as it should.": "Führe die Animation mehrmals aus und überprüfe, ob alles wie gewünscht funktioniert.",
  "Example": "Beispiel",
  "Look at the project and restore the scripts to play it.": "Sieh dir das Projekt an und stelle die Skripte wieder her, um es abzuspielen.",
  "Hedgehog and lightning": "Igel und Blitz",
  "Click on the area on the screen where the Hedgehog sprite needs to move to dodge the lightning!": "Klicke auf den Bereich auf dem Bildschirm, in den sich der Igel-Sprite bewegen muss, um dem Blitz auszuweichen!",
  "Hedgehog sprite control": "Steuerung des Igel-Sprites",
  "When you press the mouse button, the Hedgehog sprite moves!": "Wenn du die Maustaste drückst, bewegt sich der Igel-Sprite!",
  "If the Hedgehog sprite touches the lightning, a loss occurs": "Wenn der Igel-Sprite den Blitz berührt, tritt eine Niederlage ein",
  "Lightning sprite movement": "Bewegung des Blitz-Sprites",
  "The Lightning sprite moves erratically.": "Der Blitz-Sprite bewegt sich unberechenbar.",
  "Losing": "Verlieren",
  "If you lose, the Hedgehog sprite announces the end of the game, and the Lightning sprite stops.": "Wenn du verlierst, kündigt der Igel-Sprite das Ende des Spiels an, und der Blitz-Sprite stoppt.",
  "Anfangsplatzierung": "Anfangsplatzierung",
  "Move your mouse cursor over the stars to collect them! When you collect all the stars, press the space bar and they will reappear.": "Bewege deinen Mauszeiger über die Sterne, um sie zu sammeln! Wenn du alle Sterne gesammelt hast, drücke die Leertaste, und sie erscheinen wieder.",
  "A star is hiding": "Ein Stern versteckt sich",
  "Program the condition \"if the mouse pointer touches the star, it hides.\" To check the condition, always use the \"repeat forever\" command.": "Programmiere die Bedingung \"Wenn der Mauszeiger den Stern berührt, versteckt er sich.\" Um die Bedingung zu überprüfen, verwende immer den Befehl \"wiederhole fortlaufend\".",
  "A star appears": "Ein Stern erscheint",
  "When we press the space bar a star appears.": "Wenn wir die Leertaste drücken, erscheint ein Stern.",
  "At the start, the sprite Star is always visible.": "Zu Beginn ist der Stern-Sprite immer sichtbar.",
  "Let's program the remaining stars": "Lass uns die restlichen Sterne programmieren",
  "Program the remaining stars": "Programmiere die restlichen Sterne",
  "Jellyfish": "Qualle",
  "Click anywhere on the stage! When you press the mouse button, the background and costume change.": "Klicke irgendwo auf der Bühne! Wenn du die Maustaste drückst, ändern sich der Hintergrund und das Kostüm.",
  "When you click on the mouse, the sprite changes its costume": "Wenn du auf die Maus klickst, ändert der Sprite sein Kostüm",
  "Program the condition so that when you click on the mouse pointer, the sprite changes its costume. The script for changing backgrounds is already in the project.": "Programmiere die Bedingung, dass der Sprite sein Kostüm ändert, wenn du auf den Mauszeiger klickst. Das Skript zum Ändern der Hintergründe ist bereits im Projekt enthalten.",
  "Always check if the mouse is clicked": "Überprüfe immer, ob die Maus geklickt wurde",
  "This condition must always be checked. We need this command to do so.": "Diese Bedingung muss immer überprüft werden. Wir benötigen diesen Befehl, um dies zu tun.",
  "The costume must always be the same when starting up.": "Das Kostüm muss beim Start immer gleich sein.",
  "Bat": "Fledermaus",
  "Click anywhere on the stage, the Bat sprite will fly to the mouse pointer for 1 second! Let's program it!": "Klicke irgendwo auf der Bühne, der Fledermaus-Sprite fliegt für 1 Sekunde zum Mauszeiger! Lass es uns programmieren!",
  "Program the condition \"if the mouse is clicked, glide...\"": "Programmiere die Bedingung \"Wenn die Maus geklickt wird, gleite...\"",
  "Program the rule \"if the mouse is clicked, glide for 1 second to the mouse pointer.\" You already know how to check rules using the \"if ...\" operator. Use this condition!": "Programmiere die Regel \"Wenn die Maus geklickt wird, gleite für 1 Sekunde zum Mauszeiger.\" Du weißt bereits, wie man Regeln mit dem \"Wenn ...\"-Operator überprüft. Verwende diese Bedingung!",
  "This condition must always be checked. What command do we need?": "Diese Bedingung muss immer überprüft werden. Welchen Befehl benötigen wir?",
  "Three balls": "Drei Bälle",
  "After clicking on the green flag, the balls begin to move chaotically.": "Nach dem Klicken auf die grüne Flagge beginnen die Bälle, sich chaotisch zu bewegen.",
  "Set the position of the sprite Ball at the start and its direction. Any direction can be used!": "Lege die Position des Ball-Sprites am Start und seine Richtung fest. Jede Richtung kann verwendet werden!",
  "Chaotic ball movement": "Chaotische Ballbewegung",
  "Program the movement of the ball using the \"move_steps\" and \"repeat forever\" commands.": "Programmiere die Bewegung des Balls mit den Befehlen \"move_steps\" und \"wiederhole fortlaufend\".",
  "Change of direction": "Richtungsänderung",
  "Program a change in the direction of the Ball sprite if it reaches the edge. For the command to always work, where should it be placed — in the loop or after?": "Programmiere eine Richtungsänderung des Ball-Sprites, wenn er den Rand erreicht. Damit der Befehl immer funktioniert, wo sollte er platziert werden — in der Schleife oder danach?",
  "Program 2 more balls": "Programmiere 2 weitere Bälle",
  "Program the remaining balls by moving the resulting script to the sprite icon. Set for each ball its own starting position.": "Programmiere die restlichen Bälle, indem du das resultierende Skript zum Sprite-Symbol verschiebst. Lege für jeden Ball seine eigene Startposition fest.",
  "Watch how the balls move: when they touch, they bounce off each other! Modify the program to make the yellow ball fly away from others when it collides.": "Beobachte, wie sich die Bälle bewegen: Wenn sie sich berühren, prallen sie voneinander ab! Ändere das Programm, damit der gelbe Ball bei einer Kollision von den anderen wegfliegt.",
  "Checking if touching": "Überprüfen, ob sie sich berühren",
  "Use this condition to program the balls touching.": "Verwende diese Bedingung, um das Berühren der Bälle zu programmieren.",
  "Bouncing": "Abprallen",
  "To make them bounce, they need to turn in the opposite direction and move!": "Damit sie abprallen, müssen sie sich in die entgegengesetzte Richtung drehen und sich bewegen!",
  "Watch how the balls move: when they touch, they bounce off each other! Let's do the same!": "Beobachte, wie sich die Bälle bewegen: Wenn sie sich berühren, prallen sie voneinander ab! Lass uns dasselbe tun!",
  "Checking if touching and bouncing": "Überprüfen, ob sie sich berühren und abprallen",
  "Checking if both balls are touching": "Überprüfen, ob sich beide Bälle berühren",
  "Move the script": "Verschiebe das Skript",
  "The ball scripts are very similar: they differ only in specifying the sprites they are colliding with. If you assemble a script for one ball, it can then be used as a template for other balls. To do that, transfer the script to the sprite image, as shown in the animation.": "Die Ball-Skripte sind sehr ähnlich: Sie unterscheiden sich nur darin, welche Sprites sie kollidieren. Wenn du ein Skript für einen Ball erstellst, kann es als Vorlage für andere Bälle verwendet werden. Übertrage dazu das Skript auf das Sprite-Bild, wie in der Animation gezeigt.",
  "The balloons are coming out of the box!": "Die Ballons kommen aus der Kiste!",
  "Use the mouse cursor to keep the balloons away from the edge!": "Verwende den Mauszeiger, um die Ballons vom Rand fernzuhalten!",
  "Program touching the edge": "Programmiere das Berühren des Randes",
  "When the balloons touch the edge, they start coming out of the box again. Use a condition and the \"move\" command!": "Wenn die Ballons den Rand berühren, kommen sie wieder aus der Kiste heraus. Verwende eine Bedingung und den \"move\"-Befehl!",
  "The balloons touch the mouse cursor": "Die Ballons berühren den Mauszeiger",
  "When the balloons touch the mouse cursor, they should turn. Use a condition and command with rotation!": "Wenn die Ballons den Mauszeiger berühren, sollten sie sich drehen. Verwende eine Bedingung und einen Befehl mit Rotation!",
  "The hedgehog is flying to the crab!": "Der Igel fliegt zum Krebs!",
  "Study the game: you will need to create a similar one. Use the mouse cursor to aim and shoot the crabs by clicking on the mouse. The game consists of 2 stages: aiming and launching. Program the sprite to send messages to itself and split up the execution of the conditions using those messages!": "Studiere das Spiel: Du wirst ein ähnliches erstellen müssen. Verwende den Mauszeiger, um zu zielen und die Krebse zu schießen, indem du auf die Maus klickst. Das Spiel besteht aus 2 Phasen: Zielen und Abschießen. Programmiere den Sprite, um Nachrichten an sich selbst zu senden und die Ausführung der Bedingungen mithilfe dieser Nachrichten aufzuteilen!",
  "Use the \"if... then...\" command at least 2 times.": "Verwende den Befehl \"Wenn ... dann ...\" mindestens 2 Mal.",
  "Use the \"if... then...\" command to check the conditions \"mouse clicked?\" and \"touching the edge?\"": "Verwende den Befehl \"Wenn ... dann ...\", um die Bedingungen \"Maus geklickt?\" und \"Rand berührt?\" zu überprüfen.",
  "Use the \"repeat forever\" command at least 2 times.": "Verwende den Befehl \"wiederhole fortlaufend\" mindestens 2 Mal.",
  "Use the \"repeat forever\" command to program constant checking of the conditions.": "Verwende den Befehl \"wiederhole fortlaufend\", um die ständige Überprüfung der Bedingungen zu programmieren.",
  "Use the \"stop other sprite scripts\" command at least 2 times.": "Verwende den Befehl \"stoppe andere Sprite-Skripte\" mindestens 2 Mal.",
  "Use the \"stop other sprite scripts\" command to prevent the simultaneous execution of scripts.": "Verwende den Befehl \"stoppe andere Sprite-Skripte\", um die gleichzeitige Ausführung von Skripten zu verhindern.",
  "Take the apple": "Nimm den Apfel",
  "Control Kepler so that he finds the apple!": "Steuere Kepler, damit er den Apfel findet!",
  "The apple moves on its own": "Der Apfel bewegt sich von selbst",
  "How does the Apple sprite move? Use the example from the demo project or come up with your own method!": "Wie bewegt sich der Apfel-Sprite? Verwende das Beispiel aus dem Demo-Projekt oder denke dir eine eigene Methode aus!",
  "Controlling Kepler": "Steuerung von Kepler",
  "Program Kepler control": "Programmiere die Steuerung von Kepler",
  "Kepler and the apple touching": "Kepler und der Apfel berühren sich",
  "If Kepler touches the apple, we send a message about it. The apple hides, and Kepler speaks!": "Wenn Kepler den Apfel berührt, senden wir eine Nachricht darüber. Der Apfel versteckt sich, und Kepler spricht!",
  "Do not forget that in the beginning, you need to return the apple and Kepler to their original places!": "Vergiss nicht, dass du am Anfang den Apfel und Kepler an ihre ursprünglichen Plätze zurückbringen musst!",
  "Snowflakes": "Schneeflocken",
  "The Snowflake sprite appears at the top of the stage and falls down.": "Der Schneeflocken-Sprite erscheint oben auf der Bühne und fällt nach unten.",
  "Set the initial position of the Snowflake sprite.": "Lege die Anfangsposition des Schneeflocken-Sprites fest.",
  "Falling": "Fallen",
  "Repeat the coordinate change a few times to simulate falling!": "Wiederhole die Koordinatenänderung einige Male, um das Fallen zu simulieren!",
  "The snowflake falls constantly": "Die Schneeflocke fällt ständig",
  "The Snowflake sprite always returns to the top and falls again!": "Der Schneeflocken-Sprite kehrt immer wieder nach oben zurück und fällt erneut!",
  "The dragon guards the castle": "Der Drache bewacht das Schloss",
  "The sprite Dragon flies left and right!": "Der Drache-Sprite fliegt nach links und rechts!",
  "The dragon moves to the right": "Der Drache bewegt sich nach rechts",
  "To move to the right, you need to change the X coordinate to a positive number (without the minus sign).": "Um nach rechts zu bewegen, musst du die X-Koordinate in eine positive Zahl ändern (ohne das Minuszeichen).",
  "The dragon moves to the left": "Der Drache bewegt sich nach links",
  "To move to the left, you need to change the X coordinate to a negative number that has a minus sign.": "Um nach links zu bewegen, musst du die X-Koordinate in eine negative Zahl ändern, die ein Minuszeichen hat.",
  "The dragon turns": "Der Drache dreht sich",
  "The sprite Dragon looks in the direction it is flying in. Use the \"point in direction __\" command.": "Der Drache-Sprite schaut in die Richtung, in die er fliegt. Verwende den Befehl \"zeige in Richtung __\".",
  "The dragon moves constantly": "Der Drache bewegt sich ständig",
  "Use the commands \"repeat forever\" and \"go to x: _ y: _\" to make the Dragon sprite move on the same level.": "Verwende die Befehle \"wiederhole fortlaufend\" und \"gehe zu x: _ y: _\", um den Drache-Sprite auf derselben Ebene zu bewegen.",
  "Set the size and rotation of the Dragon sprite.": "Lege die Größe und Drehung des Drache-Sprites fest.",
  "Goalkeeper control right and left": "Torwartsteuerung rechts und links",
  "Use the right arrow key to move the goalkeeper to the right and the left arrow key to move the goalkeeper to the left.": "Verwende die rechte Pfeiltaste, um den Torwart nach rechts zu bewegen, und die linke Pfeiltaste, um den Torwart nach links zu bewegen.",
  "Movement to the right": "Bewegung nach rechts",
  "Program the following rule: if the right arrow key is pressed, the goalkeeper moves to the right.": "Programmiere die folgende Regel: Wenn die rechte Pfeiltaste gedrückt wird, bewegt sich der Torwart nach rechts.",
  "Movement to the left": "Bewegung nach links",
  "Program the following rule: if the left arrow key is pressed, the goalkeeper moves to the left.": "Programmiere die folgende Regel: Wenn die linke Pfeiltaste gedrückt wird, bewegt sich der Torwart nach links.",
  "Constantly checking keystrokes": "Ständige Überprüfung der Tastendrücke",
  "Use one \"repeat forever\" command to constantly check to see if any keys are pressed.": "Verwende einen \"wiederhole fortlaufend\"-Befehl, um ständig zu überprüfen, ob Tasten gedrückt werden.",
  "Set the size of the goalkeeper at the very beginning.": "Lege die Größe des Torwarts ganz am Anfang fest.",
  "Goalkeeper control up and down": "Torwartsteuerung oben und unten",
  "Use the up arrow key to move the goalkeeper up and the down arrow key to move the goalkeeper down.": "Verwende die obere Pfeiltaste, um den Torwart nach oben zu bewegen, und die untere Pfeiltaste, um den Torwart nach unten zu bewegen.",
  "Aufwärtsbewegung": "Aufwärtsbewegung",
  "Program the following rule: if the up arrow key is pressed, the goalkeeper moves up.": "Programmiere die folgende Regel: Wenn die obere Pfeiltaste gedrückt wird, bewegt sich der Torwart nach oben.",
  "Downward movement": "Abwärtsbewegung",
  "In order for the program to always check if a key is pressed, use the \"repeat forever\" command.": "Damit das Programm immer prüft, ob eine Taste gedrückt wurde, verwenden Sie den Befehl \"immer wiederholen\".",
  "Program the following rule: if the down arrow key is pressed, the goalkeeper moves down.": "Programmiere die folgende Regel: Wenn die untere Pfeiltaste gedrückt wird, bewegt sich der Torwart nach unten.",
  "In order for the program to always check if a key is pressed, use the \"repeat forever\" command.": "Damit das Programm ständig überprüft, ob eine Taste gedrückt wird, verwende den Befehl \"wiederhole fortlaufend\".",
  "Snowflake sprites appear at the top of the stage and fall down. Let's program that!": "Schneeflocken-Sprites erscheinen oben auf der Bühne und fallen nach unten. Lass uns das programmieren!",
  "Falling snowflakes": "Fallende Schneeflocken",
  "Program the Snowflake sprites so that they constantly fall. Use the \"wait __ seconds\" command.": "Programmiere die Schneeflocken-Sprites so, dass sie ständig fallen. Verwende den Befehl \"warte __ Sekunden\".",
  "The snowflakes fall at different speeds": "Die Schneeflocken fallen mit unterschiedlichen Geschwindigkeiten",
  "Enter different values that change the Y coordinate for different snowflakes — then they will fall differently!": "Gib verschiedene Werte ein, die die Y-Koordinate für verschiedene Schneeflocken ändern — dann fallen sie unterschiedlich!",
  "* Bonus: spinning snowflakes": "* Bonus: sich drehende Schneeflocken",
  "Think about how to make the snowflakes spin while they're falling. Which command will turn the snowflakes?": "Überlege, wie du die Schneeflocken beim Fallen drehen kannst. Welcher Befehl wird die Schneeflocken drehen?",
  "Soccer": "Fußball",
  "Create a game in which the goalkeeper has to protect their goal. Use the arrow keys on the keyboard to control the movement of the Goalkeeper sprite.": "Erstelle ein Spiel, in dem der Torwart sein Tor schützen muss. Verwende die Pfeiltasten auf der Tastatur, um die Bewegung des Torwart-Sprites zu steuern.",
  "Goalkeeper control": "Torwartsteuerung",
  "If the corresponding key is pressed, the sprite moves in that direction.": "Wenn die entsprechende Taste gedrückt wird, bewegt sich der Sprite in diese Richtung.",
  "Ball movement": "Ballbewegung",
  "Program the Ball sprite so that it moves randomly using the move_steps, repeat forever, and if on edge, bounce.": "Programmiere den Ball-Sprite so, dass er sich zufällig bewegt, indem du die Befehle \"move_steps\", \"wiederhole fortlaufend\" und \"if on edge, bounce\" verwendest.",
  "The Cat sprite jumps": "Der Katzen-Sprite springt",
  "Press the space bar!": "Drücke die Leertaste!",
  "Program the Cat sprite to move up when you press the spacebar. What coordinate are we going to change?": "Programmiere den Katzen-Sprite so, dass er nach oben springt, wenn du die Leertaste drückst. Welche Koordinate werden wir ändern?",
  "Program downward movement. What coordinate are we going to change? To what number?": "Programmiere die Abwärtsbewegung. Welche Koordinate werden wir ändern? Zu welcher Zahl?",
  "Use the \"go to x: _ y: _\" command.": "Verwende den Befehl \"gehe zu x: _ y: _\".",
  "Race": "Rennen",
  "Use the arrows to control the Car sprite and reach the finish line!": "Verwende die Pfeiltasten, um den Auto-Sprite zu steuern und die Ziellinie zu erreichen!",
  "Car control": "Autosteuerung",
  "Another control method is to turn when you click on the arrows instead of moving! Try to program that.": "Eine andere Steuerungsmethode besteht darin, sich zu drehen, wenn du auf die Pfeile klickst, anstatt sich zu bewegen! Versuche, das zu programmieren.",
  "Touching the grass": "Das Gras berühren",
  "Program this rule: If the Car sprite touches anything green (i.e. travels off the road), it begins its journey again.": "Programmiere diese Regel: Wenn der Auto-Sprite etwas Grünes berührt (d.h. von der Straße abkommt), beginnt er seine Reise von neuem.",
  "Touching the finish line sprite": "Die Ziellinie berühren",
  "Program this rule: If the Car sprite touches the finish line, you win and the project stops.": "Programmiere diese Regel: Wenn der Auto-Sprite die Ziellinie berührt, gewinnst du und das Projekt stoppt.",
  "MarsBot jumping": "MarsBot springt",
  "Press the space bar and watch: the MarsBot jumps two times. Create the same project!": "Drücke die Leertaste und schau zu: Der MarsBot springt zweimal. Erstelle das gleiche Projekt!",
  "Create a new \"Jump\" command": "Erstelle einen neuen \"Springen\"-Befehl",
  "The robot changes position gradually. It moves up and then down. Use these commands.": "Der Roboter ändert seine Position schrittweise. Er bewegt sich nach oben und dann nach unten. Verwende diese Befehle.",
  "Double jump when pressing the space bar": "Doppelsprung bei Drücken der Leertaste",
  "This command appeared in the \"Other Blocks\" section. Use it.": "Dieser Befehl erschien im Abschnitt \"Andere Blöcke\". Verwende ihn.",
  "The MarsBot does flips!": "Der MarsBot macht Saltos!",
  "Press the space bar and watch! The initial placement and the appearance of the robot can also be done with a separate command. Look at how it's done.": "Drücke die Leertaste und schau zu! Die Anfangsposition und das Aussehen des Roboters können auch mit einem separaten Befehl festgelegt werden. Schau dir an, wie es gemacht wird.",
  "Create the \"Flip\" procedure": "Erstelle die \"Salto\"-Prozedur",
  "Your \"own\" commands are called procedures. Create the script for \"Flip\" procedure.": "Deine \"eigenen\" Befehle werden Prozeduren genannt. Erstelle das Skript für die \"Salto\"-Prozedur.",
  "Double flip when pressing the space bar": "Doppelter Salto bei Drücken der Leertaste",
  "Use the \"Flip\" procedure twice when pressing the space bar to make the MarsBot do a double flip": "Verwende die \"Salto\"-Prozedur zweimal, wenn du die Leertaste drückst, damit der MarsBot einen Doppelsalto macht.",
  "The sprite does somersaults forward and backward": "Der Sprite macht Saltos vorwärts und rückwärts",
  "To control the MarsBot, use the space bar and numbers 1 and 2.": "Um den MarsBot zu steuern, verwende die Leertaste und die Zahlen 1 und 2.",
  "The \"Start\" procedure": "Die \"Start\"-Prozedur",
  "Use the \"Start\" procedure to set the size, position, and direction of the MarsBot.": "Verwende die \"Start\"-Prozedur, um die Größe, Position und Richtung des MarsBots festzulegen.",
  "The \"backward somersault\" procedure": "Die \"Rückwärtssalto\"-Prozedur",
  "Create the \"backward somersault\" procedure the same way as the \"forward somersault\" procedure.": "Erstelle die \"Rückwärtssalto\"-Prozedur auf die gleiche Weise wie die \"Vorwärtssalto\"-Prozedur.",
  "Pressing the space bar": "Drücken der Leertaste",
  "The space bar starts a long warm-up and the MarsBot performs somersaults forward and backward.": "Die Leertaste startet ein langes Aufwärmen, und der MarsBot führt Saltos vorwärts und rückwärts aus.",
  "Pressing the number 1": "Drücken der Zahl 1",
  "When you press the number 1, the MarsBot does a forward somersault.": "Wenn du die Zahl 1 drückst, macht der MarsBot einen Vorwärtssalto.",
  "Pressing the number 2": "Drücken der Zahl 2",
  "When you press the number 2, the MarsBot does a backward somersault.": "Wenn du die Zahl 2 drückst, macht der MarsBot einen Rückwärtssalto.",
  "The MarsBot walks or does flips all the time": "Der MarsBot läuft oder macht ständig Saltos",
  "Click on 1 and 2 and watch the example!": "Klicke auf 1 und 2 und schau dir das Beispiel an!",
  "Define the \"Start\" procedure": "Definiere die \"Start\"-Prozedur",
  "Define the \"Walk\" procedure": "Definiere die \"Gehen\"-Prozedur",
  "In this procedure, the MarsBot moves to the right and then returns to its original place.": "In dieser Prozedur bewegt sich der MarsBot nach rechts und kehrt dann an seinen ursprünglichen Platz zurück.",
  "Define the \"Flip\" procedure": "Definiere die \"Salto\"-Prozedur",
  "When you press 1, the MarsBot is constantly walking": "Wenn du 1 drückst, läuft der MarsBot ständig",
  "Put the procedure in an endless \"repeat forever\" loop!": "Setze die Prozedur in eine endlose \"wiederhole fortlaufend\"-Schleife!",
  "When you press 2, the MarsBot is constantly doing flips": "Wenn du 2 drückst, macht der MarsBot ständig Saltos",
  "Put the \"Flip\" procedure in an endless loop. And add a small pause between jumps — after all, real athletes pause to prepare for their next jump!": "Setze die \"Salto\"-Prozedur in eine Endlosschleife. Und füge eine kleine Pause zwischen den Sprüngen hinzu — schließlich pausieren echte Athleten, um sich auf ihren nächsten Sprung vorzubereiten!",
  "Stop the previous script": "Stoppe das vorherige Skript",
  "If the MarsBot is always walking and then we want it to do flips, we must first stop the walking script. To do this, use the command \"stop the sprite's other scripts.\" It is also best if the flipping and walking always start from the starting position, so we will use the “Start” procedure for all events.": "Wenn der MarsBot ständig läuft und wir dann wollen, dass er Saltos macht, müssen wir zuerst das Laufskript stoppen. Verwende dazu den Befehl \"stoppe andere Sprite-Skripte\". Es ist auch am besten, wenn das Salto machen und Laufen immer von der Startposition aus beginnen, also verwenden wir die „Start“-Prozedur für alle Ereignisse.",
  "Find the error": "Finde den Fehler",
  "Run the project, and press 2 and 1. What is the error?": "Führe das Projekt aus und drücke 2 und 1. Was ist der Fehler?",
  "Correct the error": "Korrigiere den Fehler",
  "Hit the ball!": "Triff den Ball!",
  "Start the project with the green flag. Move the broom with your mouse and hit the ball. Note that after you touch the ball once, it no longer responds to the touch of the broom.": "Starte das Projekt mit der grünen Flagge. Bewege den Besen mit der Maus und triff den Ball. Beachte, dass der Ball nach einmaligem Berühren nicht mehr auf die Berührung des Besens reagiert.",
  "Study the code and put the command in the right place.": "Studiere den Code und setze den Befehl an die richtige Stelle.",
  "Hide the bunny!": "Verstecke das Häschen!",
  "Hide the bunny in the house! Key controls. Note that when the bunny is hiding, the foxes stop!": "Verstecke das Häschen im Haus! Tastensteuerung. Beachte, dass die Füchse aufhören, wenn das Häschen versteckt ist!",
  "Fix the error": "Repariere den Fehler",
  "Add a command to the right place so that the foxes stop after the bunny hides in the house.": "Füge einen Befehl an der richtigen Stelle hinzu, damit die Füchse aufhören, nachdem das Häschen im Haus versteckt ist.",
  "Complete two levels of the maze!": "Schließe zwei Level des Labyrinths ab!",
  "Check where the character returns when it touches the wall.": "Überprüfe, wohin der Charakter zurückkehrt, wenn er die Wand berührt.",
  "Run the project and check how the touching a wall or enemy and returning to the start work. How do we fix it?": "Führe das Projekt aus und überprüfe, wie das Berühren einer Wand oder eines Feindes und die Rückkehr zum Start funktionieren. Wie beheben wir das?",
  "The rules for the first level continue to work in the second. The first level rule checking script needs to stop on time.": "Die Regeln für das erste Level gelten weiterhin im zweiten. Das Skript zur Überprüfung der Regeln des ersten Levels muss rechtzeitig gestoppt werden.",
  "Use the pages in your notebook to display your game plan.": "Verwende die Seiten deines Notizbuchs, um deinen Spielplan darzustellen.",
  "Controlling the main character": "Steuerung der Hauptfigur",
  "Choose the main character for your game and program their control!": "Wähle die Hauptfigur für dein Spiel und programmiere ihre Steuerung!",
  "Program the transition to the second stage and the initial placement for it! Don't forget the obstacles and the goal!": "Programmiere den Übergang zur zweiten Stufe und die Anfangsposition dafür! Vergiss die Hindernisse und das Ziel nicht!",
  "Victory": "Sieg",
  "Remember to program how the player will find out when they have won.": "Denke daran, zu programmieren, wie der Spieler erfährt, dass er gewonnen hat.",
  "Program your level!": "Programmiere dein Level!",
  "Use the pages in your workbook to display your game plan.":"Verwenden Sie die Seiten in Ihrem Arbeitsbuch, um Ihren Spielplan darzustellen.",
  "Do the initial placement and movement of obstacles and enemies for the first level!":"Platzieren und bewegen Sie Hindernisse und Gegner zunächst für das erste Level!",
  "The Cat sprite": "Der Katzen-Sprite",
  "Move the Cat sprite with the mouse: if the mouse pointer touches the Cat sprite and the mouse is held down, the sprite follows the mouse.": "Bewege den Katzen-Sprite mit der Maus: Wenn der Mauszeiger den Katzen-Sprite berührt und die Maus gedrückt wird, folgt der Sprite der Maus.",
  "Controlling the Cat sprite": "Steuerung des Katzen-Sprites",
  "Create a script with which you can control the Cat sprite. Rule: if the mouse pointer touches the Cat sprite and the mouse is held down, the sprite follows the mouse.": "Erstelle ein Skript, mit dem du den Katzen-Sprite steuern kannst. Regel: Wenn der Mauszeiger den Katzen-Sprite berührt und die Maus gedrückt wird, folgt der Sprite der Maus.",
  "Continuous condition checking": "Ständige Überprüfung der Bedingungen",
  "Complete the code so that it works correctly. Use the repeat forever command.": "Vervollständige den Code, damit er korrekt funktioniert. Verwende den Befehl \"wiederhole fortlaufend\".",
  "Move the Cat sprite with the mouse: if the mouse pointer touches the Cat sprite and the mouse is held down, the sprite follows the mouse. Let's solve the same task but in a different way, using one condition (using the logical operator \"AND\").": "Bewege den Katzen-Sprite mit der Maus: Wenn der Mauszeiger den Katzen-Sprite berührt und die Maus gedrückt wird, folgt der Sprite der Maus. Lass uns dieselbe Aufgabe auf eine andere Weise lösen, indem wir eine Bedingung verwenden (mit dem logischen Operator \"UND\").",
  "Another way to control the Cat sprite": "Eine andere Möglichkeit, den Katzen-Sprite zu steuern",
  "Use the commands described above and create a script with which you can control the Cat sprite using one condition. Rule: if the mouse pointer touches the Cat sprite and the mouse is held down, the sprite follows the mouse. In the free windows of the \"AND\" operator, insert the conditions that the operator checks and processes.": "Verwende die oben beschriebenen Befehle und erstelle ein Skript, mit dem du den Katzen-Sprite mit einer Bedingung steuern kannst. Regel: Wenn der Mauszeiger den Katzen-Sprite berührt und die Maus gedrückt wird, folgt der Sprite der Maus. In die freien Felder des \"UND\"-Operators füge die Bedingungen ein, die der Operator überprüft und verarbeitet.",
  "Call the elevator": "Ruf den Aufzug",
  "The elevator call button will work if any of the Girl sprites goes up to it! Character control: to control the sprites use the A, D keys and \"right\"-\"left\" arrow keys.": "Der Aufzugrufknopf funktioniert, wenn einer der Mädchen-Sprites zu ihm geht! Charaktersteuerung: Verwende die Tasten A, D und die Pfeiltasten \"rechts\"-\"links\", um die Sprites zu steuern.",
  "Button touching": "Knopfberührung",
  "Use the available commands to program the elevator button. It is important to remember that if at least one Girl sprite touches the button, the button will change color. The button is triggered if at least one sprite touches it. Which logical operator should you use?": "Verwende die verfügbaren Befehle, um den Aufzugknopf zu programmieren. Es ist wichtig zu beachten, dass der Knopf die Farbe ändert, wenn mindestens ein Mädchen-Sprite ihn berührt. Der Knopf wird ausgelöst, wenn mindestens ein Sprite ihn berührt. Welchen logischen Operator solltest du verwenden?",
  "The A, W, S, D keys.": "Die Tasten A, W, S, D.",
  "If the control isn't working, don't get upset right away! Check which layout you are using - Russian or English?": "Wenn die Steuerung nicht funktioniert, ärgere dich nicht sofort! Überprüfe, welches Tastaturlayout du verwendest - Russisch oder Englisch?",
  "Teamwork": "Teamarbeit",
  "The Giga and Pico sprites should touch the button together.": "Die Sprites Giga und Pico sollten den Knopf zusammen berühren.",
  "Giga says what to do": "Giga sagt, was zu tun ist",
  "Add this set of commands so that Giga will first say what to do.": "Füge diesen Befehlssatz hinzu, damit Giga zuerst sagt, was zu tun ist.",
  "Giga sprite control": "Steuerung des Giga-Sprites",
  "Program the procedure for controlling the Giga sprite.": "Programmiere die Prozedur zur Steuerung des Giga-Sprites.",
  "Pico sprite control": "Steuerung des Pico-Sprites",
  "Program the procedure for controlling the Pico sprite": "Programmiere die Prozedur zur Steuerung des Pico-Sprites",
  "Programming the button": "Programmierung des Knopfs",
  "Program the button so that it only works if both Pico and Giga touch it.": "Programmiere den Knopf so, dass er nur funktioniert, wenn sowohl Pico als auch Giga ihn berühren.",
  "The button sends a message that the task has been completed": "Der Knopf sendet eine Nachricht, dass die Aufgabe erledigt ist",
  "Use the \"say\" command.": "Verwende den Befehl \"sage\".",
  "Cat and Hedgehog sprites": "Katzen- und Igel-Sprites",
  "The Cat sprite dodges the hedgehogs! The rule for controlling the Cat sprite: if the mouse pointer touches the Cat sprite and the mouse is held down, the sprite follows the mouse. Study the example and we'll create something similar.": "Der Katzen-Sprite weicht den Igeln aus! Die Regel zur Steuerung des Katzen-Sprites: Wenn der Mauszeiger den Katzen-Sprite berührt und die Maus gedrückt wird, folgt der Sprite der Maus. Studiere das Beispiel, und wir werden etwas Ähnliches erstellen.",
  "The rule for controlling the Cat sprite: if the mouse pointer touches the Cat sprite and the mouse is held down, the sprite follows the mouse.": "Die Regel zur Steuerung des Katzen-Sprites: Wenn der Mauszeiger den Katzen-Sprite berührt und die Maus gedrückt wird, folgt der Sprite der Maus.",
  "Movement of Hedgehog sprites": "Bewegung der Igel-Sprites",
  "Think up and program how the Hedgehog sprites will move.": "Überlege und programmiere, wie sich die Igel-Sprites bewegen werden.",
  "Hedgehog sprite touching": "Berührung des Igel-Sprites",
  "If the Cat sprite touches the hedgehog, it says \"Hey!\" Rule: Touching one hedgehog OR another is programmed with these commands.": "Wenn der Katzen-Sprite den Igel berührt, sagt er \"Hey!\" Regel: Das Berühren eines Igels ODER eines anderen wird mit diesen Befehlen programmiert.",
  "Continuous condition checking and initial placement": "Ständige Überprüfung der Bedingungen und Anfangspositionierung",
  "Complete the code so that it works correctly.": "Vervollständige den Code, damit er korrekt funktioniert.",
  "Open the elevator": "Öffne den Aufzug",
  "Program the elevator so that the door will open if any of the Girl sprites come up and touch the button!": "Programmiere den Aufzug so, dass sich die Tür öffnet, wenn einer der Mädchen-Sprites kommt und den Knopf berührt!",
  "Wait until...": "Warte bis...",
  "The \"wait until...\" command does nothing until the specified condition becomes true. We use it: let the button wait for touches with other sprites.": "Der Befehl \"warte bis...\" tut nichts, bis die angegebene Bedingung wahr wird. Wir verwenden ihn: Lass den Knopf auf Berührungen mit anderen Sprites warten.",
  "Girl sprite touching": "Berührung des Mädchen-Sprites",
  "The button is triggered if at least one sprite Girl touches it. Which logical operator should you use? The button then sends the door a message.": "Der Knopf wird ausgelöst, wenn mindestens ein Mädchen-Sprite ihn berührt. Welchen logischen Operator solltest du verwenden? Der Knopf sendet dann der Tür eine Nachricht.",
  "Opening the elevator door": "Öffnen der Aufzugstür",
  "The door opens when it receives a message from the button.": "Die Tür öffnet sich, wenn sie eine Nachricht vom Knopf erhält.",
  "Think about what initial placement you need and program it.": "Überlege, welche Anfangsposition du benötigst, und programmiere sie.",
  "Start the Algorithmics bus": "Starte den Algorithmics-Bus",
  "The sprites Giga and Pico need to run the Algorithmics bus from the portal. To do this, they need to touch a button together. Study the example and let's create the code!": "Die Sprites Giga und Pico müssen den Algorithmics-Bus vom Portal aus starten. Dazu müssen sie gemeinsam einen Knopf berühren. Studiere das Beispiel, und lass uns den Code erstellen!",
  "Pressing the button": "Drücken des Knopfs",
  "Which operator should be used for the button to work if both Pico and Giga touch it?": "Welcher Operator sollte verwendet werden, damit der Knopf funktioniert, wenn sowohl Pico als auch Giga ihn berühren?",
  "The appearance of the portal and running the bus": "Das Erscheinen des Portals und das Starten des Busses",
  "After clicking the button, it sends a message that the portal and the bus receive.": "Nach dem Drücken des Knopfs sendet er eine Nachricht, die das Portal und der Bus empfangen.",
  "Program the initial placement for all the sprites.": "Programmiere die Anfangspositionierung für alle Sprites.",
  "The Crab and Coral sprites": "Der Krebs- und Korallen-Sprite",
  "The Crab sprite needs to hide behind the coral! Click on the area of the stage where it needs to move to.": "Der Krebs-Sprite muss sich hinter der Koralle verstecken! Klicke auf den Bereich der Bühne, zu dem er sich bewegen soll.",
  "Mouse control": "Maussteuerung",
  "Two \"OR\" logical operators": "Zwei \"ODER\"-logische Operatoren",
  "There are three Coral sprites on the stage. To check for touching of three colors, logical operators can be inserted into each other!": "Es gibt drei Korallen-Sprites auf der Bühne. Um das Berühren von drei Farben zu überprüfen, können logische Operatoren ineinander eingefügt werden!",
  "Change color": "Farbe ändern",
  "Use the “touches color” block to check if the Crab sprite is near the coral. Use the eyedropper tool to select the color you want.": "Verwende den Block „berührt Farbe“, um zu überprüfen, ob der Krebs-Sprite in der Nähe der Koralle ist. Verwende das Pipettenwerkzeug, um die gewünschte Farbe auszuwählen.",
  "Growth apple": "Wachstumsapfel",
  "The Cat sprite isn't allowing the Triceratops sprite to reach the volcano. The dinosaur will only leave if the Cat sprite becomes large enough. To do that, it needs to touch the magic apple!": "Der Katzen-Sprite lässt den Triceratops-Sprite nicht zum Vulkan gelangen. Der Dinosaurier wird nur gehen, wenn der Katzen-Sprite groß genug wird. Dazu muss er den magischen Apfel berühren!",
  "The Cat sprite grows in size when it touches the apple": "Der Katzen-Sprite wächst, wenn er den Apfel berührt",
  "The Cat sprite shouldn't grow immediately": "Der Katzen-Sprite sollte nicht sofort wachsen",
  "When the Cat sprite touches the apple, it immediately becomes huge and cannot go through the wall. To prevent this from happening, use the \"wait until __\" command and a logical operator. Then one touch with the apple will grow the cat by only 20%, and for the next time, you need to move away from the apple and touch it again.": "Wenn der Katzen-Sprite den Apfel berührt, wird er sofort riesig und kann nicht durch die Wand gehen. Um dies zu verhindern, verwende den Befehl \"warte bis __\" und einen logischen Operator. Dann wird eine Berührung mit dem Apfel die Katze nur um 20% wachsen lassen, und für das nächste Mal musst du dich vom Apfel entfernen und ihn erneut berühren.",
  "Bear in space": "Bär im Weltraum",
  "The bear really wants to go to space! Only there will he be able to move to the right and to the left and up and down. In order to send the bear into space, change the background using numbers.": "Der Bär möchte unbedingt ins Weltall! Nur dort kann er sich nach rechts und links sowie nach oben und unten bewegen. Um den Bären ins Weltall zu schicken, ändere den Hintergrund mit Zahlen.",
  "Change the background number": "Ändere die Hintergrundnummer",
  "Note that in the commands from the \"Looks\" block, the background has numbers!": "Beachte, dass in den Befehlen aus dem Block \"Aussehen\" der Hintergrund Nummern hat!",
  "Add conditions": "Bedingungen hinzufügen",
  "For the bear to move up and down, it needs to be in space. To get into space, you need to switch the background. Use commands to change the background and logical operators to create a complete command!": "Damit sich der Bär nach oben und unten bewegen kann, muss er im Weltraum sein. Um in den Weltraum zu gelangen, musst du den Hintergrund wechseln. Verwende Befehle, um den Hintergrund zu ändern, und logische Operatoren, um einen vollständigen Befehl zu erstellen!",
  "You need to drag the ingredients into the cauldron to help the sorceress brew the potion. But be careful because if you mix up the ingredients, you won't be able to make the potion!": "Du musst die Zutaten in den Kessel ziehen, um der Zauberin zu helfen, den Trank zu brauen. Aber sei vorsichtig, denn wenn du die Zutaten verwechselst, kannst du den Trank nicht herstellen!",
  "Combining different ingredients": "Kombinieren verschiedener Zutaten",
  "The apple and the beetle don't go well together. But the potion can be brewed from one or the other. Use logical operators to combine apples or beetles with the magic water.": "Der Apfel und der Käfer passen nicht gut zusammen. Aber der Trank kann aus dem einen oder dem anderen gebraut werden. Verwende logische Operatoren, um Äpfel oder Käfer mit dem magischen Wasser zu kombinieren.",
  "Run the project!": "Führe das Projekt aus!",
  "Add rules and conditions for winning to the procedure": "Füge der Prozedur Regeln und Bedingungen für den Gewinn hinzu",
  "Use the AND operator": "Verwende den UND-Operator",
  "Add conditions for losing": "Füge Bedingungen für das Verlieren hinzu",
  "Use the OR operator": "Verwende den ODER-Operator",
  "The rockets push Kepler to the left": "Die Raketen schieben Kepler nach links",
  "* Make the game more difficult: add sprites and change their movement": "* Mache das Spiel schwieriger: Füge Sprites hinzu und ändere ihre Bewegung",
  "* Add a sprite to freeze": "* Füge einen Sprite hinzu, der einfriert",
  "Press \"D2\" to see how freezing works": "Drücke \"D2\", um zu sehen, wie das Einfrieren funktioniert",
  "Drip-drop": "Tropfen",
  "It's finally going to rain in the desert! The drop moves to the mouse cursor, the rain is started by clicking on the mouse.": "Es regnet endlich in der Wüste! Der Tropfen bewegt sich zum Mauszeiger, der Regen wird durch Klicken auf die Maus gestartet.",
  "The Drop sprite always follows the mouse pointer": "Der Tropfen-Sprite folgt immer dem Mauszeiger",
  "Use the command \"move to mouse pointer.\"": "Verwende den Befehl \"bewege zu Mauszeiger\".",
  "Clicking on the mouse button": "Klicken auf die Maustaste",
  "When you click on the mouse button, the Drop sprite falls until it reaches the sand.": "Wenn du auf die Maustaste klickst, fällt der Tropfen-Sprite, bis er den Sand erreicht.",
  "“Repeat until” and the drop falling": "\"Wiederhole bis\" und das Fallen des Tropfens",
  "To make the Drop sprite fall until it touches the sand, use this command.": "Um den Tropfen-Sprite fallen zu lassen, bis er den Sand berührt, verwende diesen Befehl.",
  "Destroy all the meteorites. Launch the projectile using the mouse: move the mouse pointer over the target and click on it.": "Zerstöre alle Meteoriten. Starte das Projektil mit der Maus: Bewege den Mauszeiger über das Ziel und klicke darauf.",
  "Pick the starting position of the Ball sprite.": "Wähle die Startposition des Ball-Sprites.",
  "The Ball sprite being launched and flying": "Der Ball-Sprite wird gestartet und fliegt",
  "Program the condition: if the mouse button is clicked, the Ball sprite turns towards it and starts moving until it touches the edge or the meteorite. After that, it returns to the starting position.": "Programmiere die Bedingung: Wenn die Maustaste geklickt wird, dreht sich der Ball-Sprite in Richtung des Mauszeigers und beginnt sich zu bewegen, bis er den Rand oder den Meteoriten berührt. Danach kehrt er in die Startposition zurück.",
  "Meteorite disappearing": "Meteorit verschwindet",
  "Program the following condition for the meteorite: \"If it touches the Ball, then hide.\"": "Programmiere die folgende Bedingung für den Meteoriten: \"Wenn er den Ball berührt, verstecke ihn.\"",
  "Copy the script for the other meteorites": "Kopiere das Skript für die anderen Meteoriten",
  "Hide and seek in the swamp": "Verstecken im Sumpf",
  "The Dinosaur and Bat sprites are playing hide and seek. The Dinosaur sprite is hiding, and the Bat sprite is looking for it! Hide the Dinosaur sprite in the swamp, and control the Bat sprite with the keys to find it! Finish the program.": "Die Dinosaurier- und Fledermaus-Sprites spielen Verstecken. Der Dinosaurier-Sprite versteckt sich, und der Fledermaus-Sprite sucht ihn! Verstecke den Dinosaurier-Sprite im Sumpf und steuere den Fledermaus-Sprite mit den Tasten, um ihn zu finden! Vervollständige das Programm.",
  "Hide the Dinosaur sprite": "Verstecke den Dinosaurier-Sprite",
  "The Dinosaur sprite wants to hide in the swamp but can't do it yet. You need to use the \"mouse clicked?\" command so that the sprite can hide in the swamp. But where to insert it?": "Der Dinosaurier-Sprite möchte sich im Sumpf verstecken, kann es aber noch nicht. Du musst den Befehl \"Maus geklickt?\" verwenden, damit der Sprite sich im Sumpf verstecken kann. Aber wo fügst du ihn ein?",
  "The Bat sprite finds the Dinosaur sprite": "Der Fledermaus-Sprite findet den Dinosaurier-Sprite",
  "When the Bat sprite touches the Dinosaur sprite, it reappears! We already have a conditional loop in our code, but is that the right way to go? Take a closer look and try using the \"wait until\" command!": "Wenn der Fledermaus-Sprite den Dinosaurier-Sprite berührt, erscheint er wieder! Wir haben bereits eine bedingte Schleife in unserem Code, aber ist das der richtige Weg? Schau genauer hin und versuche, den Befehl \"warte bis\" zu verwenden!",
  "The Knight sprite": "Der Ritter-Sprite",
  "The Knight sprite needs to jump over the abyss! Use key control. Pay attention: the Knight sprite can jump to the sides, and only jumps when it touches the platform and can push off from it.": "Der Ritter-Sprite muss über den Abgrund springen! Verwende die Tastensteuerung. Achtung: Der Ritter-Sprite kann zur Seite springen und springt nur, wenn er die Plattform berührt und sich von ihr abstoßen kann.",
  "The Knight sprite jumps to the side": "Der Ritter-Sprite springt zur Seite",
  "The Knight sprite currently cannot jump to the side or get over the abyss. How do we change the code to make it work?": "Der Ritter-Sprite kann derzeit nicht zur Seite springen oder den Abgrund überwinden. Wie ändern wir den Code, damit es funktioniert?",
  "The Knight sprite jumps, pushing off the platform": "Der Ritter-Sprite springt und stößt sich von der Plattform ab",
  "The Knight sprite currently always jumps up, even if he is in the air. Make him move up only when he touches the platform, like in real life.": "Der Ritter-Sprite springt derzeit immer nach oben, auch wenn er in der Luft ist. Lass ihn sich nur nach oben bewegen, wenn er die Plattform berührt, wie im echten Leben.",
  "Drip, drop": "Tropfen, Tropfen",
  "It's finally going to rain in the desert! The drop moves to the mouse cursor, the rain is started by clicking on the mouse button.": "Es regnet endlich in der Wüste! Der Tropfen bewegt sich zum Mauszeiger, der Regen wird durch Klicken auf die Maustaste gestartet.",
  "When you click the mouse, the Drop sprite falls until it reaches the sand, and then it changes costume and leaves an imprint.": "Wenn du die Maus klickst, fällt der Tropfen-Sprite, bis er den Sand erreicht, und dann ändert er sein Kostüm und hinterlässt einen Abdruck.",
  "Drop imprint": "Tropfenabdruck",
  "Set all the parameters first. For the \"Pen\" block, use the \"erase everything\" command. Do the rest of the initial placement yourself.": "Lege zuerst alle Parameter fest. Verwende für den \"Stift\"-Block den Befehl \"alles löschen\". Mache den Rest der Anfangspositionierung selbst.",
  "Add the pen": "Füge den Stift hinzu",
  "Arcade game": "Arcade-Spiel",
  "This is a game where obstacles slowly move downward, and you need to hit them before they reach the bottom boundary!": "Dies ist ein Spiel, in dem sich Hindernisse langsam nach unten bewegen, und du sie treffen musst, bevor sie die untere Grenze erreichen!",
  "Movement of the Meteorite sprite down": "Bewegung des Meteoriten-Sprites nach unten",
  "The Meteorite sprite moves downward until it touches the ball or the green bottom edge. Think about which coordinate changes when moving down, and how to formulate the stop condition.": "Der Meteoriten-Sprite bewegt sich nach unten, bis er den Ball oder den grünen unteren Rand berührt. Überlege, welche Koordinate sich beim Bewegen nach unten ändert und wie die Stoppbedingung formuliert werden soll.",
  "If the mouse button is clicked, the sprite Ball turns towards it and starts moving until it touches the edge or the meteorite. After that, it returns to the starting position.": "Wenn die Maustaste geklickt wird, dreht sich der Ball-Sprite in Richtung des Mauszeigers und beginnt sich zu bewegen, bis er den Rand oder den Meteoriten berührt. Danach kehrt er in die Startposition zurück.",
  "Duplicate the Meteorite sprite": "Dupliziere den Meteoriten-Sprite",
  "Endless meteorites": "Endlose Meteoriten",
  "Change the program so that the meteorite falls from above again when it touches the ball.": "Ändere das Programm so, dass der Meteorit wieder von oben fällt, wenn er den Ball berührt.",
  "*Bonus: winning and losing": "*Bonus: Gewinnen und Verlieren",
  "Add winning and losing situations to make a complete game.": "Füge Gewinn- und Verlustsituationen hinzu, um ein vollständiges Spiel zu erstellen.",
  "Grow a tree": "Lass einen Baum wachsen",
  "Touch the little sprout with a drop until a tree grows!": "Berühre den kleinen Spross mit einem Tropfen, bis ein Baum wächst!",
  "The tree grows": "Der Baum wächst",
  "Program the Sprout sprite so that when you touch it with a drop and click on the mouse, it grows.": "Programmiere den Spross-Sprite so, dass er wächst, wenn du ihn mit einem Tropfen berührst und die Maus klickst.",
  "The Sprout sprite grows every time a drop touches it": "Der Spross-Sprite wächst jedes Mal, wenn ein Tropfen ihn berührt.",
  "When the mouse is clicked, the Sprout sprite should grow only once.": "Wenn die Maus geklickt wird, sollte der Spross-Sprite nur einmal wachsen.",
  "The tree grows and the desert transforms": "Der Baum wächst, und die Wüste verwandelt sich",
  "Now the tree is growing, but if you unsuccessfully click on it, it becomes a sprout again. Using the commands \"costume number =\" and the logical operator, determine on which costume the Sprout sprite will stop growing. Place those commands in a conditional loop.": "Jetzt wächst der Baum, aber wenn du erfolglos darauf klickst, wird er wieder zu einem Spross. Verwende die Befehle \"Kostümnummer =\" und den logischen Operator, um festzulegen, bei welchem Kostüm der Spross-Sprite aufhört zu wachsen. Platziere diese Befehle in einer bedingten Schleife.",
  "The Dice sprite": "Der Würfel-Sprite",
  "If you don't happen to have a dice - you can program one! Click on it.": "Wenn du keinen Würfel hast - du kannst einen programmieren! Klicke darauf.",
  "Random number of repetitions": "Zufällige Anzahl von Wiederholungen",
  "The costume change occurs a random number of times when you click on the sprite.": "Der Kostümwechsel erfolgt eine zufällige Anzahl von Malen, wenn du auf den Sprite klickst.",
  "Invisibility and visibility": "Unsichtbarkeit und Sichtbarkeit",
  "To avoid seeing how the Dice sprite changes costumes, have it hide before changing costumes and appear after.": "Um zu vermeiden, dass du siehst, wie der Würfel-Sprite die Kostüme wechselt, lass ihn sich vor dem Kostümwechsel verstecken und danach wieder erscheinen.",
  "Rain": "Regen",
  "Click on the green flag to start the rain simulation.": "Klicke auf die grüne Flagge, um die Regensimulation zu starten.",
  "A Raindrop sprite appears at a random position at the top of the stage": "Ein Regentropfen-Sprite erscheint an einer zufälligen Position oben auf der Bühne",
  "A Raindrop sprite appears at a random position at the top of the stage. Think which coordinate is constant there, and which one changes randomly?": "Ein Regentropfen-Sprite erscheint an einer zufälligen Position oben auf der Bühne. Überlege, welche Koordinate dort konstant ist und welche sich zufällig ändert?",
  "The Raindrop sprite is moving down": "Der Regentropfen-Sprite bewegt sich nach unten",
  "Program the Raindrop sprite to move downward. What coordinate will change?": "Programmiere den Regentropfen-Sprite so, dass er sich nach unten bewegt. Welche Koordinate wird sich ändern?",
  "The Raindrop sprite falls until...": "Der Regentropfen-Sprite fällt, bis...",
  "The Raindrop sprite falls until it touches the ground, i.e. the brown.": "Der Regentropfen-Sprite fällt, bis er den Boden berührt, d.h. das Braune.",
  "Repeat forever": "Wiederhole fortlaufend",
  "Program the movement of the Raindrop sprite to repeat itself always": "Programmiere die Bewegung des Regentropfen-Sprites so, dass sie sich immer wiederholt.",
  "Program 2 more raindrops": "Programmiere 2 weitere Regentropfen",
  "Duplicate the code for the other raindrops. Use commands \"hide\" and \"show\" only for raindrops 2 and 3, and don't forget about command \"wait__ seconds\" for these two sprites, so that the drops fall at different times. Any amount of time can be used.": "Dupliziere den Code für die anderen Regentropfen. Verwende die Befehle \"verstecken\" und \"zeigen\" nur für Regentropfen 2 und 3, und vergiss nicht den Befehl \"warte__ Sekunden\" für diese beiden Sprites, damit die Tropfen zu unterschiedlichen Zeiten fallen. Jede Zeitspanne kann verwendet werden.",
  "Goal": "Tor",
  "The Cat sprite always scores a goal! The Ball sprite always hits the goal, but each time it flies to a different point. Press the spacebar to run the Ball sprite.": "Der Katzen-Sprite schießt immer ein Tor! Der Ball-Sprite trifft immer das Tor, aber jedes Mal fliegt er zu einem anderen Punkt. Drücke die Leertaste, um den Ball-Sprite zu starten.",
  "Conversation with the Cat sprite": "Gespräch mit dem Katzen-Sprite",
  "Program the sprite Cat's lines": "Programmiere die Sprite-Katzenzeilen",
  "When you press the key, the Ball sprite goes toward the goal": "Wenn du die Taste drückst, bewegt sich der Ball-Sprite in Richtung des Tores.",
  "When you press the spacebar, the Ball sprite returns to the starting point and then flies into the goal.": "Wenn du die Leertaste drückst, kehrt der Ball-Sprite zum Startpunkt zurück und fliegt dann ins Tor.",
  "The Ball sprite flies to different points": "Der Ball-Sprite fliegt zu verschiedenen Punkten",
  "We set the coordinate ranges using the \"pick random __ to __\" block. This time we need 2 commands. Study the dimensions of the goal.": "Wir legen die Koordinatenbereiche mit dem Block \"wähle zufällig __ bis __\" fest. Diesmal benötigen wir 2 Befehle. Studiere die Abmessungen des Tores.",
  "Catch the ball": "Fange den Ball",
  "Drag the platform with your mouse. Program the Ball sprite so that when it collides with the platform, the sprite flies in different directions. Use only the commands available on the canvas.": "Ziehe die Plattform mit der Maus. Programmiere den Ball-Sprite so, dass er, wenn er mit der Plattform kollidiert, in verschiedene Richtungen fliegt. Verwende nur die auf der Leinwand verfügbaren Befehle.",
  "Set the initial position of the Ball sprite.": "Lege die Anfangsposition des Ball-Sprites fest.",
  "The Ball sprite starts to move in random directions": "Der Ball-Sprite beginnt sich in zufällige Richtungen zu bewegen",
  "The Ball sprite starts to move down, but not always in the direction of 180: sometimes it deflects either to the right or to the left. Program that movement using these commands.": "Der Ball-Sprite beginnt sich nach unten zu bewegen, aber nicht immer in Richtung 180: Manchmal weicht er nach rechts oder links ab. Programmiere diese Bewegung mit diesen Befehlen.",
  "Ball bouncing": "Ball springt ab",
  "The Ball sprite bounces off the platform, turning in a random direction away from the platform.": "Der Ball-Sprite springt von der Plattform ab und dreht sich in eine zufällige Richtung von der Plattform weg.",
  "Tennis": "Tennis",
  "Use the left and right arrows to control the platform, hit the Ball sprite, and don't let it fly to the bottom edge! Look, after it's hit, the sprite rotates at different angles!": "Verwende die Pfeiltasten links und rechts, um die Plattform zu steuern, treffe den Ball-Sprite und lass ihn nicht zum unteren Rand fliegen! Schau, nachdem er getroffen wurde, dreht sich der Sprite in verschiedenen Winkeln!",
  "Controlling the platform": "Steuerung der Plattform",
  "Program the platform controls.": "Programmiere die Plattformsteuerung.",
  "Continuous movement of the Ball sprite": "Fortlaufende Bewegung des Ball-Sprites",
  "You're already familiar with this movement! Shall we program it?": "Du kennst diese Bewegung bereits! Sollen wir sie programmieren?",
  "Loss checking": "Verlustüberprüfung",
  "Think about at what point the game ends. How is a loss indicated?": "Überlege, an welchem Punkt das Spiel endet. Wie wird ein Verlust angezeigt?",
  "*Bonus: add the ability to choose the difficulty level": "*Bonus: Füge die Möglichkeit hinzu, den Schwierigkeitsgrad auszuwählen",
  "The difficulty depends, for example, on the size of the platform. Make it so that you can choose the difficulty level.": "Die Schwierigkeit hängt zum Beispiel von der Größe der Plattform ab. Gestalte es so, dass du den Schwierigkeitsgrad auswählen kannst.",
  "*Bonus: add a second player": "*Bonus: Füge einen zweiten Spieler hinzu",
  "Redesign the game so that it can be played by two!": "Gestalte das Spiel so um, dass es von zwei Spielern gespielt werden kann!",
  "Rockfall": "Steinschlag",
  "When you click on the green flag, all the sprites take their starting positions": "Wenn du auf die grüne Flagge klickst, nehmen alle Sprites ihre Startpositionen ein",
  "The MarsBot is keyboard controlled": "Der MarsBot wird über die Tastatur gesteuert",
  "Rocks appear randomly at the top of the stage and move downward": "Steine erscheinen zufällig oben auf der Bühne und bewegen sich nach unten",
  "After touching the edge, the rock disappears and reappears at a random point at the top": "Nachdem der Rand berührt wurde, verschwindet der Stein und erscheint wieder an einem zufälligen Punkt oben.",
  "It's a win if the MarsBot lasts 20 seconds": "Es ist ein Gewinn, wenn der MarsBot 20 Sekunden überlebt.",
  "When the MarsBot and a rock touch, the loss event occurs": "Wenn der MarsBot und ein Stein sich berühren, tritt das Verlustereignis ein.",
  "Geometric shapes": "Geometrische Formen",
  "The balloon moves by itself and jumps when you press the space bar. The rules are the same for each level, only the background changes.": "Der Ballon bewegt sich von selbst und springt, wenn du die Leertaste drückst. Die Regeln sind für jedes Level gleich, nur der Hintergrund ändert sich.",
  "Gravity": "Schwerkraft",
  "The ball is affected by gravity if it does not touch the platforms.": "Der Ball wird von der Schwerkraft beeinflusst, wenn er die Plattformen nicht berührt.",
  "Rules": "Regeln",
  "There are only two rules: touching the \"lava\" (red) and the target — the green shape.": "Es gibt nur zwei Regeln: das Berühren der \"Lava\" (rot) und des Ziels — der grünen Form.",
  "Jump": "Springen",
  "We can only control the jumping of the shape. Program a jump that occurs only when you touch the platform (to be able to bounce off).": "Wir können nur das Springen der Form steuern. Programmiere einen Sprung, der nur ausgeführt wird, wenn du die Plattform berührst (um abspringen zu können).",
  "Going to the beginning of the level": "Zurück zum Anfang des Levels",
  "The balloon returns to the starting position whenever the background changes or it touches lava. We need a procedure for that.": "Der Ballon kehrt in die Startposition zurück, wenn sich der Hintergrund ändert oder er Lava berührt. Wir benötigen eine Prozedur dafür.",
  "*Bonus: modify the game as you see fit.": "*Bonus: Passe das Spiel nach deinen Wünschen an.",
  "Add new levels and change rules and controls.": "Füge neue Levels hinzu und ändere Regeln und Steuerungen.",
  "Shooting": "Schießen",
  "Enemy appears 1": "Gegner erscheint 1",
  "The enemy appears at the top of the stage.": "Der Gegner erscheint oben auf der Bühne.",
  "Second and third enemy": "Zweiter und dritter Gegner",
  "Duplicate the enemy sprite and for each enemy set the movement speed and coordinate area where it appears.": "Dupliziere den Gegner-Sprite und lege für jeden Gegner die Bewegungsgeschwindigkeit und den Koordinatenbereich fest, in dem er erscheint.",
  "For the \"Rocket\" sprite, describe the conditions under which a loss occurs.": "Beschreibe für den \"Raketen\"-Sprite die Bedingungen, unter denen ein Verlust eintritt.",
  "Fire movement": "Feuerbewegung",
  "Program the fire starting upon the click of the mouse button. The fire flies until it touches the edge or one of the enemies. When it touches something, it sends the message \"hit.\"": "Programmiere das Feuer, das beim Klicken der Maustaste startet. Das Feuer fliegt, bis es den Rand oder einen der Gegner berührt. Wenn es etwas berührt, sendet es die Nachricht \"getroffen\".",
  "Enemies react to fire hitting": "Gegner reagieren auf Feuerberührung",
  "The enemies receive the message \"hit,\" and if they touch fire, they start again.": "Die Gegner erhalten die Nachricht \"getroffen\", und wenn sie Feuer berühren, starten sie neu.",
  "*Bonus: add a main enemy": "*Bonus: Füge einen Hauptgegner hinzu",
  "Modify the game as you like. Add enemies and change their appearance. Add a main enemy.": "Passe das Spiel nach deinen Wünschen an. Füge Gegner hinzu und ändere ihr Aussehen. Füge einen Hauptgegner hinzu.",
  "*Bonus: The main enemy changes size": "*Bonus: Der Hauptgegner ändert seine Größe",
  "If you hit the main enemy, it gets smaller. If it is less than a certain value, you win.": "Wenn du den Hauptgegner triffst, wird er kleiner. Wenn er kleiner als ein bestimmter Wert ist, gewinnst du.",
  "Run the program on the flag": "Führe das Programm mit der Flagge aus",
  "This is the Frank sprite. He can jump over rocks. Control him using the arrows and don't let him get stuck in the swamp!": "Das ist der Frank-Sprite. Er kann über Felsen springen. Steuere ihn mit den Pfeiltasten und lass ihn nicht im Sumpf stecken bleiben!",
  "The Frank sprite got stuck in the swamp": "Der Frank-Sprite steckte im Sumpf fest",
  "Modify the program so that the Frank sprite says he got stuck in the swamp if he drops down too low.": "Ändere das Programm so, dass der Frank-Sprite sagt, dass er im Sumpf stecken geblieben ist, wenn er zu weit nach unten fällt.",
  "Set the original position of the Frank sprite.": "Lege die ursprüngliche Position des Frank-Sprites fest.",
  "Less than symbol": "Kleiner-als-Symbol",
  "This is the less than symbol. The number to the left of the symbol is less than the other one. The acute angle always points to the smaller number.": "Das ist das Kleiner-als-Symbol. Die Zahl links vom Symbol ist kleiner als die andere. Der spitze Winkel zeigt immer auf die kleinere Zahl.",
  "Going around walls": "Um Wände herumgehen",
  "Arrow control. Please note that the Andy sprite does not walk on walls. Just like in reality!": "Pfeilsteuerung. Bitte beachte, dass der Andy-Sprite nicht auf Wänden läuft. Genau wie in der Realität!",
  "We don't move along walls": "Wir bewegen uns nicht entlang von Wänden",
  "Complete the code that is triggered when you press the up arrow key. If the up arrow is pressed but the Y coordinate is greater than 25, no movement occurs.": "Vervollständige den Code, der ausgelöst wird, wenn du die Aufwärtspfeiltaste drückst. Wenn die Aufwärtspfeiltaste gedrückt wird, aber die Y-Koordinate größer als 25 ist, erfolgt keine Bewegung.",
  "Greater than symbol": "Größer-als-Symbol",
  "This is the greater than symbol. The number to the left of the symbol is greater than the other one. The acute angle always points to the smaller number.": "Das ist das Größer-als-Symbol. Die Zahl links vom Symbol ist größer als die andere. Der spitze Winkel zeigt immer auf die kleinere Zahl.",
  "The Goalkeeper sprite": "Der Torwart-Sprite",
  "The Goalkeeper sprite moves left and right in front of the goal, without going past it. It also starts moving from wherever it stopped last. Run it several times to check.": "Der Torwart-Sprite bewegt sich links und rechts vor dem Tor, ohne es zu überschreiten. Er beginnt auch seine Bewegung von der Stelle, an der er zuletzt angehalten hat. Führe ihn mehrmals aus, um dies zu überprüfen.",
  "Left movement": "Bewegung nach links",
  "Program the movement of the Goalkeeper sprite to the left. It must not go past the goal.": "Programmiere die Bewegung des Torwart-Sprites nach links. Er darf das Tor nicht überschreiten.",
  "Right movement": "Bewegung nach rechts",
  "Program the movement to the right.": "Programmiere die Bewegung nach rechts.",
  "Left and right control": "Links- und Rechtssteuerung",
  "Program the Frank sprite controls!": "Programmiere die Steuerung des Frank-Sprites!",
  "Program the Frank sprite so that when you press the up arrow, he will jump only if he is standing on a rock.": "Programmiere den Frank-Sprite so, dass er nur springt, wenn er auf einem Felsen steht, wenn du die Aufwärtspfeiltaste drückst.",
  "If the Frank sprite does not touch the rock, it falls, which means it moves down and the Y coordinate changes.": "Wenn der Frank-Sprite den Felsen nicht berührt, fällt er, was bedeutet, dass er sich nach unten bewegt und die Y-Koordinate sich ändert.",
  "If the Frank sprite drops down too low, he says that he is stuck in the swamp.": "Wenn der Frank-Sprite zu weit nach unten fällt, sagt er, dass er im Sumpf stecken geblieben ist.",
  "This is a real platformer game! Here gravity affects the player and you can only jump by pushing off the platform. You need to reach the goal by jumping over obstacles.": "Dies ist ein echtes Platformer-Spiel! Hier beeinflusst die Schwerkraft den Spieler, und du kannst nur springen, indem du dich von der Plattform abstößt. Du musst das Ziel erreichen, indem du über Hindernisse springst.",
  "Rule: if the player is at the bottom of the stage, you lose": "Regel: Wenn der Spieler am unteren Rand der Bühne ist, verlierst du.",
  "Other rules": "Andere Regeln",
  "Don't forget about the rest of the rules: how do enemies and obstacles work?": "Vergiss nicht die restlichen Regeln: Wie funktionieren Gegner und Hindernisse?",
  "Enemy movement in levels 1 and 2": "Gegnerbewegung in Level 1 und 2",
  "Adds enemies and program their movement!": "Füge Gegner hinzu und programmiere ihre Bewegung!",
  "Transitions between levels": "Übergänge zwischen Levels",
  "Don't forget about transitions between game levels: how do all the participants react to level changes?": "Vergiss nicht die Übergänge zwischen den Spiellevels: Wie reagieren alle Teilnehmer auf Levelwechsel?",
  "*Bonus: add new features": "*Bonus: Füge neue Funktionen hinzu",
  "Add new features like shooting, leverage, or superpowers for the main character. See an example in the next level marked with the letter \"D\"!": "Füge neue Funktionen wie Schießen, Hebelwirkung oder Superkräfte für den Hauptcharakter hinzu. Siehe ein Beispiel im nächsten Level, das mit dem Buchstaben \"D\" markiert ist!",
  "Key control. Up to jump. Reach the goal!": "Tastensteuerung. Hoch zum Springen. Erreiche das Ziel!",
  "Platformer with shooting": "Platformer mit Schießen",
  "The character jumps on the \"up\" arrow and shoots on the space bar. Try to figure out how to turn on the elevator.": "Der Charakter springt mit dem \"Aufwärts\"-Pfeil und schießt mit der Leertaste. Versuche herauszufinden, wie man den Aufzug einschaltet.",
  "Group project": "Gruppenprojekt",
  "Program your part of the group project here so you can combine them later!": "Programmiere hier deinen Teil des Gruppenprojekts, damit du sie später kombinieren kannst!",
  "Use the pages in your workbook to write your game plan.": "Verwende die Seiten in deinem Arbeitsheft, um deinen Spielplan zu schreiben.",
  "Combine": "Kombinieren",
  "Ask your teacher to help you combine the different parts of the project.": "Bitte deinen Lehrer, dir zu helfen, die verschiedenen Teile des Projekts zu kombinieren.",
  "Download the sprite": "Lade den Sprite herunter",
  "To merge two projects, transfer the sprites to the other project.": "Um zwei Projekte zusammenzuführen, übertrage die Sprites in das andere Projekt.",
  "Upload the sprite": "Lade den Sprite hoch",
  "Add your sprites to the main project.": "Füge deine Sprites zum Hauptprojekt hinzu.",
  "Download the background": "Lade den Hintergrund herunter",
  "Upload the background": "Lade den Hintergrund hoch",
  "Upload the backgrounds to the main project": "Lade die Hintergründe in das Hauptprojekt hoch",
  "Greeting": "Begrüßung",
  "Run the project and answer the questions.": "Führe das Projekt aus und beantworte die Fragen.",
  "Create variables": "Erstelle Variablen",
  "How many variables do you need? How should they be named?": "Wie viele Variablen benötigst du? Wie sollten sie benannt werden?",
  "The cat asks for a password and remembers it": "Die Katze fragt nach einem Passwort und merkt es sich",
  "To remember the password, you need to write it in a variable.": "Um das Passwort zu speichern, musst du es in eine Variable schreiben.",
  "The cat asks for the password and checks it": "Die Katze fragt nach dem Passwort und überprüft es",
  "If the answer and the \"Password\" variable match, the appearance of the cat changes or it performs an action.": "Wenn die Antwort und die \"Passwort\"-Variable übereinstimmen, ändert sich das Aussehen der Katze oder sie führt eine Aktion aus.",
  "Octopus": "Oktopus",
  "The counter keeps track of how many times the octopus catches its prey.": "Der Zähler verfolgt, wie oft der Oktopus seine Beute fängt.",
  "The score is set to zero": "Der Punktestand wird auf Null gesetzt",
  "At the start, the score is 0.": "Zu Beginn ist der Punktestand 0.",
  "Controlling the octopus": "Steuerung des Oktopus",
  "Add the \"Control\" block and the \"Repeat forever\" command.": "Füge den \"Steuerung\"-Block und den Befehl \"Wiederhole fortlaufend\" hinzu.",
  "The score goes up": "Der Punktestand steigt",
  "Add the next set of commands after the control block. Note that the condition must be checked constantly.": "Füge den nächsten Befehlssatz nach dem Steuerungsblock hinzu. Beachte, dass die Bedingung ständig überprüft werden muss.",
  "Guess the number": "Errate die Zahl",
  "The MarsBot chooses a number from 1 to 10. Try to guess what the number is.": "Der MarsBot wählt eine Zahl von 1 bis 10. Versuche zu erraten, welche Zahl es ist.",
  "Rules of the game": "Spielregeln",
  "Program the \"Game Rules\" block so that the MarsBot explains the rules.": "Programmiere den \"Spielregeln\"-Block, damit der MarsBot die Regeln erklärt.",
  "The MarsBot thinks of a number": "Der MarsBot denkt sich eine Zahl aus",
  "Program the Question-Answer block. Set the \"Secret number\" variable to a random value.": "Programmiere den Frage-Antwort-Block. Setze die Variable \"Geheime Zahl\" auf einen zufälligen Wert.",
  "The user enters a number": "Der Benutzer gibt eine Zahl ein",
  "The MarsBot asks the user.": "Der MarsBot fragt den Benutzer.",
  "Condition checking": "Bedingungsüberprüfung",
  "The MarsBot says whether the user guessed the number or not. If not, it says the secret number. Use the \"combine\" command.": "Der MarsBot sagt, ob der Benutzer die Zahl erraten hat oder nicht. Wenn nicht, sagt er die geheime Zahl. Verwende den Befehl \"kombinieren\".",
  "Play the game. Write the same!": "Spiele das Spiel. Schreibe dasselbe!",
  "The sprite explains the rules of the game.": "Der Sprite erklärt die Spielregeln.",
  "Number input and comparing it with the secret one": "Zahleneingabe und Vergleich mit der geheimen Zahl",
  "The sprite asks for a number until it is guessed.": "Der Sprite fragt nach einer Zahl, bis sie erraten ist.",
  "Tips": "Tipps",
  "The sprite says whether the secret number is higher or lower than the entered one.": "Der Sprite sagt, ob die geheime Zahl höher oder niedriger als die eingegebene ist.",
  "The program calculates how many attempts the player took to guess the secret number.": "Das Programm berechnet, wie viele Versuche der Spieler benötigt hat, um die geheime Zahl zu erraten.",
  "M3T2.1 Demo 2": "M3T2.1 Demo 2",
  "If the octopus touches its prey, the score goes up": "Wenn der Oktopus seine Beute berührt, steigt der Punktestand.",
  "The octopus moves in the direction of the mouse pointer": "Der Oktopus bewegt sich in Richtung des Mauszeigers",
  "*When the mouse isn't moving, the octopus isn't moving either.": "*Wenn die Maus sich nicht bewegt, bewegt sich der Oktopus auch nicht.",
  "The octopus only goes when the distance to the mouse pointer is less than 5.": "Der Oktopus bewegt sich nur, wenn der Abstand zum Mauszeiger weniger als 5 beträgt.",
  "Race across the planet": "Rennen über den Planeten",
  "The snowman is traveling so fast that only the player can help it change clothes in time! \"Left arrow\" - puts on winter clothes; \"Right arrow\" - puts on summer clothes. Hurry before the snowman freezes or melts!": "Der Schneemann reist so schnell, dass nur der Spieler ihm helfen kann, rechtzeitig die Kleidung zu wechseln! \"Linker Pfeil\" - zieht Winterkleidung an; \"Rechter Pfeil\" - zieht Sommerkleidung an. Beeile dich, bevor der Schneemann friert oder schmilzt!",
  "Snowman costume change": "Schneemann-Kostümwechsel",
  "Program condition checking using a logical operator and the \"background: number\" and \"costume: number\" built-in variables.": "Programmiere die Bedingungsüberprüfung mit einem logischen Operator und den integrierten Variablen \"Hintergrund: Zahl\" und \"Kostüm: Zahl\".",
  "Soccer field": "Fußballfeld",
  "Run the program on the green flag. Switch the view by clicking on the mouse.": "Führe das Programm mit der grünen Flagge aus. Wechsle die Ansicht durch Klicken auf die Maus.",
  "Background number": "Hintergrundnummer",
  "The ball takes a different position depending on the background number.": "Der Ball nimmt eine andere Position ein, abhängig von der Hintergrundnummer.",
  "Cat bot 1": "Katzen-Bot 1",
  "Study the project. The cat asks for the username and greets them. Let's program it.": "Studiere das Projekt. Die Katze fragt nach dem Benutzernamen und begrüßt ihn. Lass es uns programmieren.",
  "The cat asks for a name and remembers it.": "Die Katze fragt nach einem Namen und merkt ihn sich.",
  "The cat asks for a name and remembers it. To program that, use the following commands.": "Die Katze fragt nach einem Namen und merkt ihn sich. Um das zu programmieren, verwende die folgenden Befehle.",
  "The cat calls the user by name": "Die Katze ruft den Benutzer beim Namen",
  "The cat refers to the user by name. To program that, use the following commands.": "Die Katze spricht den Benutzer mit Namen an. Um das zu programmieren, verwende die folgenden Befehle.",
  "Cat bot 2": "Katzen-Bot 2",
  "Study how the cat bot works. It asks the user's age and responds. Let's program it.": "Studiere, wie der Katzen-Bot funktioniert. Er fragt nach dem Alter des Benutzers und antwortet. Lass es uns programmieren.",
  "The cat asks for an age": "Die Katze fragt nach einem Alter",
  "The cat asks the user's age and remembers it. To program that, use the following commands.": "Die Katze fragt nach dem Alter des Benutzers und merkt es sich. Um das zu programmieren, verwende die folgenden Befehle.",
  "The cat communicates": "Die Katze kommuniziert",
  "The cat uses the age value to refer to the user. To program that, use the following commands.": "Die Katze verwendet den Alterswert, um den Benutzer anzusprechen. Um das zu programmieren, verwende die folgenden Befehle.",
  "The cat's age": "Das Alter der Katze",
  "The cat's age is a random variable.": "Das Alter der Katze ist eine zufällige Variable.",
  "Record the values you need in variables": "Speichere die benötigten Werte in Variablen",
  "The player enters a name and age.": "Der Spieler gibt einen Namen und ein Alter ein.",
  "Use variable values": "Verwende Variablenwerte",
  "Let the cat call you by name and compare ages!": "Lass die Katze dich beim Namen nennen und vergleiche die Alter!",
  "Apple picking season": "Apfelerntezeit",
  "It's time to pick apples. They are already falling from the tree themselves. There's a basket under the apple tree and you can find out how many apples have fallen into the basket, and how many missed it. Let's program it.": "Es ist Zeit, Äpfel zu pflücken. Sie fallen bereits selbst vom Baum. Unter dem Apfelbaum steht ein Korb, und du kannst herausfinden, wie viele Äpfel in den Korb gefallen sind und wie viele daneben. Lass es uns programmieren.",
  "Variables": "Variablen",
  "In order to keep score of the apples, you need \"Collected\" and \"Missed\" variables. These variables should be set to 0 when starting the project to avoid confusion.": "Um den Punktestand der Äpfel zu erfassen, benötigen Sie die Variablen \"Gesammelt\" und \"Verpasst\". Diese Variablen sollten beim Start des Projekts auf 0 gesetzt werden, um Verwirrung zu vermeiden.",
  "Set the initial placement so that the apples fall from the apple tree and are of the correct size.": "Legen Sie die Anfangsposition fest, damit die Äpfel vom Apfelbaum fallen und die richtige Größe haben.",
  "Falling apples": "Fallende Äpfel",
  "We program the apples to fall down, and to make it more realistic, we make the apples rotate.": "Wir programmieren die Äpfel so, dass sie fallen, und um es realistischer zu machen, lassen wir die Äpfel rotieren.",
  "Counting missed apples": "Zählen der verpassten Äpfel",
  "Within a \"repeat forever\" command, create a condition check for missing the basket.": "Erstellen Sie innerhalb eines \"Wiederhole für immer\"-Befehls eine Bedingungsprüfung für das Verpassen des Korbs.",
  "Counting the apples that make it into the basket": "Zählen der Äpfel, die in den Korb gelangen",
  "Create a condition that checks if an apple makes it into the basket or not. The condition should always be checked.": "Erstellen Sie eine Bedingung, die überprüft, ob ein Apfel in den Korb gelangt oder nicht. Die Bedingung sollte immer geprüft werden.",
  "Catch the balls": "Fange die Bälle",
  "Catch the ball 5 times. To do that, control the basket using the arrows on the keyboard.": "Fange den Ball 5 Mal. Steuere dazu den Korb mit den Pfeiltasten auf der Tastatur.",
  "When you click on the green flag, all the sprites take their starting positions.": "Wenn Sie auf die grüne Flagge klicken, nehmen alle Figuren ihre Startpositionen ein.",
  "Basket control": "Steuerung des Korbs",
  "Program the basket so that it can be controlled from the keyboard.": "Programmiere den Korb so, dass er mit der Tastatur gesteuert werden kann.",
  "Ball falling": "Fallender Ball",
  "Program the ball to always fall down": "Programmiere den Ball so, dass er immer nach unten fällt.",
  "Moving the ball up the screen": "Den Ball nach oben bewegen",
  "After reaching the bottom edge, the ball disappears and reappears at a random point at the top. Program that.": "Nachdem der Ball den unteren Rand erreicht hat, verschwindet er und erscheint an einer zufälligen Stelle oben wieder. Programmiere dies.",
  "Counting missed balls": "Zählen der verpassten Bälle",
  "Within a \"repeat forever\" command, create a condition check for the ball missing the basket.": "Erstellen Sie innerhalb eines \"Wiederhole für immer\"-Befehls eine Bedingungsprüfung, ob der Ball den Korb verpasst.",
  "Counting the balls that make it into the basket": "Zählen der Bälle, die in den Korb gelangen",
  "Create a condition that checks if a ball makes it into the basket or not. The condition should always be checked.": "Erstellen Sie eine Bedingung, die überprüft, ob ein Ball in den Korb gelangt oder nicht. Die Bedingung sollte immer geprüft werden.",
  "*Bonus: Gewinnen und Verlieren": "*Bonus: Gewinnen und Verlieren",
  "Add a check and victory announcement.": "Füge eine Überprüfung und eine Siegansage hinzu.",
  "*Bonus: announcing captured points": "*Bonus: Angekündigte Punkte",
  "*The ball moves in a random direction": "*Der Ball bewegt sich in eine zufällige Richtung",
  "The ball turns in a random direction and starts moving. If it reaches the right or left edge, it bounces off.": "Der Ball dreht sich in eine zufällige Richtung und beginnt sich zu bewegen. Wenn er den rechten oder linken Rand erreicht, prallt er ab.",
  "*Bonus: modify the game as you see fit": "*Bonus: Passe das Spiel nach Belieben an.",
  "Define the \"questions\" procedure": "Definiere die \"Fragen\"-Prozedur",
  "Request all the words you need and record them in different variables.": "Fordere alle benötigten Wörter an und speichere sie in verschiedenen Variablen.",
  "Define the \"story\" procedure": "Definiere die \"Geschichte\"-Prozedur",
  "Think of what the character will tell the player. Enter the variable values in the story.": "Überlege, was die Figur dem Spieler erzählen soll. Gib die Variablenwerte in die Geschichte ein.",
  "Kaleidoscope": "Kaleidoskop",
  "Run the project. When you press the space bar, a new drawing appears. Let's program it": "Führe das Projekt aus. Wenn du die Leertaste drückst, erscheint eine neue Zeichnung. Lass es uns programmieren.",
  "Procedure with a parameter": "Prozedur mit einem Parameter",
  "Create a procedure with a parameter and attach it to the script that draws the pattern. Be sure to call this procedure \"Flower with __ petals.\"": "Erstelle eine Prozedur mit einem Parameter und füge sie dem Skript hinzu, das das Muster zeichnet. Nenne diese Prozedur unbedingt \"Blume mit __ Blütenblättern.\"",
  "Number of petals": "Anzahl der Blütenblätter",
  "Add the \"number of petals\" parameter to the script.": "Füge den Parameter \"Anzahl der Blütenblätter\" zum Skript hinzu.",
  "When you press the space bar, the procedure \"Flower with __ petals\" is performed, and the number of petals is randomly determined from 5 to 25.": "Wenn du die Leertaste drückst, wird die Prozedur \"Blume mit __ Blütenblättern\" ausgeführt, und die Anzahl der Blütenblätter wird zufällig von 5 bis 25 bestimmt.",
  "Kaleidoscope 2": "Kaleidoskop 2",
  "Run the project. When you press a key from 3 to 9, a new pattern appears and the number of petals is equal to that number. Let's program it.": "Führe das Projekt aus. Wenn du eine Taste von 3 bis 9 drückst, erscheint ein neues Muster, und die Anzahl der Blütenblätter entspricht dieser Zahl. Lass es uns programmieren.",
  "Add the Pen extension": "Füge die Stift-Erweiterung hinzu",
  "Create a procedure with a parameter for drawing a flower": "Erstelle eine Prozedur mit einem Parameter zum Zeichnen einer Blume",
  "Program the drawing of the flower": "Programmiere das Zeichnen der Blume",
  "You will need to choose a costume, color, and rotate by the number of petals by the following number of degrees: 360/(number of petals).": "Du musst ein Kostüm, eine Farbe auswählen und die Blume um die Anzahl der Grad drehen: 360/(Anzahl der Blütenblätter).",
  "Program the choice of the number of petals": "Programmiere die Auswahl der Anzahl der Blütenblätter",
  "Make it so that when you click on the number 3, a flower with 3 petals is drawn, or when you click on 4, it has four petals.": "Sorge dafür, dass beim Klicken auf die Zahl 3 eine Blume mit 3 Blütenblättern gezeichnet wird, oder beim Klicken auf 4 eine Blume mit vier Blütenblättern.",
  "This is a 2 player game. Who will win? The first player can control their racket using the W and S keys, and the second player can control theirs using the up and down arrows.": "Dies ist ein 2-Spieler-Spiel. Wer wird gewinnen? Der erste Spieler kann seinen Schläger mit den Tasten W und S steuern, und der zweite Spieler kann seinen mit den Pfeiltasten oben und unten steuern.",
  "Program the greeting and introduction with the referee": "Programmiere die Begrüßung und Einführung durch den Schiedsrichter",
  "The referee asks for the names of the players before the game and announces them. How do we program this?": "Der Schiedsrichter fragt vor dem Spiel nach den Namen der Spieler und kündigt sie an. Wie programmieren wir das?",
  "Program the racket controls": "Programmiere die Schlägersteuerung",
  "The first player can control their racket using the W and S keys, and the second player can control theirs using the up and down arrows.": "Der erste Spieler kann seinen Schläger mit den Tasten W und S steuern, und der zweite Spieler kann seinen mit den Pfeiltasten oben und unten steuern.",
  "Find the Goal Check procedure and program it.": "Finde die Goal-Check-Prozedur und programmiere sie.",
  "Describe the victory check": "Beschreibe die Siegesüberprüfung",
  "Find the Win Check procedure and program it.": "Finde die Win-Check-Prozedur und programmiere sie.",
  "Scratch. Greeting": "Scratch. Begrüßung",
  "Bonus: Project. Enter password": "Bonus: Projekt. Passwort eingeben",
  "Land of minerals": "Land der Mineralien",
  "Test yourself. Variables in loops": "Teste dich selbst. Variablen in Schleifen",
  "Scratch. Guess the number": "Scratch. Errate die Zahl",
  "Bonus. More variables": "Bonus. Mehr Variablen",
  "Retro laboratory": "Retro-Labor",
  "Test yourself. Data types": "Teste dich selbst. Datentypen",
  "Scratch. Variables in games": "Scratch. Variablen in Spielen",
  "Bonus. Remember everything!": "Bonus. Erinnere dich an alles!",
  "Scratch. Ping-pong": "Scratch. Ping-Pong",
  "Test yourself. Game score": "Teste dich selbst. Spielstand",
  "Scratch. Flower generator": "Scratch. Blumengenerator",
  "Bonus. Store": "Bonus. Laden",
  "Martian variables": "Marsianische Variablen",
  "Test yourself. Variables as parameters": "Teste dich selbst. Variablen als Parameter",
  "Project. Chatbot": "Projekt. Chatbot",
  "Project. Chat bot. Finalization": "Projekt. Chatbot. Finalisierung",
  "Control the robot using the arrows. Collect the keys and go into the store!": "Steuere den Roboter mit den Pfeiltasten. Sammle die Schlüssel und gehe in den Laden!",
  "Create variables for the red key, blue key, and gold.": "Erstelle Variablen für den roten Schlüssel, den blauen Schlüssel und das Gold.",
  "Create variables you can use to store information about whether or not the robot has a key or gold.": "Erstelle Variablen, mit denen du speichern kannst, ob der Roboter einen Schlüssel oder Gold hat.",
  "Program the taking of the red key": "Programmiere das Aufnehmen des roten Schlüssels",
  "Program going through the red circle": "Programmiere das Durchqueren des roten Kreises",
  "Program the taking of the blue key": "Programmiere das Aufnehmen des blauen Schlüssels",
  "Program going through the blue circle": "Programmiere das Durchqueren des blauen Kreises",
  "Program the taking of the gold": "Programmiere das Aufnehmen des Goldes",
  "Run the program on the green flag. Press the space bar to change the speed of the ball.": "Führe das Programm mit der grünen Flagge aus. Drücke die Leertaste, um die Geschwindigkeit des Balls zu ändern.",
  "What happens for the \"space bar is pressed\" event?": "Was passiert beim Ereignis \"Leertaste gedrückt\"?",
  "The sprite asks for a new speed value and records it.": "Der Sprite fragt nach einem neuen Geschwindigkeitswert und speichert ihn.",
  "How can you fly at a set speed?": "Wie kannst du mit einer festgelegten Geschwindigkeit fliegen?",
  "Build such a script and run it on the green flag.": "Erstelle ein solches Skript und führe es mit der grünen Flagge aus.",
  "Colored keys": "Farbige Schlüssel",
  "Run the program on the green flag. Have the dog take one or both keys and walk to the door. The door will tell you the color of the last key taken.": "Führe das Programm mit der grünen Flagge aus. Lass den Hund einen oder beide Schlüssel nehmen und zur Tür gehen. Die Tür wird dir die Farbe des zuletzt genommenen Schlüssels mitteilen.",
  "Key touching": "Schlüsselberührung",
  "Upon touching a key, the color of the last key taken is written in the variable.": "Beim Berühren eines Schlüssels wird die Farbe des zuletzt genommenen Schlüssels in der Variable gespeichert.",
  "The door says the color": "Die Tür sagt die Farbe",
  "Upon touching the door, the door says the color of the last key taken": "Beim Berühren der Tür sagt die Tür die Farbe des zuletzt genommenen Schlüssels",
  "If no key was taken, the door says nothing": "Wenn kein Schlüssel genommen wurde, sagt die Tür nichts",
  "*Bonus: colorful doors": "*Bonus: Bunte Türen",
  "Make it so that taking the green key will open the green door, and the red one will open the red door.": "Sorge dafür, dass das Nehmen des grünen Schlüssels die grüne Tür öffnet und der rote Schlüssel die rote Tür öffnet.",
  "Excursion": "Exkursion",
  "Bonus! Help load the rocket!": "Bonus! Hilf, die Rakete zu beladen!",
  "Scratch. Let's get acquainted": "Scratch. Lass uns kennenlernen",
  "Test yourself. Linear algorithm": "Teste dich selbst. Linearer Algorithmus",
  "Building a Marsbase": "Bau einer Marsbasis",
  "Bonus! Excavations. Loops in Loops": "Bonus! Ausgrabungen. Schleifen in Schleifen",
  "Scratch. Changing looks!": "Scratch. Aussehen ändern!",
  "Test yourself. Loops": "Teste dich selbst. Schleifen",
  "Scratch. Where to start?": "Scratch. Wo anfangen?",
  "Extra task: Graphic editor": "Zusatzaufgabe: Grafikeditor",
  "Scratch. Dialogs and planning": "Scratch. Dialoge und Planung",
  "Test yourself. Initial placement": "Teste dich selbst. Anfangsposition",
  "Scratch. Events": "Scratch. Ereignisse",
  "Additional task: Clicker": "Zusatzaufgabe: Klicker",
  "Scratch. Script management": "Scratch. Skriptverwaltung",
  "Test yourself. Events": "Teste dich selbst. Ereignisse",
  "Project. Personal website": "Projekt. Persönliche Webseite",
  "Rocket flight": "Raketenflug",
  "Additional task: find the coordinates": "Zusatzaufgabe: Finde die Koordinaten",
  "Scratch. Coordinates": "Scratch. Koordinaten",
  "Test yourself. Coordinates": "Teste dich selbst. Koordinaten",
  "Collecting cargo": "Fracht sammeln",
  "Additional task — Pen": "Zusatzaufgabe – Stift",
  "Scratch. Pointing in different directions": "Scratch. In verschiedene Richtungen zeigen",
  "Test yourself. Directions": "Teste dich selbst. Richtungen",
  "Laser and plants": "Laser und Pflanzen",
  "Additional task. Artist": "Zusatzaufgabe. Künstler",
  "Scratch. Turns and rotations": "Scratch. Drehungen und Rotationen",
  "Test yourself. Degrees": "Teste dich selbst. Grad",
  "Scratch. Messages": "Scratch. Nachrichten",
  "Bonus: solve the riddle": "Bonus: Löse das Rätsel",
  "Scratch. Animation": "Scratch. Animation",
  "Test yourself. Messages": "Teste dich selbst. Nachrichten",
  "Project. Animation": "Projekt. Animation",
  "Sorting cargo": "Fracht sortieren",
  "Bonus: Hedgehog and Lightning": "Bonus: Igel und Blitz",
  "Scratch. Conditions": "Scratch. Bedingungen",
  "Test yourself. Conditions": "Teste dich selbst. Bedingungen",
  "The rocket's journey": "Die Reise der Rakete",
  "Bonus: take the apple": "Bonus: Nimm den Apfel",
  "Scratch. Changing coordinates": "Scratch. Koordinaten ändern",
  "Test yourself. Changing coordinates": "Teste dich selbst. Koordinaten ändern",
  "Scratch. Procedures": "Scratch. Prozeduren",
  "Bonus: find the error": "Bonus: Finde den Fehler",
  "Scratch. Maze": "Scratch. Labyrinth",
  "Test yourself. Procedures": "Teste dich selbst. Prozeduren",
  "Project. Game": "Projekt. Spiel",
  "Scratch. Logical operators": "Scratch. Logische Operatoren",
  "Bonus: logical operators in games": "Bonus: Logische Operatoren in Spielen",
  "Martian Chef": "Mars-Koch",
  "Test yourself": "Teste dich selbst",
  "Unknown maze": "Unbekanntes Labyrinth",
  "Bonus: Training base": "Bonus: Trainingsbasis",
  "Bonus: Maze in the dark": "Bonus: Labyrinth im Dunkeln",
  "Scratch: Condition checking": "Scratch: Bedingungsprüfung",
  "Test yourself. Conditional loops": "Teste dich selbst. Bedingte Schleifen",
  "Scratch. Random numbers": "Scratch. Zufallszahlen",
  "Bonus: Game. Geometric shapes": "Bonus: Spiel. Geometrische Formen",
  "Scratch: Shooter": "Scratch: Shooter",
  "Test yourself. Random numbers": "Teste dich selbst. Zufallszahlen",
  "Scratch. Coordinate areas": "Scratch. Koordinatenbereiche",
  "Getting the soccer field ready": "Das Fußballfeld vorbereiten",
  "Scratch: Platformer": "Scratch: Plattformer",
  "Test yourself. Coordinate areas": "Teste dich selbst. Koordinatenbereiche",
  "Gruppenprojekt": "Gruppenprojekt",
  "Additional examples": "Zusätzliche Beispiele",
  "Scratch. Begrüßung": "Scratch. Begrüßung",
  "Bonus: Projekt. Passwort eingeben": "Bonus: Projekt. Passwort eingeben",
  "Land der Mineralien": "Land der Mineralien",
  "Teste dich selbst. Variablen in Schleifen": "Teste dich selbst. Variablen in Schleifen",
  "Scratch. Errate die Zahl": "Scratch. Errate die Zahl",
  "Bonus. Mehr Variablen": "Bonus. Mehr Variablen",
  "Retro-Labor": "Retro-Labor",
  "Teste dich selbst. Datentypen": "Teste dich selbst. Datentypen",
  "Scratch. Variablen in Spielen": "Scratch. Variablen in Spielen",
  "Bonus. Erinnere dich an alles!": "Bonus. Erinnere dich an alles!",
  "Scratch. Ping-Pong": "Scratch. Ping-Pong",
  "Teste dich selbst. Spielstand": "Teste dich selbst. Spielstand",
  "Scratch. Blumengenerator": "Scratch. Blumengenerator",
  "Bonus. Laden": "Bonus. Laden",
  "Marsianische Variablen": "Marsianische Variablen",
  "Teste dich selbst. Variablen als Parameter": "Teste dich selbst. Variablen als Parameter",
  "Projekt. Chatbot": "Projekt. Chatbot",
  "Projekt. Chatbot. Finalisierung": "Projekt. Chatbot. Finalisierung",
  "Chat with the Cat-bot!": "Chatte mit dem Katzen-Bot!",
  "Add your bot that will perform actions": "Füge deinen Bot hinzu, der Aktionen ausführt",
  "At startup, the bot asks for a name and age": "Beim Start fragt der Bot nach einem Namen und Alter",
  "Choose at least 2 functions for your bot and program them!": "Wähle mindestens zwei Funktionen für deinen Bot und programmiere sie!",
  "What can your bot do? It could compare your ages, play the guitar, call a friend, or tell a story.": "Was kann dein Bot tun? Er könnte euer Alter vergleichen, Gitarre spielen, einen Freund anrufen oder eine Geschichte erzählen.",
  "Leaf fall": "Blätterfall",
  "When you click on the green flag, leaves begin to fall. The more time has passed, the more leaves there are. Let's program it.": "Wenn du auf die grüne Flagge klickst, beginnen Blätter zu fallen. Je mehr Zeit vergeht, desto mehr Blätter gibt es. Lass es uns programmieren.",
  "When you click on the green flag, clones of the leaf appear": "Wenn du auf die grüne Flagge klickst, erscheinen Klone des Blattes.",
  "To create the effect of endlessly falling leaves, use the commands \"create clone of myself\" and \"wait __ seconds\".": "Um den Effekt endlos fallender Blätter zu erzeugen, verwende die Befehle \"erstelle einen Klon von mir\" und \"warte __ Sekunden\".",
  "Leaves falling": "Fallende Blätter",
  "Let's program the leaves to fall: when a leaf starts out as a clone, it falls.": "Lass uns die Blätter so programmieren, dass sie fallen: Wenn ein Blatt als Klon startet, fällt es.",
  "Draw snowflakes!": "Zeichne Schneeflocken!",
  "Run the program and see how it works. Change it so that you get a different snowflake.": "Führe das Programm aus und sieh, wie es funktioniert. Ändere es, damit du eine andere Schneeflocke erhältst.",
  "Snowflake 1": "Schneeflocke 1",
  "Snowflake 2": "Schneeflocke 2",
  "Snowflake 3": "Schneeflocke 3",
  "Snowflake 4": "Schneeflocke 4",
  "Look: the snowflakes are rotating in different directions.": "Schau: Die Schneeflocken drehen sich in verschiedene Richtungen.",
  "Creating a local \"turn\" variable": "Erstellung einer lokalen \"Drehung\"-Variable",
  "A random turn value for each clone": "Ein zufälliger Drehwert für jeden Klon",
  "The snowflakes rotate as they fall": "Die Schneeflocken drehen sich beim Fallen",
  "Turn on video recognition by clicking \"Extension\" -> video recognition. Program the snowflakes so that you can “catch” them in motion on the video!": "Aktiviere die Videoerkennung, indem du auf \"Erweiterung\" -> Videoerkennung klickst. Programmiere die Schneeflocken so, dass du sie im Video in Bewegung \"fangen\" kannst!",
  "*Bonus": "*Bonus",
  "Program the wind: pressing the space bar blows all the snowflakes to the side!": "Programmiere den Wind: Durch Drücken der Leertaste werden alle Schneeflocken zur Seite geblasen!",
  "See what the project looks like!": "Sieh dir an, wie das Projekt aussieht!",
  "The background appears": "Der Hintergrund erscheint",
  "The background clones itself": "Der Hintergrund klont sich selbst",
  "Key control": "Tastensteuerung",
  "*The sprite appears in the background": "*Die Spielfigur erscheint im Hintergrund",
  "Constant movement of the head": "Konstante Bewegung des Kopfes",
  "The food appears": "Das Futter erscheint",
  "Making tail clones": "Erstellung von Klonen des Schwanzes",
  "Head movement control": "Steuerung der Kopfbewegung",
  "*Game restrictions: losing situations": "*Spielbeschränkungen: Verlustsituationen",
  "Think about what the snake cannot do. Touch itself and the edge? And what else?": "Überlege, was die Schlange nicht tun kann. Sich selbst und den Rand berühren? Und was noch?",
  "The flowers appear": "Die Blumen erscheinen",
  "At the start of the project, clones of flowers appear in random places on the map.": "Zu Beginn des Projekts erscheinen Klone von Blumen an zufälligen Stellen auf der Karte.",
  "Controlling the MarsBot with the mouse": "Steuerung des MarsBots mit der Maus",
  "The MarsBot is controlled from the keyboard while turning in the direction of the mouse cursor.": "Der MarsBot wird über die Tastatur gesteuert und dreht sich in Richtung des Mauszeigers.",
  "A drop of water appears": "Ein Wassertropfen erscheint",
  "When you press the mouse, a clone of a drop of water is created and flies in the direction of the mouse until it touches the edge or a plant.": "Wenn du die Maus drückst, wird ein Klon eines Wassertropfens erstellt und fliegt in Richtung der Maus, bis er den Rand oder eine Pflanze berührt.",
  "The plant gets bigger": "Die Pflanze wird größer",
  "If a drop of water touches the plant, the plant gets bigger. The plant only grows to a certain size.": "Wenn ein Wassertropfen die Pflanze berührt, wird sie größer. Die Pflanze wächst nur bis zu einer bestimmten Größe.",
  "Weeds appear, the drops of water and fire change, fire appears.": "Unkraut erscheint, die Wassertropfen und das Feuer ändern sich, Feuer erscheint.",
  "*When you press the 1 key, single firing mode is activated, which means a second press of the key is required for a second shot.": "*Wenn du die Taste 1 drückst, wird der Einzelschussmodus aktiviert, d. h. ein zweiter Tastendruck ist für einen weiteren Schuss erforderlich.",
  "*When you press the 2 key, continuous shooting mode is activated, which means you can hold down the mouse button and clones of drops will appear once every 0.1 seconds.": "*Wenn du die Taste 2 drückst, wird der Dauerschussmodus aktiviert, d. h. du kannst die Maustaste gedrückt halten und alle 0,1 Sekunden erscheinen Klone von Tropfen.",
  "*When you press the 3 key, fan firing mode is activated, which means the clones of drops get a random deviation from the original direction.": "*Wenn du die Taste 3 drückst, wird der Fächerschussmodus aktiviert, d. h. die Klone der Tropfen erhalten eine zufällige Abweichung von der ursprünglichen Richtung.",
  "Save the world from zombies!": "Rette die Welt vor Zombies!",
  "The character is controlled by arrows": "Die Figur wird mit den Pfeiltasten gesteuert",
  "The character knows how to shoot": "Die Figur kann schießen",
  "The zombies burst into tiny pieces from the bullets": "Die Zombies zerplatzen durch Kugeln in kleine Stücke",
  "The zombies appear and appear": "Die Zombies tauchen immer wieder auf",
  "Let's create a simple menu with one button": "Lass uns ein einfaches Menü mit einer Schaltfläche erstellen",
  "Create a background for the main menu": "Erstelle einen Hintergrund für das Hauptmenü",
  "Choose a background to place the name of the game and the menu buttons on.": "Wähle einen Hintergrund, um den Namen des Spiels und die Menütasten zu platzieren.",
  "Change the blue chicken and green chicken scripts": "Ändere die Skripte für das blaue und grüne Küken",
  "Create the \"game\" event. When you click on the checkbox, the chicks should hide, and when you get the \"game\" message, they should appear.": "Erstelle das \"Spiel\"-Ereignis. Wenn du auf das Kästchen klickst, sollten die Küken sich verstecken, und wenn die \"Spiel\"-Nachricht kommt, sollten sie erscheinen.",
  "Change the scripts for hens": "Ändere die Skripte für die Hühner",
  "The chickens should hide when the checkbox is clicked and appear when the “game” event is received.": "Die Hühner sollten sich verstecken, wenn das Kästchen angeklickt wird, und erscheinen, wenn das \"Spiel\"-Ereignis empfangen wird.",
  "Change the scripts for the pencil": "Ändere die Skripte für den Bleistift",
  "Create the \"New Game\" button": "Erstelle die \"Neues Spiel\"-Schaltfläche",
  "The button appears when the checkbox is clicked. When you click on the button, it sends the \"game\" message and hides.": "Die Schaltfläche erscheint, wenn das Kästchen angeklickt wird. Wenn du auf die Schaltfläche klickst, sendet sie die \"Spiel\"-Nachricht und verschwindet.",
  "Create the \"How to play?\" button and a sprite with rules": "Erstelle die \"Wie spielt man?\"-Schaltfläche und eine Figur mit Regeln",
  "Text for a sprite with rules: Hover over the chick's head and draw a path to its mother. Then draw a path for another chick in the same way. You don't have to click the mouse. Program the button so that the rules appear and disappear when you click on it.": "Text für eine Figur mit Regeln: Bewege den Mauszeiger über den Kopf des Kükens und zeichne einen Weg zu seiner Mutter. Zeichne dann auf die gleiche Weise einen Weg für ein weiteres Küken. Du musst die Maus nicht klicken. Programmiere die Schaltfläche so, dass die Regeln erscheinen und verschwinden, wenn du darauf klickst.",
  "Complete the interface design": "Vervollständige das Interface-Design",
  "Add chicks to the menu and make the buttons turn dark when pressed. Create scripts that make the menu background change to the game background when the 'New Game' button is clicked.": "Füge Küken zum Menü hinzu und lasse die Schaltflächen dunkler werden, wenn sie gedrückt werden. Erstelle Skripte, die den Menü-Hintergrund in den Spiel-Hintergrund ändern, wenn die \"Neues Spiel\"-Schaltfläche geklickt wird.",
  "Create the Mirrors game": "Erstelle das Spiel \"Spiegel\"",
  "Day 1. Create a menu with two buttons": "Tag 1. Erstelle ein Menü mit zwei Schaltflächen",
  "When you click on the How to Play button, a sprite with rules will appear. When you click on the sprite with the rules, it disappears. When you click on the New Game button, the menu disappears and the game background and game sprites appear.": "Wenn du auf die \"Wie spielt man?\"-Schaltfläche klickst, erscheint eine Figur mit Regeln. Wenn du auf diese Figur klickst, verschwindet sie. Wenn du auf die \"Neues Spiel\"-Schaltfläche klickst, verschwindet das Menü und der Spielhintergrund sowie die Spielfiguren erscheinen.",
  "Day 1. Create a script for the cursor": "Tag 1. Erstelle ein Skript für den Cursor",
  "The cursor should change its shape when pointed at the mirror.": "Der Cursor sollte seine Form ändern, wenn er auf den Spiegel zeigt.",
  "Day 1. Create a script for the glare and mirror": "Tag 1. Erstelle ein Skript für das Licht und den Spiegel",
  "The mirror should rotate when you click on it with the cursor. The glare should be in the center of the mirror and rotate with it.": "Der Spiegel sollte sich drehen, wenn du mit dem Cursor darauf klickst. Das Licht sollte sich in der Mitte des Spiegels befinden und sich mit ihm drehen.",
  "Day 1. Create a script for the rays": "Tag 1. Erstelle ein Skript für die Lichtstrahlen",
  "Clones of the ray of light fly up and reflect off the mirror. They disappear if they touch the edge or the crystal.": "Klone des Lichtstrahls fliegen nach oben und reflektieren sich am Spiegel. Sie verschwinden, wenn sie den Rand oder den Kristall berühren.",
  "Day 2. Create a script for the crystal": "Tag 2. Erstelle ein Skript für den Kristall",
  "The crystal brightens when a ray of light hits it. When 10 rays hit the crystal, the game ends.": "Der Kristall leuchtet auf, wenn ein Lichtstrahl ihn trifft. Wenn 10 Lichtstrahlen auf den Kristall treffen, endet das Spiel.",
  "Day 2. Make up the end of the game": "Tag 2. Erstelle das Spielende",
  "The final screen with the words \"You won!\" should appear at the end of the game. A second after that, a button appears on the screen to start a new game.": "Am Ende des Spiels sollte der Endbildschirm mit den Worten \"Du hast gewonnen!\" erscheinen. Eine Sekunde später erscheint eine Schaltfläche, um ein neues Spiel zu starten.",
  "Day 2. New game": "Tag 2. Neues Spiel",
  "Often, players can return to the menu at the end of the game and start a new game from there. Redesign the project so that instead of the New Game button, the Main Menu button, which takes the player back to the menu, appears on the final screen.": "Oft können Spieler am Ende des Spiels ins Menü zurückkehren und von dort ein neues Spiel starten. Gestalte das Projekt so um, dass anstelle der \"Neues Spiel\"-Schaltfläche eine \"Hauptmenü\"-Schaltfläche erscheint, die den Spieler zurück ins Menü bringt."
}






