{
  "Hey! Let's get acquainted with Scratch": "Hey! Machen wir uns mit Scratch vertraut",
  "Here are the tasks that need to be completed. To hide this window, click on the purple line to the left of the text.\nTo reopen the tasks, click on the purple line in the upper right corner.\n\nYou can find information about useful buttons in Scratch in the task list below.\nLet's open the first one!": "Hier sind die Aufgaben, die erledigt werden müssen. Um dieses Fenster auszublenden, klicken Sie auf die violette Linie links neben dem Text.\nUm die Aufgaben erneut zu öffnen, klicken Sie auf die violette Linie in der oberen rechten Ecke.\n\nInformationen zu nützlichen Schaltflächen in Scratch finden Sie in der Aufgabenliste unten.\nÖffnen wir die erste!",
  "Add a background": "Hintergrund hinzufügen",
  "Add a background to your project. Click on the animation above to see how.\nWhen the background is ready, mark the task completed by checking the box and move on to the next task!": "Fügen Sie Ihrem Projekt einen Hintergrund hinzu. Klicken Sie auf die Animation oben, um zu sehen, wie das geht.\nWenn der Hintergrund fertig ist, markieren Sie die Aufgabe als erledigt, indem Sie das Kontrollkästchen aktivieren, und fahren Sie mit der nächsten Aufgabe fort!",
  "Add sprites": "Sprites hinzufügen",
  "A sprite is a character that we program in Scratch. Add a sprite, size it, and move it to the desired location.": "Ein Sprite ist eine Figur, die wir in Scratch programmieren. Fügen Sie ein Sprite hinzu, passen Sie seine Größe an und verschieben Sie es an die gewünschte Stelle.",
  "Delete the extra sprite": "Löschen Sie das zusätzliche Sprite",
  "Click on the x to delete the sprite. If you delete a sprite by accident, click \"Edit\" -> \"Restore Sprite.\"": "Klicken Sie auf das x, um das Sprite zu löschen. Wenn Sie ein Sprite versehentlich löschen, klicken Sie auf \"Bearbeiten\" -> \"Sprite wiederherstellen.\"",
  "Save the project": "Speichern Sie das Projekt",
  "Click the \"Save\" button to save all the latest changes to the project!": "Klicken Sie auf die \"Speichern\"-Schaltfläche, um alle letzten Änderungen am Projekt zu speichern!",
  "Choose and add a suitable background for these characters! Click on the animation and see how to add a background.": "Wählen Sie einen passenden Hintergrund für diese Figuren aus und fügen Sie ihn hinzu! Klicken Sie auf die Animation und sehen Sie, wie Sie einen Hintergrund hinzufügen.",
  "Add a suitable background": "Fügen Sie einen passenden Hintergrund hinzu",
  "Save the project and go to the next level": "Speichern Sie das Projekt und gehen Sie zum nächsten Level",
  "Add suitable sprites": "Fügen Sie passende Sprites hinzu",
  "What sprites would look good against this background?": "Welche Sprites würden vor diesem Hintergrund gut aussehen?",
  "Move the sprites to suitable places using the mouse": "Verschieben Sie die Sprites mit der Maus an die passenden Stellen",
  "To delete a sprite, click on the x next to it.": "Um ein Sprite zu löschen, klicken Sie auf das x daneben.",
  "Choose a suitable background": "Wählen Sie einen passenden Hintergrund",
  "Please note: there are already a few ready-made backgrounds in the project. You just need to choose the right one.": "Bitte beachten Sie: Es gibt bereits einige vorgefertigte Hintergründe im Projekt. Sie müssen nur den richtigen auswählen.",
  "Choose a background from those that are available in the project": "Wählen Sie einen Hintergrund aus denen aus, die im Projekt verfügbar sind",
  "Choose the costume you want": "Wählen Sie das gewünschte Kostüm aus",
  "Let the dog look at you. Can you find the right costume?": "Lassen Sie sich vom Hund ansehen. Können Sie das richtige Kostüm finden?",
  "Ask a question": "Stellen Sie eine Frage",
  "If you can't solve a task, write to the teacher in the special chat — Marsgram!": "Wenn Sie eine Aufgabe nicht lösen können, schreiben Sie dem Lehrer im speziellen Chat – Marsgram!",
  "Add a phrase": "Fügen Sie einen Satz hinzu",
  "What will your snowman say?": "Was wird Ihr Schneemann sagen?",
  "The start of the script": "Der Beginn des Skripts",
  "The script starts with the command \"When the green flag is clicked.\"": "Das Skript beginnt mit dem Befehl \"Wenn auf die grüne Flagge geklickt wird.\"",
  "Finish the Mars project": "Das Mars-Projekt beenden",
  "Look, the programmer hasn't completed this project! Finish it.": "Schauen Sie, der Programmierer hat dieses Projekt nicht abgeschlossen! Beenden Sie es.",
  "Change the background from Earth to Mars": "Ändern Sie den Hintergrund von der Erde zum Mars",
  "Use the command \"speak...\"": "Verwenden Sie den Befehl \"sprechen...\"",
  "Choose and add a suitable background for these characters!": "Wählen und fügen Sie einen passenden Hintergrund für diese Charaktere hinzu!",
  "Finish the project at your own discretion": "Beenden Sie das Projekt nach eigenem Ermessen"
},
{
  "See how the project should work": "Sehen Sie, wie das Projekt funktionieren soll",
  "Add a command to start the project": "Fügen Sie einen Befehl hinzu, um das Projekt zu starten",
  "The project should be run by clicking on the green flag.": "Das Projekt sollte durch Klicken auf die grüne Flagge gestartet werden.",
  "Add a command for the bear to speak.": "Fügen Sie einen Befehl hinzu, damit der Bär spricht.",
  "The bear should say \"Hello!\" within 3 seconds.": "Der Bär sollte innerhalb von 3 Sekunden \"Hallo!\" sagen.",
  
  "Dinosaur and snake": "Dinosaurier und Schlange",
  "The snake first wriggles, then sees the dinosaur, is surprised, and then straightens its body. How do we program this?": "Die Schlange windet sich zunächst, sieht dann den Dinosaurier, ist überrascht und richtet dann ihren Körper auf. Wie programmieren wir das?",
  "Start of the script": "Start des Skripts",
  "The \"When the green flag is pressed\" command starts the script.": "Der Befehl \"Wenn die grüne Flagge angeklickt wird\" startet das Skript.",
  "Setting the costume": "Einstellen des Kostüms",
  "This command will help you to set a specific costume. We have two different costumes set.": "Dieser Befehl hilft Ihnen, ein bestimmtes Kostüm festzulegen. Wir haben zwei verschiedene Kostüme eingestellt.",
  "Expectation": "Erwartung",
  "The snake sees the dinosaur in a second instead of immediately. To prevent it from changing its costume ahead of time, we use the \"wait __ sec\" command": "Die Schlange sieht den Dinosaurier erst nach einer Sekunde statt sofort. Um zu verhindern, dass sie ihr Kostüm zu früh wechselt, verwenden wir den Befehl \"warte __ Sek\".",

  "The \"Heart\" project": "Das \"Herz\"-Projekt",
  "Take a look at the example. The heart changes costume 4 times. Each costume is visible for 1 second.\n\nCan you do the same?": "Schauen Sie sich das Beispiel an. Das Herz wechselt viermal das Kostüm. Jedes Kostüm ist für 1 Sekunde sichtbar.\n\nKönnen Sie das auch?",
  "Costume change": "Kostümwechsel",
  "The \"Next Costume\" command changes the costume that is set next in the list of costumes.": "Der Befehl \"Nächstes Kostüm\" ändert das nächste Kostüm in der Liste.",
  "Repeating actions": "Wiederholende Aktionen",
  "For the sprite to perform an action multiple times, you need to use the \"Repeat __ times\" command. In the window, you can set the number of repetitions.": "Damit die Figur eine Aktion mehrmals ausführt, müssen Sie den Befehl \"Wiederhole __ mal\" verwenden. Im Fenster können Sie die Anzahl der Wiederholungen festlegen.",
  "Oops! If we use the \"Next costume\" command multiple times in a row, the costumes will change too quickly and we will not see how they change: it will be like nothing is happening. To prevent commands from being executed almost simultaneously, we insert a \"pause.\" To do this, we need the \"Wait __ sec\" command.": "Ups! Wenn wir den Befehl \"Nächstes Kostüm\" mehrmals hintereinander verwenden, wechseln die Kostüme zu schnell, und wir sehen nicht, wie sie sich ändern – es sieht aus, als würde nichts passieren. Damit die Befehle nicht gleichzeitig ausgeführt werden, fügen wir eine \"Pause\" ein. Dafür brauchen wir den Befehl \"Warte __ Sek\".",

  "The bear walks": "Der Bär läuft",
  "Program a costume change so that it seems like the bear is constantly walking! See the example.": "Programmieren Sie einen Kostümwechsel, sodass es so aussieht, als würde der Bär ständig laufen! Sehen Sie sich das Beispiel an.",
  "Constant repetition": "Ständige Wiederholung",
  "To make an action repeat itself constantly, use the \"Repeat Always\" command.": "Damit eine Aktion ständig wiederholt wird, verwenden Sie den Befehl \"Wiederhole immer\".",
  "Smooth movements": "Sanfte Bewegungen",
  "You can make the movements smoother by setting a wait before each costume change. We can set the wait time. Try setting it for 0.1 seconds! This command is already ready — just put it in the right place.": "Sie können die Bewegungen sanfter gestalten, indem Sie eine Wartezeit vor jedem Kostümwechsel einfügen. Sie können die Wartezeit festlegen. Versuchen Sie, sie auf 0,1 Sekunden zu setzen! Dieser Befehl ist bereits fertig – setzen Sie ihn einfach an die richtige Stelle.",
  "Remember where the script starts?": "Erinnern Sie sich, wo das Skript beginnt?",
  
  "Create a clock!": "Erstellen Sie eine Uhr!",
  "Look, all the backgrounds you need are already there, you just need to change them every second.": "Schauen Sie, alle benötigten Hintergründe sind bereits da, Sie müssen sie nur jede Sekunde ändern.",
  "Set the first background": "Setzen Sie den ersten Hintergrund",
  "Let the clock hands start moving from 12.": "Lassen Sie die Zeiger der Uhr bei 12 starten.",
  "Change the background": "Hintergrund ändern",
  "Change the background using the \"Next Background\" command. Program the background to change every second.": "Ändern Sie den Hintergrund mit dem Befehl \"Nächster Hintergrund\". Programmieren Sie den Hintergrund so, dass er sich jede Sekunde ändert.",
  "Program the background change to repeat": "Programmieren Sie die Wiederholung des Hintergrundwechsels",
  "If you accidentally delete the script": "Wenn Sie das Skript versehentlich löschen",
  "Simultaneously press the \"CTRL\" and \"Z\" keys in the lower-left corner of the keyboard.": "Drücken Sie gleichzeitig die Tasten \"STRG\" und \"Z\" in der unteren linken Ecke der Tastatur.",

  "Super cat": "Super-Katze",
  "The super cat grows in size. Program the same!": "Die Super-Katze wächst. Programmieren Sie dasselbe!",
  "Smoothly resize the sprite using a loop": "Ändern Sie die Größe der Figur sanft mit einer Schleife.",
  "Use a loop to resize smoothly.": "Verwenden Sie eine Schleife, um die Größe sanft zu ändern.",
  "Set the size": "Größe festlegen",
  "Set the size you want at the beginning of the script.": "Legen Sie die gewünschte Größe zu Beginn des Skripts fest.",
  "Cat talks": "Die Katze spricht",
  "The cat should say \"I am super cat!\" before growing.": "Die Katze sollte \"Ich bin Super-Katze!\" sagen, bevor sie wächst.",
  "Sprite size": "Figurengröße",
  "Here you can find out what size the sprite is now and also manually change it.": "Hier können Sie sehen, welche Größe die Figur derzeit hat, und sie manuell ändern.",

  "Flashing star": "Blinkender Stern",
  "The star decreases slowly and increases slowly. And it does so constantly. Shall we program it?": "Der Stern verkleinert sich langsam und vergrößert sich langsam. Und das ständig. Wollen wir es programmieren?",
  "Starting size": "Startgröße",
  "Set the desired size at the beginning of the script.": "Legen Sie die gewünschte Größe zu Beginn des Skripts fest.",
  "Resize - increase": "Größe ändern - vergrößern",
  "Use this command to increase the size.": "Verwenden Sie diesen Befehl, um die Größe zu vergrößern.",
  "Resize - decrease": "Größe ändern - verkleinern",
  "You already know the command for how to resize a sprite.\nTo reduce the size, just enter a number with a minus sign. For example, -5.": "Sie kennen bereits den Befehl zum Ändern der Größe einer Figur.\nUm die Größe zu reduzieren, geben Sie einfach eine Zahl mit einem Minuszeichen ein, z. B. -5.",
  "The star is steadily increasing and decreasing": "Der Stern vergrößert und verkleinert sich gleichmäßig",
  "Use two loops in a row.": "Verwenden Sie zwei Schleifen hintereinander."
}

